[
    {
        "title": "Middle Python-разработчик",
        "url": "https://hh.ru/vacancy/71363471?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Реализация микросервисов (написание с нуля, либо вынесение из имеющегося кода). Расширение существующего REST API. Реализация взаимодействия с внешними сервисами. \nУверенное знание Python 3. Знание алгоритмов и структур данных. Уверенное знание Django (Flask будет плюсом), SQL, Docker. Понимание микросервисной архитектуры. ",
        "company": "ОООНУР Телеком"
    },
    {
        "title": "Python разработчик системы A/B-экспериментов",
        "url": "https://hh.ru/vacancy/71430900?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Развитием внутреннего фреймворка и оптимизацией расчетов. Добавлением новых функций, связанных с проверкой качества продуктовых метрик. UX оптимизацией системы в целом...\nЗнает Python, Flask и SQL (Presto, Postgres), а также умеет разбирать и улучшать чужой код. Умеет в фронтенд фреймворки (стандарт...",
        "company": "ОООHeadHunter::Backend"
    },
    {
        "title": "Data Engineer/ Аналитик данных",
        "url": "https://hh.ru/vacancy/69658696?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Построение витрин данных (Hive-SQL, Spark) с погружением в бизнес-процессы и аналитику данных. Уточнение требований заказчика, системный анализ, изучение...\nОпыт работы с реляционными и noSQL базами данных. Уверенные знания SQL. Знание Python или Scala. Знание планировщиков процессов (AirFlow, Oozie). ",
        "company": "Банк ВТБ (ПАО)"
    },
    {
        "title": "Senior backend - разработчик на python",
        "url": "https://hh.ru/vacancy/71434747?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Внимание: с командами не работаем, только с индивидуальными исполнителями. — Профессиональный рост и участие в построении архитектур сложных систем.\nОпыт разработки сложных проектов. — Обязателен опыт работы с django 3.*, python 3.7, django-rest-framework. — Знание SQL (в частности...",
        "company": "ОООФуллстатс"
    },
    {
        "title": "Algorithm Developer",
        "url": "https://hh.ru/vacancy/71436439?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Develop new computational biology algorithms, tools and software for our world leading Spatial Transcriptomics (ST) technology. Process and analyse high...\n1-3 years proficiency with statistics or machine learning methods. Ability to program in Python or R. Bachelor’s or...",
        "company": "MGI"
    },
    {
        "title": "Дата-инженер / Data Engineer",
        "url": "https://hh.ru/vacancy/71236005?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Design and implement technical solutions to obtain, process, and store data. Automate and optimize internal ETL processes in MS Azure. \nA university degree (DipHE) is required. Python and SQL programming skills. Cloud understanding. Good command of English (Upper-Intermediate or...",
        "company": "«Procter & Gamble», Молодой специалист"
    },
    {
        "title": "Senior Data Scientist / ML Engineer",
        "url": "https://hh.ru/vacancy/69972583?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Извлечение и обработка массивов данных, а также по возможности автоматизация данных процессов. Обучение и тестирование моделей машинного обучения. \nХорошее знание SQL, опыт работы с БД, опыт написания сложных запросов. Уверенное знание Python (scikit-learn, tensorflow, pandas, numpy, matplotlib). ",
        "company": "ОООБринго"
    },
    {
        "title": "Data Engineer",
        "url": "https://hh.ru/vacancy/71349596?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Jigsaw Puzzle Collection HD для iOS для Android. Solitaire — Classic Card Game для iOS для Android. Block Blast — Puzzle Game...\nОпыт работы с BigQuery и MySQL. Отличные навыки работы с SQL. Опыт работы с Airflow, dbt. Хорошие знания Python.",
        "company": "ОООВераксен Бел"
    },
    {
        "title": "Data Engineer",
        "url": "https://hh.ru/vacancy/71323584?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Реализация процессов обработки данных на технологическом стеке Hadoop. Реализация процессов тестирования данных на технологическом стеке Hadoop. Реализация процессов обмена данными...\nЛюбовь к автоматизации рутинных задач на скриптовых языках (shell/awk/sed, python). Опыт разработки на java (не обязательно глубоко разбираться...",
        "company": "ОООHeadHunter:: IT"
    },
    {
        "title": "Инженер по Нагрузочному Тестированию",
        "url": "https://hh.ru/vacancy/68119167?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка и поддержание скриптов нагрузочного тестирования. Проведение нагрузочного тестирования микросервисных приложений. Подбор оптимальной конфигурации КТС для обеспечения требуемой производительности. \nЗнания одного из языков программирования: Java, Python, C#. Знания SQL, OpenShift/Kubernetes/Docker, Linux. Опыт анализа производительности Oracle (AWR, ASH). ",
        "company": "Сбер. IT"
    },
    {
        "title": "Программист",
        "url": "https://hh.ru/vacancy/71368199?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка гибких архитектур систем управления, позволяющих эффективно работать с различным оборудованием и различными приложениями (в области робототехники). Разработка и оптимизация...\nВысокий уровень знаний C++11 (или выше) и/или Python 2.7/3.5. Знание ROS. Знание SQL/MySQL (преимущества...",
        "company": "HARTUNG"
    },
    {
        "title": "Старший продуктовый аналитик в команду «Поиск заказов»",
        "url": "https://hh.ru/vacancy/67773818?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Погрузиться во все текущие A/B-тесты команды, взять их анализ на себя. Разработать план по улучшению процессов A/B...\nВладение SQL, Python. Можешь самостоятельно моделировать, валидировать метрики, анализировать результаты тестов. Умение объяснять сложные вещи простыми словами. Сможешь презентовать результаты...",
        "company": "Профи (profi.ru)"
    },
    {
        "title": "Senior Algorithm Developer",
        "url": "https://hh.ru/vacancy/71436419?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Develop new computational biology algorithms, tools and software for our world leading Spatial Transcriptomics (ST) technology. Process and analyse high...\n+3 years proficiency with statistics or machine learning methods. Ability to program in Python or R. Experiences in bioinformatics...",
        "company": "MGI"
    },
    {
        "title": "Аналитик аудита информационных технологий",
        "url": "https://hh.ru/vacancy/71019461?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Аудит процессов, связанных с информационными технологиями. Формирование и подтверждение гипотез на основе анализа данных (презентация используемых методов и алгоритмов). \nОпыт работы с базами данных Oracle, MS SQL. Знание языков SQL, Python, Java, опыт программирования, разработки ПО. Умение структурировать информацию...",
        "company": "Сбер для экспертов"
    },
    {
        "title": "Продуктовый аналитик в направление «Работодательские сервисы»",
        "url": "https://hh.ru/vacancy/69072132?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Отлично знаешь SQL. Знаком с Python на уровне основных библиотек для анализа данных. Работал с аналитическими системами для бизнес-анализа...\nУже получил высшее математическое или техническое образование. Имеешь опыт работы аналитиком больше года. Готов вести несколько проектов одновременно и самостоятельно...",
        "company": "ОООHeadHunter::Product Management"
    },
    {
        "title": "Python developer (Senior)",
        "url": "https://hh.ru/vacancy/54956212?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработкой архитектуры, поддержкой, развитием и оптимизацией проектов. Проектированием и развитием архитектуры баз данных. Разработкой новой функциональности и улучшением имеющейся. \nОтличные знания Python. Высокий уровень знаний Django. Разнообразный опыт работы с asyncio, aiohttp. Большой опыт разработки высоконагруженных и распределенных систем. ",
        "company": "ОООВайт Код"
    },
    {
        "title": "ML Team Lead (Играющий тренер data scientist)",
        "url": "https://hh.ru/vacancy/70994665?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Основной проект компании - разработка унифицированной платформы для создания, тестирования и непрерывной поставки готовых торговых роботов для биржевой торговли. \nОпыт коммерческой разработки в области DS/ML на Python. Опыт создания ML pipelines и организации процессов MLOps. GitLab. ",
        "company": "ОООНСК ЭкоСфера"
    },
    {
        "title": "Программист - архитектор баз данных (Хранилище и BI)",
        "url": "https://hh.ru/vacancy/49791229?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка и поддержка ETL-процессов на базе T-SQL, Python, SSIS. Сопровождение портала BI на SharePoint. Разработка обмена/репликации данными...\nГлубокие знания SSAS, MDX, Python, SSIS. Уверенное знание T-SQL и опыт работы с базами данных. Знание принципов построения хранилища...",
        "company": "Henderson"
    },
    {
        "title": "Middle / Senior QA инженер",
        "url": "https://hh.ru/vacancy/47759634?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Обнаружение, документирование и отслеживание дефектов. Взаимодействие с разработчиками, аналитиками. Работа с автотестами - запуск, разбор падений, написание. Участие в проработке задач.\nЗнание методов и методик тестирования. Опыт тестирования web-приложений (frontend & backend). Опыт работы в командной строке linux-подобных операционных систем. ",
        "company": "ОООHeadHunter::QA"
    },
    {
        "title": "Разработчик C# / Python",
        "url": "https://hh.ru/vacancy/71147348?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка систем анализа, обработки и визуализации данных, в т.ч. Big data. Автоматизация бизнес-операций и интеграция с текущими процессами.\nОпыт разработки приложений на базе С# под .NET Core от 3 лет. Опыт работы с Python 3 (numpy, pandas, sklearn...",
        "company": "ОООДубайт"
    },
    {
        "title": "Python / django разработчик",
        "url": "https://hh.ru/vacancy/71261516?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "участие в проектировании системы. - разработка логики веб-сервиса, основанного на python/django. - разработка интеграционных решений. - дальнейшая поддержка решения.\nхорошо знать и уметь работать со стеком python+django. - понимать принципы MVC. - умение реализовывать сложные алгоритмы по обработке данных. - ",
        "company": "Иторум"
    },
    {
        "title": "Python-разработчик / Backend-разработчик",
        "url": "https://hh.ru/vacancy/71030778?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать новую функциональность для Продуктов. Стабилизировать кодовую базу - писать тесты, править баги. Разрабатывать и поддерживать вспомогательные библиотеки (UI-библиотека, storybook...\n...в языке Python и можешь работать с микросервисной архитектурой. Имеешь опыт настройки среды Linux / Unix с помощью инструментов Python. ",
        "company": "ОООАкадемия Создания Капитала"
    },
    {
        "title": "Data Analyst",
        "url": "https://hh.ru/vacancy/71080058?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Писать скрипты для обработки данных на SQL и Python. Делать аналитические отчёты по запросам клиентов, строить графические и табличные аналитические...\nОпыт работы с табличными данными. Навыки работы с данными на языке Python (NumPy, Pandas). Опыт написания SQL запросов. ",
        "company": "MacBuildServer"
    },
    {
        "title": "Computer Vision Research Scientist (удаленно)",
        "url": "https://hh.ru/vacancy/71429601?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Исследование нейросетей по компьютерному зрению. Создание новых архитектур нейросетей для semantic image segmentation, small object detection and localization, text recognition...\nОпыт работы с нейронными сетями от трех лет. Хорошее знание Python, Jupyter NB. Опыт работы с TensorFlow / PyTorch. ",
        "company": "ZennoLab"
    },
    {
        "title": "Middle Python разработчик (remote)",
        "url": "https://hh.ru/vacancy/71416568?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Middle Python разработчик на зарубежный проект (remote). Broniboy - сервис доставки еды, продуктов, лекарств, цветов и тд., который позволяет получить что...\nНас не интересует диплом и прочие формальности. Быстро примем решение и не будем тянуть. Будет плюсом опыт работы с: PostGIS. ",
        "company": "Broniboy"
    },
    {
        "title": "Python разработчик",
        "url": "https://hh.ru/vacancy/70543906?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Компания имеет IT аккредитацию и выполняет ГОЗ. На военкомат эти аргументы действуют. Одного сотрудника призвали и отпустили после предъявления необходимых...\nПонимание ООП, знание паттернов разработки, принципов SOLID, DRY, KISS. Опыт работы с языком программирования Python от 2-х лет. ",
        "company": "ОООСофтЛаб-НСК"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/71228741?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Развивать, поддерживать и оптимизировать проекты компании. Проектировать и развивать архитектуры баз данных. Развивать CI/CD, ревью кода и процесс разработки...\nОпыт работы с Linux, systemd , контейнерами, умение запустить свой код. Опыт работы с несколькими python фреймворками. Опыт разработки парсеров, опыт...",
        "company": "ОООЛаборатория 50"
    },
    {
        "title": "Python разработчик",
        "url": "https://hh.ru/vacancy/71317435?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Platform V – облачная цифровая платформа для разработки бизнес-решений enterprise-уровня. Мы - молодая команда, занимаемся администрированием микросервисной архитектуры, поддержкой и...\nОпыт оптимизации производительности высоконагруженных систем. Опыт развертывания и администрирования Python-приложений. Администрирование WEB-Серверов (Nginx). Опыт настройки серверов с балансировкой...",
        "company": "SberTech"
    },
    {
        "title": "Middle Python Developer",
        "url": "https://hh.ru/vacancy/71328669?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Написание и обслуживание скриптов для веб-скрейпинга.\n2+ года опыт разработки на Python. Опыт работы с Linux, Bash-scripting. Опыт с Git. Опыт с PostgreSQL, MySQL. ",
        "company": "ИПMuxtarova Anna Irikovna"
    },
    {
        "title": "Backend Python Developer (Middle)",
        "url": "https://hh.ru/vacancy/71102438?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработкой высоконагруженных backend-сервисов. Пользовательская разработка API для внешних интеграций. Масштабирование: подготовка к запускам крупных клиентов и выстраивание нестандартных процессов...\nУверенные знания языка программирования Python. Владение многопоточным multiprocessing и асинхронными подходами asyncio, aiohttp, concurrent.futures. Опыт применения Mongo, docker, nginx, Redis...",
        "company": "KVINT"
    },
    {
        "title": "Python developer/Разработчик Python",
        "url": "https://hh.ru/vacancy/70966398?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка приложений - аналитика, внутренние сервисы, интеграция с внешними системами, веб-приложения для внутреннего и публичного использования. Работа с большими объемами...\nОпыт программирования на языке Python. Понимание систем дистрибуции Python-приложений (setuptools, virtualenv, pip). Знание и понимание основных алгоритмов и структур...",
        "company": "Internest"
    },
    {
        "title": "Data Scientist (команда Поиска)",
        "url": "https://hh.ru/vacancy/71426958?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Прототипирование и доведение своих решений до продакшна на python. Полная поддержка своих моделей: от написания запроса для выгрузки обучающей выборки...\nОпыт в ранжировании, рекомендациях, а также в nlp-задачах будет большим плюсом. Уверенное владение Python (numpy, scipy, pytorch, sklearn), приветствуется...",
        "company": "ОООHeadHunter::Analytics/Data Science"
    },
    {
        "title": "С/С++ Linux разработчик (remote)",
        "url": "https://hh.ru/vacancy/70374667?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Желательно: Опыт в разработке для Linux kernel (kernel/, mm/, net/, security/). Владение Python для написания тестовых скриптов. Хороший письменный английский...",
        "company": "ОООТемпеста"
    },
    {
        "title": "Middle Python Developer",
        "url": "https://hh.ru/vacancy/71445965?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка web части сайтов. Разработка REST сервисов. Разработка микросервисов. Разработка клиентов для работы со сторонними API. Написание unit тестов. \nОпыт работы с технологиями Redis, Rabbit MQ, Docker, либо с их аналогами. Опыт работы с SOAP, Web services и REST. ",
        "company": "ТООAVIATA.KZ"
    },
    {
        "title": "Python Developer",
        "url": "https://hh.ru/vacancy/54936646?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поработать над моделью предсказания вероятности ДТП в сервисе для расчета цены ОСАГО. Улучшать и разрабатывать парсеры (миллионы запросов в день...\nОпыт коммерческой разработки на Python. Понимание микросервисной архитектуры. Умение работать с асинхронным кодом. Знание Linux, умение работать с Git, опыт...",
        "company": "SpectrumData"
    },
    {
        "title": "Middle+ Python developer Web3",
        "url": "https://hh.ru/vacancy/70894549?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "SQL. Умеет работать с Git. Понимает принципы написания безопасного кода. Готов быстро погружаться в область Web 3.0, DeApp, DeFi. ",
        "company": "Remokate"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/71056123?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Группа компаний «Аптекарь» разрабатывает и оказывает полный спектр услуг по внедрению программного обеспечения для автоматизации аптек, аптечных сетей и медицинских...\nОпыт работы с MS SQL Server. - Желательный опыт PostgreSQL, Redis, RabbitMQ. - Знание базовых паттернов. - Опыт работы с REST API. - ",
        "company": "ОООИнформационный центр Аптекарь"
    },
    {
        "title": "Data Scientist",
        "url": "https://hh.ru/vacancy/71209351?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Обработка больших объемов структурированных данных с целью выделения зависимостей и составления прогнозов ожидаемых уровней шума. Анализ траекторий движения воздушных судов. \nОпыт работы качестве Data Scientist (Python-разработчика) не менее года. Уверенное владение стеком технологий анализа данных на Python 3 (numpy...",
        "company": "ОООЦентр экологической безопасности гражданской авиации"
    },
    {
        "title": "Python backend developer (Flask, FastAPI, Falcon)",
        "url": "https://hh.ru/vacancy/71222201?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Премии за привлечение новых сотрудников и новых клиентов. Проводим митапы по Python. Вы можете быть как и слушателем, так и...\nКакие скиллы и опыт важны: Опыт коммерческой веб-разработки от 4-х лет на Python. Опыт работы с Falcon или...",
        "company": "evrone.ru"
    },
    {
        "title": "Программист Python",
        "url": "https://hh.ru/vacancy/71332875?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Docker / Kubernetes. - OpenCV. - Scientific spirit: Interest on reading scientific papers on a regular basis and implement them.\nMust have: - Python Core. - AWS Experience. - Customer orientation. - Presentation skills. - Good communication.",
        "company": "ОООВиайпи Айти"
    },
    {
        "title": "Junior разработчик нейросетевых алгоритмов / Reinforcement Learning",
        "url": "https://hh.ru/vacancy/71038983?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Формировать свои теоретические знания и использовать их на практике. Самостоятельно реализовывать базовые RL алгоритмы. Изучать подходы в области RL. \nНаличие базовых теоретических знаний в области Reinforcement Learning. Владение Python на уровне junior разработчика (основные концепции языка, структуры данных, PEP). ",
        "company": "Федеральное автономное учреждение Государственный Научно-Исследовательский Институт Авиационных Систем"
    },
    {
        "title": "Python Back-end Разработчик / Python Back-end Developer",
        "url": "https://hh.ru/vacancy/46823861?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка back-end части веб-сервиса.\nУверенное владение Python 3.x (2.x). Опыт профессиональной командной разработки проектов на Python от 1 года. Опыт работы с...",
        "company": "Доктор Веб"
    },
    {
        "title": "Python-разработчик в R&D отдел",
        "url": "https://hh.ru/vacancy/49299311?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Написание чистого, понятного кода. Реализация сетевых клиентов и протоколов по документации. Взаимодействие с исследователями. Покрытие тестами. Написание документации. \nУверенное знание Python3. Умение использовать ООП. Знание сетевых протоколов разного уровня (TCP, UDP, HTTP, WebSocket, etc) и способов сериализации...",
        "company": "ОООСелфсек"
    },
    {
        "title": "Ведущий Python-developer",
        "url": "https://hh.ru/vacancy/71318187?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработке высоконагруженного финансового приложения. - Реализации сервиса доставки. - Развитию и сопровождению высоконагруженного приложения фиксации активности пользователей.\nУверенные знания Python, ООП. Опыт работы с PostgreSQL: построение оптимальных sql-запросов (без использования ORM), умение профилировать запросы. ",
        "company": "Тензор"
    },
    {
        "title": "Data Scientist",
        "url": "https://hh.ru/vacancy/71184598?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Крупнейшая компания FMCG в поиске DS. Будем писать бэк для системы управления промо. Система управления промо обычно оперирует в год...\nЗнать в рамках python библиотеки работы с данными (pyspark - идеал, pandas - тоже можно, там не велика разница). Знать бибилиотеки работы...",
        "company": "ОООАпптимизм"
    },
    {
        "title": "Python-разработчик систем сбора",
        "url": "https://hh.ru/vacancy/49299293?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Написание чистого, понятного кода. Реализация систем сбора. Анализ и исправление ошибок. Сопровождение запуска и эксплуатации сборщиков в продакшене.\nУверенное знание Python3. Опыт разработки систем сбора. Опыт многопоточной и асинхронной разработки (threading, asyncio), знание примитивов синхронизации, умение масштабировать...",
        "company": "ОООСелфсек"
    },
    {
        "title": "Аналитик данных / Data Analytics",
        "url": "https://hh.ru/vacancy/71054402?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Обработка информации, которая поступает от пользователей сервиса ilex (как пользователь осуществляет поиск, какими функциями чаще пользуется, частота открытия документов и...\nОпыт работы c BI инструментами (Tableau / Google Data Studio / Power BI / Apache Superset). Хорошее владение Python (pandas, numpy). ",
        "company": "ОООЮрСпектр"
    },
    {
        "title": "Low-code developer (Python) внедрение кросплатформенных приложений на базе платформы",
        "url": "https://hh.ru/vacancy/70423971?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в проектах по запуску, внедрению, сопровождению и постпроектной поддержки low code платформы Scalaxi. Сбор и анализ требований Заказчиков. \nВладение SQL на базовом уровне. Навыки владения программирования Python (от 1 года опыт коммерческой разработки, меньше и учебный опыт не...",
        "company": "Scalaxi"
    },
    {
        "title": "Quantitative Developer",
        "url": "https://hh.ru/vacancy/70339750?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Gara.Capital - IT компания, работающая в HFT индустрии. Компания занимается проведением количественных исследований и разработкой инфраструктур для торговли на финансовых рынках. \nИметь опыт работы с Git. -- Разбираться в асинхронном программировании на Python. -- Знать базовые фреймворки Python. -- Иметь опыт оптимизации кода. -- ",
        "company": "Gara.capital"
    },
    {
        "title": "Разработчик Python (backend)",
        "url": "https://hh.ru/vacancy/68873184?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать веб- приложения в команде на языке Python 3. Писать автоматические тесты для своего кода. Работа с системами контроля версий...\nНаличие высшего технического образования. Хорошее знание Python (мы используем Python 3). Опыт работы с AIOHTTP(FLASK, Django). Опыт работы с...",
        "company": "АОТочных Приборов, НИИ"
    },
    {
        "title": "Middle Python Developer",
        "url": "https://hh.ru/vacancy/71394731?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Participation in the full cycle of software development. Writing high-quality Python code. Conducting code reviews. Direct communication with English...\n...t know the word \"stop\" in your professional growth and keep pace with the latest technological advances in Python development.",
        "company": "iTechArt Group"
    },
    {
        "title": "Python developer",
        "url": "https://hh.ru/vacancy/68597229?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать backend на python. - Писать unit-тесты. - Следить за качеством кода на проекте, предлагать улучшения.\nЗнания, опыт коммерческой и командной разработки на python oт 2-х лет. - Уверенные знания Python 3. - Опыт работы с Django...",
        "company": "EvoSoft"
    },
    {
        "title": "Junior Product manager/ Аналитик ( аккредитация ИТ, удаленная работа)",
        "url": "https://hh.ru/vacancy/71105536?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Анализировать метрики клиентов до\\после запуска (spark, clickhouse, python). Обсуждать результаты экспериментов с лучшими ecommerce специалистами. Выпускать кейсы совместно с...\nВысшее техническое образование или курсы по программированию и/или аналитике данных. Базовые знания Python, SQL или Scala. Будет плюсом опыт...",
        "company": "DIGINETICA"
    },
    {
        "title": "Python Backend Developer",
        "url": "https://hh.ru/vacancy/71290732?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка API c использование DRF. Разработка пользовательских интерфейсов с использованием Django. Кастомизации админ панель Django. Интеграция с внешними API (SMS...\nОпыт разработки от 3 лет. Опыт использования Python от 1 года. Опыт применения в коммерческих проектах Django REST.",
        "company": "ЭкспрессДеньги"
    },
    {
        "title": "Data Scientist (middle/middle+)",
        "url": "https://hh.ru/vacancy/70163749?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Моделирование и обработка данных на Python для извлечения бизнес-ценности из данных. Глубокое обсуждение задач и методов их решения совместно...\nОпыт использования ml библиотек на Python (бустинг, нейронные сети и др.) и понимание особенностей реализации различных аспектов алгоритмов в коде. ",
        "company": "ОООРАБЛЗ"
    },
    {
        "title": "Python back-end разработчик",
        "url": "https://hh.ru/vacancy/71329449?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка общих модулей и их внедрение в существующие парсеры. Разработка парсеров сайтов и приложений. Разработка API. Участие в формировании архитектуры...\nОпыт разработки на Python 3.6 или выше, написание кода, работающего на разных версиях Python и ОС; контроль и работа...",
        "company": "ОООПромоДата"
    },
    {
        "title": "Python-разработчик",
        "url": "https://hh.ru/vacancy/69312008?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать микросервисное решение на Python. Применять лучшие практики при реализации продукта. Плотное взаимодействие с другими участниками команды (аналитики, фронтенд разработчики.. ), \nОпыт коммерческой разработки на Python от 2х лет. Опыт работы с django, flask, fastApi, SQLAlchemy, Alembic, aiokafka, aiobotocore, asyncio. ",
        "company": "Сбер. IT"
    },
    {
        "title": "Python Developer + ML",
        "url": "https://hh.ru/vacancy/70862358?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка и доработка существующей обвязки под исполнение нейронных сетей различных топологий на Python. Запуск и управление инференсом моделей под Intel...\nИщем Python разработчика, имеющего хороший опыт коммерческой разработки. Необходима хорошая математическая подготовка. Ожидаем навыки работы с PostgreSQL, включая опыт работы...",
        "company": "ОООТ.Т.Консалтинг"
    },
    {
        "title": "С++ / Python-разработчик Универсального Поиска",
        "url": "https://hh.ru/vacancy/71439966?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Писать на C++ код для компонентов Поиска. Писать на Python код для процессов подготовки данных для Поиска. Разрабатывать факторы и...\nИмеете опыт коммерческой разработки на С++ или Python. Знаете классические алгоритмы и структуры данных. Знакомы с базами данных и языком...",
        "company": "Яндекс"
    },
    {
        "title": "DevOps инженер",
        "url": "https://hh.ru/vacancy/70765836?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Настраивать и поддерживать различные процессы разработки и системного администрирования (билды, выкладка и тд). Заведовать настройкой метрик и уведомлений в системе...\n...из vim и ловко работаете как минимум с Linux, Bash, Ansible, Docker, Prometheus. Будет существенным плюсом знание Python или Golang.",
        "company": "ОООИнтеллектуальные социальные системы"
    },
    {
        "title": "Python Developer (Middle/Senior)",
        "url": "https://hh.ru/vacancy/70870676?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "4+ years experience with Python. Experience with Django/Flask. Experience with Linux, Git. Git, Linux. Proficiency in English B...",
        "company": "OGD Solutions"
    },
    {
        "title": "Python Backend Developer",
        "url": "https://hh.ru/vacancy/71323907?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проектировать и разработывать backend сервисы и приложения. Разрабатывать сервисы, фичи, приложения. Реализовывать API. Реализовывать взаимодействия с другими системами. \nИмеете опыт бэкенд-разработки на Python. Знаете ООП и имеете представление о SOLID. Умеете писать понятный и простой код, разбираться...",
        "company": "Sitronics KT"
    },
    {
        "title": "Data Analyst (Remote)",
        "url": "https://hh.ru/vacancy/70449443?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участвовать в разработке, внедрении и поддержке data-driven процессов в продуктовых командах. Разрабатывать и поддерживать дашборды и системы метрик. \nГлубокое понимание продуктовых и бизнес-метрик. Знание Python/R и соответствующих фреймворков для работы с данными (предпочтительно Python, бекенд на...",
        "company": "Novakid Inc"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/70692966?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в проекте по автоматизации тестирования сложной распределённой системы. Модификация, усовершенствование, поддержка инструментов автоматизированного тестирования. Автоматизация процессов непрерывной интеграции и...\nВысшее техническое образование (или курсы переподготовки). Опыт разработки приложений на Golang или Python. Опыт написания модульных, интеграционных и системных автотестов. ",
        "company": "EFIX GROUP"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/71259584?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Улучшать архитектуру существующего решения. Разрабатывать микросервисы с использованием Flask/Django/FastAPI. Взаимодействовать с ml-командой, занимающейся компьютерным зрением, для интеграции...\nОтличное знание Python. Опыт работы с фреймворками Flask/Django. Опыт работы с PostgreSQL. Понимание принципов работы архитектуры приложений и микросервисов. ",
        "company": "SMART FARM"
    },
    {
        "title": "Python developer",
        "url": "https://hh.ru/vacancy/71276021?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Создает и развивает сервис внутри компании. Цифровизирует обслуживание и делает его быстрее. Автоматизирует все внутренние бизнес-процессы для достижения максимальной...\nЗнание основ языка программирования Python и основных библиотек анализа данных (pandas, numpy, statsmodel). Продвинутые знания SQL, PL/SQL. ",
        "company": "ДОБРОЦЕН"
    },
    {
        "title": "Python-разработчик/Data-инженер",
        "url": "https://hh.ru/vacancy/71290769?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "СберКорус сегодня — разработчик и провайдер облачных сервисов для автоматизации процессов управления цепочками поставок и взаиморасчетов, поставщик 1 для Сбера по...\nПонимание основных подходов и концепций по проектированию БД. Умение оптимизировать SQL запросы. Умение читать и рефакторить чужой код. ",
        "company": "СБЕРКОРУС"
    },
    {
        "title": "Программист Python/С++",
        "url": "https://hh.ru/vacancy/70852079?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "...Linux (С/С++),Python. - Разработка драйверов устройств для ОС GNU/Linux. - Поддержка ранее разработанного ПО (С/С++,Python). - \nОпыт работы не менее 2-х лет. - Знание языков программирования C/С++;Python. - Опыт использования встраиваемых операционных систем, встраиваемых файловых...",
        "company": "Team4You"
    },
    {
        "title": "Аналитик Python",
        "url": "https://hh.ru/vacancy/71259380?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Сбор, обработка, изучение и интерпретация данных. Проведение экспертизы по ценам, статистические исследования. Проверка и анализ гипотез по чувствительности к цене...\nНавыки финансового, статистического анализа, расчета экономической эффективности проектов. Знание Python (Pandas): -умение писать функции. -знание структуры данных, типов переменных. -",
        "company": "Сбер. IT"
    },
    {
        "title": "Разработчик Backend (Python, Django)",
        "url": "https://hh.ru/vacancy/70973528?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "PAYMO – международный пред-процессинговый центр с гибкими платежными решениями. Реализует прием платежей на цифровых площадках и разрабатывает приложения для различных...\nУверенный опыт разработки на Python 3 (не менее трех лет). Опыт уверенной разработки сервисов с использованием PostgreSQL в качестве базы...",
        "company": "PAYMO"
    },
    {
        "title": "Data Scientist",
        "url": "https://hh.ru/vacancy/71375101?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Выявлять угрозы, направленные против интернет-пользователей (мошенничество, фрод, вредоносный код, нежелательный контент) и сервисов Яндекса (накрутки, попытки манипулирования и др.). \nАнализировали данные. Знаете алгоритмы и структуры данных. Имеете опыт программирования. Имеете знания и опыт в области информационной безопасности.",
        "company": "Яндекс"
    },
    {
        "title": "Machine Learning Engineer",
        "url": "https://hh.ru/vacancy/71059469?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Извлечение и обработка массивов данных на основе SQL-запросов. Разработка алгоритмов для предобработки разнородных данных – подготовка, очистка, обогащение, feature engineering. \nХорошее знание SQL, опыт работы с БД, опыт написания сложных запросов. Уверенное знание Python (numpy, matplotlib, pandas, scikit-learn). ",
        "company": "AISA"
    },
    {
        "title": "Automation QA engineer (Python)",
        "url": "https://hh.ru/vacancy/71427453?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в проекте по автоматизации тестирования сложной распределённой системы. Модификация, усовершенствование, поддержка инструментов автоматизированного тестирования. Автоматизация процессов непрерывной интеграции и...\nВысшее техническое образование (или курсы переподготовки). Опыт разработки приложений на Golang или Python. Опыт написания модульных, интеграционных и системных автотестов. ",
        "company": "EFIX GROUP"
    },
    {
        "title": "Data engineer",
        "url": "https://hh.ru/vacancy/71386013?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Направление: разработки витрин данных. Заниматься проектированием и разработкой витрин данных для анализа и моделирования. Заниматься мониторингом и оптимизацией процессов сборки...\nХорошее знание устройства Hadoop,Spark,Hive/Impala. Опыт разработки на Python/Scala/Java. Понимание основных концепций DWH. Понимание базовых команд...",
        "company": "Lion Recruitment"
    },
    {
        "title": "Программист Python",
        "url": "https://hh.ru/vacancy/70820848?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддерживать и оптимизировать текущие проекты, создавать новые. Участвовать в проработке и улучшении архитектуры системы и API. Использовать современные подходы, инструменты...\nЭкспертное владение Python, PostgreSql и MySQL. Навыки создания Rest API. Ответственность за качество своего кода. Внимание к деталям. ",
        "company": "it-aces.com"
    },
    {
        "title": "Developer Python",
        "url": "https://hh.ru/vacancy/67411307?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка Gui - приложения для управления кластеров PostgreSQL.\nОпыт программирования на Python 3+. Глубокое знание и подтвержденный опыт разработки на минимум одном фреймворке для GUI-разработки (PyQt...",
        "company": "АОВНИИРА"
    },
    {
        "title": "Python developer",
        "url": "https://hh.ru/vacancy/71376351?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать и поддерживать приложения/утилиты на языке Python, с использованием современных фреймворков, включая как backend, так и frontend. \nУ вас есть опыт работы с такими фреймворками, как Django, Flask, React, Bootstrap 4/5. Есть навыки и опыт работы...",
        "company": "Иннотех, Группа компаний"
    },
    {
        "title": "Junior Product manager/ Аналитик ( аккредитация ИТ, удаленная работа)",
        "url": "https://hh.ru/vacancy/70021063?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Анализировать метрики клиентов до\\после запуска (spark, clickhouse, python). Обсуждать результаты экспериментов с лучшими ecommerce специалистами. Выпускать кейсы совместно с...\nВысшее техническое образование или курсы по программированию и/или аналитике данных. Базовые знания Python, SQL или Scala. Будет плюсом опыт...",
        "company": "DIGINETICA"
    },
    {
        "title": "Senior QA automation engineer Python (команда Pangolin) СберТех",
        "url": "https://hh.ru/vacancy/71292139?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Создание автоматизированных тестов с использованием Python (pytest). Анализ требований, поступивших от клиента и функциональных спецификаций подготовленных разработчиком. Генерация и документирование...\nЗнаете и понимаете теорию тестирования. Писали автоматизированные тесты с использованием Python. Знаете базовые команды Linux. Имеете опыт работы с PostgreSQL. ",
        "company": "SberTech"
    },
    {
        "title": "Python Senior / TechLead",
        "url": "https://hh.ru/vacancy/67906505?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Работать с бизнесом - подвергать требования критическому анализу, выбирать оптимальную реализацию. Проводить декомпозицию задач совместно с командой. Следить за тех. \n...разработки от 1 года. Коммуникабельность и ответственность. Ссылка на репозиторий с собственным проектом. Опыт разработки коммерческих программных продуктов на Python.",
        "company": "Spice Agency"
    },
    {
        "title": "Тестировщик (python)",
        "url": "https://hh.ru/vacancy/71271104?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в разработке продуктов команды. Покрытие кода тестами, согласно банковским правилам и процессам. Разработка автоматических проверок для сервиса. \nЗнание python не ниже junior/middle. Знание pytest, unittest, pyinstaller. Обучаемость, пунктуальность, желание работать и развиваться.",
        "company": "Сбер для экспертов"
    },
    {
        "title": "Python Developer в команду Антифрода",
        "url": "https://hh.ru/vacancy/71290912?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать внутренние решения для обеспечения защиты от фрода. Осуществлять интеграцию с внутренними системами продукта, а также написание новых компонентов для...\nУверенное знание Python3 с опытом коммерческой разработки более трёх лет. Работа с SQL и NoSQL базами данных и брокерами...",
        "company": "СберМаркет"
    },
    {
        "title": "Python/Django Developer (Middle/Strong Middle)",
        "url": "https://hh.ru/vacancy/71421743?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Development and maintenance of our systems integrations with 3rd parties, integrating with new platforms. Analysis of API documentation, implementing...\nKnowledge of Linux administration. To apply: 1. Do you have Python 3.6 / Django 1.11 and MySQL 3+...",
        "company": "UAB Loberta"
    },
    {
        "title": "Python developer (middle)",
        "url": "https://hh.ru/vacancy/70403202?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать фреймворк для тестирования железа: фиксить баги, внедрять фичи. Разрабатывать “драйверы” для работы с промышленным оборудованием. Разрабатывать графические утилиты для...\nВысшее образование (IT). Опыт коммерческой разработки на python. Опыт работы с Python3.9+. Опыт использования pytest. ",
        "company": "Бюро 1440"
    },
    {
        "title": "Computer-Vision Инженер (Python)",
        "url": "https://hh.ru/vacancy/66913380?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Имплементация и обучение моделей Perception блока ADAS (в последующем беспилотного автомобиля), таких как детекция, сегментация, треккинг и т.д. \nЗнание Python. Знание CV классического (Opencv). Знание ML/DL (Pytorch). Хорошая математическая подготовка. Работа с git, bash, docker. ",
        "company": "АОКама"
    },
    {
        "title": "Backend-разработчик на Python",
        "url": "https://hh.ru/vacancy/71403814?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Выполнять функциональные доработки для крупных заказчиков, у которых внедрена система. Развивать SDK на Python для создания адаптеров, которые разрабатывают вендоры...\nЗнание языка Python 3 и сопутствующей экосистемы (мы используем Flask). Опыт работы с очередями или брокерами сообщений и СУБД (используем...",
        "company": "KALABI"
    },
    {
        "title": "Тестировщик ПО (Python или Golang)",
        "url": "https://hh.ru/vacancy/71428123?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в проекте по автоматизации тестирования сложной распределённой системы. Модификация, усовершенствование, поддержка инструментов автоматизированного тестирования. Автоматизация процессов непрерывной интеграции и...\nВысшее техническое образование (или курсы переподготовки). Опыт разработки приложений на Golang или Python. Опыт написания модульных, интеграционных и системных автотестов. ",
        "company": "EFIX GROUP"
    },
    {
        "title": "Программист Python",
        "url": "https://hh.ru/vacancy/69954656?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Реализация etl-процессов. Data cleansing. Работа с нереляционными хранилищами Clickhouse. Работа с графовыми хранилищами.\nХорошие знания Python 3 (семантика присваивания, особенности многопоточности и GIL, анонимные функции, ООП, common practices). Общее представление о работе с...",
        "company": "ОООГарда Технологии"
    },
    {
        "title": "Data Scientist (Computer Vision) / Junior",
        "url": "https://hh.ru/vacancy/70006425?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Работать над алгоритмами детекции, трекинга. Исследовать и анализировать существующие подходы в видеоаналитике. Применять методы классического компьютерного зрения. Обучать, тестировать, адаптировать...\nИмеешь высшее образование в сфере IT. Знаешь наш технологический стек (описан выше). Знаешь английский язык. Имеешь большое желание развиваться в...",
        "company": "DNS Головной офис"
    },
    {
        "title": "Middle Python developer (Сочи)",
        "url": "https://hh.ru/vacancy/70824756?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка back-end части (в основном). Доработки front-end части.\nКоммерческий опыт разработки на Python. Уверенное знание одного из web фреймворков (Django, Flask, FastAPI). Опыт работы с бд через ORM...",
        "company": "ОООКолл-Тулз"
    },
    {
        "title": "SRE/Системный администратор Linux",
        "url": "https://hh.ru/vacancy/70857671?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Администрирование инфраструктуры. Траблшутинг. Управление мониторингами качества работы проектов. Реакция на инциденты и последующий анализ. Работа с Kubernetes.\nЗнание ЯП на уровне скриптов. Ngnix. Linux от 3-х лет. Ansible.",
        "company": "HR Prime"
    },
    {
        "title": "Data scientist / Machine learning engineer (команда рекомендаций и машинного обучения, ВКонтакте)",
        "url": "https://hh.ru/vacancy/71352448?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Использовать огромное количество разных данных. Создавать гипотезы по улучшению сервиса, внедрять их и проверять работоспособность в офлайне, а в случае...\nРаботали с рекомендательными системами или интересуетесь ими. Уверенно владеете Python, Java или Scala, а также любым из диалектов SQL. ",
        "company": "VK, Одноклассники"
    },
    {
        "title": "Технический лидер / Python Developer",
        "url": "https://hh.ru/vacancy/71429021?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Лидирование команды (3 разработчика). Разработка фреймворков. Реализация сложных задач. Управление технологическим стеком. Разработка структуры сервисов. Помощь в решении тех. Задач. \nОпыт разработки от 3 лет. Опыт использования Python от 3 года. Опыт применения в коммерческих проектах Django REST.",
        "company": "ЭкспрессДеньги"
    },
    {
        "title": "Senior Python Developer",
        "url": "https://hh.ru/vacancy/71428568?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка приложений и сервисов на языке Python. Поддержка, интеграция, оптимизация приложений и сервисов. Подготовка необходимой документации. Руководство группой разработчиков.\nЗнание и практический опыт внедрения методик организации процесса разработки в команде. Опыт в Python от 3х лет. ",
        "company": "ФГБУ ЦСП ФМБА России"
    },
    {
        "title": "Ведущий программист Python",
        "url": "https://hh.ru/vacancy/70669629?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать распределенные высоконагруженные информационные системы. Разрабатывать объекты бизнес-логики и эффективные методы для доступа к данным. Оптимизировать скорость обращения к...\nВладение Python на высоком уровне. Знание ООП. Знание паттернов проектирования и умение их применять. Опыт работы с базами данных. ",
        "company": "Тензор"
    },
    {
        "title": "Backend-разработчик Django",
        "url": "https://hh.ru/vacancy/71300594?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие во всем жизненном цикле приложения, уделяя особое внимание кодированию и отладке. Устранение неполадок и отладка приложений. Выполнение тестов пользовательского...\nГлубокое понимание всего процесса веб-разработки (дизайн, разработка и развертывание). Практический опыт работы с Python/Django на уровне эксперта. ",
        "company": "ТООSilkwayTransit"
    },
    {
        "title": "ГИС программист (разработка/аналитика/системное администрирование)",
        "url": "https://hh.ru/vacancy/70857471?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка тематических геоинформационных систем, создание веб-сервисов. Создание, наполнение и актуализация баз данных (пространственные, многопользовательские). Создание скриптов и инструментов геообработки. \nНаличие практического опыта автоматизации геоинформационных задач (Python (библиотеки arcpy, numpy, pandas), Arcade, ModelBuilder). Креативное и компетентное геоинформационное мышление. ",
        "company": "ОООЭнимаКонсалт"
    },
    {
        "title": "ML Инженер (middle)",
        "url": "https://hh.ru/vacancy/71088981?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать новые и улучшать качество существующих моделей детектирования, распознавания и локализации объектов на медицинских изображениях (CT, MMG, DX). \nОтличное знание методов и принципов машинного обучения, принципов проведения исследований и дизайна экспериментов в машинном обучении. Стек: python, один из...",
        "company": "Intellogic"
    },
    {
        "title": "Python Developer (Mobile)",
        "url": "https://hh.ru/vacancy/71376354?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать бэкенд для мобильных приложений на языке Python. Писать автоматические тесты в проекте (Pytest). Участвовать в командных процессах по CodeReview. \nОпыт коммерческой разработки на Python3 (у нас 3.9) в связке с Django от 1 года. Уверенное знание SQL...",
        "company": "Emerging Travel Group (Ostrovok.ru, B2B.Ostrovok, RateHawk, ZenHotels)"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/45607335?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Писать чистый, тестируемый код. Разрабатывать новые сервисы и активно участвовать в проработке решений. Развивать существующие решения. Работать с технологиями: Flask...\nИмеете коммерческий опыт разработки на Python от 1 года. Знакомы или готовы познакомиться с микросервисной архитектурой. Знаете принципы проектирования программного...",
        "company": "ОООРостелеком Информационные Технологии"
    },
    {
        "title": "Platform Reliability Engineer",
        "url": "https://hh.ru/vacancy/71431503?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "During the internship (3-4 months), you will have the opportunity to perform real business tasks and gain new knowledge...\nExperience with command line tools and scripting languages (bash/python). A rigorous, detail-oriented approach to operations. English for reading...",
        "company": "Advantage Solutions"
    },
    {
        "title": "Python-разработчик в Цифровые поверхности Салют (направление B2B2C)",
        "url": "https://hh.ru/vacancy/69958088?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка API. Разработка сценариев для голосовых навыков. Интеграция сторонних сервисов. Участие в полном цикле разработки – проектирование, программирование, тестирование, поддержка. \nОпыт промышленной разработки на Python от 2-х лет. Отличное знание SQL (на уровне составления достаточно сложных запросов и их...",
        "company": "Сбер. IT"
    },
    {
        "title": "Python automation developer",
        "url": "https://hh.ru/vacancy/71241727?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проектирование, настройка и обслуживание веб серверов. Разработка автоматизированных процессов. Запуск и анализ результатов автоматизированных процессов. Настройка и поддержка окружения для...\nЗнания языка программирования Python. ОБЯЗАТЕЛЕН опыт работы с библиотекой Selenium. ОБЯЗАТЕЛЕН опыт работы c Captcha и Cloudflare. HTTP-запросы с...",
        "company": "ОООТУТ-трэвел"
    },
    {
        "title": "Python Django разработчик, удаленно",
        "url": "https://hh.ru/vacancy/70588586?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Успешный кандидат будет участвовать в команде разработки нового функционала и проектах кастомизации функционала для клиентов. Полная занятость, полный день. \n3+ лет Python/Django на бэкенде с подтвержденным \"боевым\" опытом. Желательно опыт frontend: React. Опыт управления командой будет большим...",
        "company": "эдмин"
    },
    {
        "title": "Python developer",
        "url": "https://hh.ru/vacancy/70991876?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "оптимизация SQL-запросов. - подготовка unit-тестов. - создание нагрузочных тестов на Python (Locust). - интеграция с другими сервисами и микросервисами. - \n3-5 лет на Python проектах / Python 3. - понимание механики языка Python и сопутствующих инструментов (pytest, mypy, poetry, flake8). - ",
        "company": "JuicyScore"
    },
    {
        "title": "Python разработчик (backend)",
        "url": "https://hh.ru/vacancy/71195931?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "...и отвечать за интеграции между различными моделями прогнозирования и автоматизированными системами банка. Участвовать в разработке и опромышливании ML-моделей (Python).\nПрофильное высшее техническое или математическое образование. Не менее 1 года работы c python. Понимать и уметь использовать методологию Devops. ",
        "company": "Сбер для экспертов"
    },
    {
        "title": "Middle python developer",
        "url": "https://hh.ru/vacancy/71269595?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Работа в команде над разработкой электронной платформы, площадки университетов и автоматизацией процессов поступления абитуриентов в вузы. Обязанности: Разработка серверной части...\nНавыки работы с реляционными базами данных. Хорошее знание команд Linux, навыки работы с терминалом. Знание архитектуры веб приложения и принципов...",
        "company": "ТООЦентр образовательных услуг Білім"
    },
    {
        "title": "Python Middle Backend Developer",
        "url": "https://hh.ru/vacancy/69826026?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в проектировании архитектуры системы. Разработка микросервисов и участие в создании высоконагруженных систем (10.000 пользователей в сутки). \nКоммерческая разработка на Python от 2-х лет. Опыт написания микросервисов, понимание микросервисной архитектуры. Опыт работы с MySQL/Postgres. ",
        "company": "ОООДэстэн Партнерс"
    },
    {
        "title": "Python developer (Senior)",
        "url": "https://hh.ru/vacancy/71257326?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Выстраиваем красивую и качественную платформу для поставки, мониторинга и анализа данных. Выстраиваем сами потоки данных.\nВсё в прод-режиме: надо документировать, пихать в шедулер, делать тесты и мониторинг. Девопсы есть и они хорошие, так что...",
        "company": "ОООДиплей"
    },
    {
        "title": "Middle Data engineer",
        "url": "https://hh.ru/vacancy/71223313?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Построение аналитической системы. Построение единого хранилища данных и работы с имеющимся функционалом.\nУчаствовать в разработке отчетной системы. Разрабатывать и поддерживать ETL-процессы (Python, SQL, Airflow). Создавать агрегированные таблицы из сырых данных со...",
        "company": "ТООAVIATA.KZ"
    },
    {
        "title": "Python Developer",
        "url": "https://hh.ru/vacancy/71317809?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать микросервисное решение на Python. Применять лучшие практики при реализации продукта. Плотное взаимодействие с другими участниками команды (аналитики, фронетнд разработчики.. ), \nОпыт коммерческой разработки на Python от 2х лет. Опыт работы с django, flask, fastApi, SQLAlchemy, Alembic, aiokafka, aiobotocore, asyncio. ",
        "company": "Сбер. IT"
    },
    {
        "title": "Backend разработчик (Python)",
        "url": "https://hh.ru/vacancy/67764198?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в разработке бэкенда облачного сервиса.\nУверенные знания python3.6 (желателен опыт от 2 лет). Опыт работы с Flask/Django. Опыт работы с Celery/RabbitMQ. ",
        "company": "АОИОТ"
    },
    {
        "title": "Data Analyst (Marketing)",
        "url": "https://hh.ru/vacancy/69404269?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Собирать и валидировать отчеты, находить инсайты в данных. Настраивать дашборды для мониторинга основных маркетинговых показателей. Участвовать в развитии LTV модели.\nХорошее знание SQL и Python. Любовь к аналитике больших объемов данных. Опыт работы с Tableau будет плюсом. Опыт работы в...",
        "company": "Dankolab"
    },
    {
        "title": "Программист С++ (R&D в проекте метавселенной)",
        "url": "https://hh.ru/vacancy/71388347?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Решаемая задача: анализ потока фотографических данных, выбор качественных кадров, улучшение кадров (нейронные сети, работа с разными режимами съемок) для устранение...\nФинальные алгоритмы должны быть реализованы на C++. Отличное знание C++, Python. Отличная математическая и алгоритмическая база. Желательно опыт работы с...",
        "company": "ООО3Д Платформа"
    },
    {
        "title": "DevSecOps Engineer / Security Engineer",
        "url": "https://hh.ru/vacancy/70483976?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Внедрением и автоматизацией механизмов безопасности в dev/test/prod среды. Созданием и развитием security и observability сервисов в инфраструктуре. \nУмение автоматизировать свою деятельность с использованием любого из следующих ЯП (Bash, Python, Golang). Опыт Hardening и внедрения механизмов безопасности в...",
        "company": "Vital Partners"
    },
    {
        "title": "Backend разработчик python",
        "url": "https://hh.ru/vacancy/69286250?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в проектировании и реализации архитектурных решений. Реализация модулей взаимодействия между сервисами, приложениями и серверами. Код- ревью разработки внешней команды.\nОпыт работы в виде разработчика микросервисных решений на базеbackend технологий языка Python (Flask, FastAPI). Знание AMQP брокеров сообщений RabbitMQ, Redis...",
        "company": "ПАО «Газпром нефть»"
    },
    {
        "title": "Разработчик Python (ALD)",
        "url": "https://hh.ru/vacancy/70052938?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Реализация back-end для продукта. Оценка входящих задач и соблюдение сроков выполнения. Реализация нового функционала / доработка существующего функционала в компонентах...\nОтличные знания языка Python версий 2.x и 3.x. Знакомство с фреймворками Flask / Django / Sanic. Опыт работы с ОС...",
        "company": "Группа компаний Астра"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/68429577?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка компонентов управления сетевой подсистемой, контейнерами, виртуализацией. Развитие программной архитектуры существующего продукта, принятие решений в выборе технологий, расчет производительности и...\nОпыт коммерческой разработки от 3 лет. Знание Python > 3.5, ООП и паттерны проектирования, понимает принципы многопоточности и знает, что...",
        "company": "Ай-Теко (I-Teco)"
    },
    {
        "title": "Python разработчик (удаленная работа)",
        "url": "https://hh.ru/vacancy/71188469?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие во внутреннем R&D. Разработка внутренней системы управления компетенциями сотрудников (Python,Django, Angular). Разработка инструмента сбора и расчета метрик...\nВысшее образование. Опыт работы в энтерпрайзе не менее года. Быть стрессоустойчивым и коммуникабельным. Понимание процессов цикла разработки ПО. ",
        "company": "«РОСБАНК»"
    },
    {
        "title": "Ведущий разработчик (Python)",
        "url": "https://hh.ru/vacancy/71384211?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Работать в команде, поддерживать, разрабатывать и интегрировать сервисы компании в единую экосистему. Заниматься разработкой серверной части для мобильных клиентов. \nУверенное знание языка и библиотек Python. Знание фреймворка Django или Flask/Pyramid/Tornado. Базовые знания HTML, CSS, JavaScript – для верстки...",
        "company": "Группа компаний ФЛЭШ"
    },
    {
        "title": "Backend разработчик",
        "url": "https://hh.ru/vacancy/70581295?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Чем займемся: — Разработкой Django приложений. — Оценкой сложности разработки, планированием и ведением задач в YouTrack + Gitlab. — Участие в принятии технических...\nОпыт 2+ года опыта backend-end разработки на Python. Будет плюсом: — Знание новых тенденций, понимание, как построить проект с...",
        "company": "ОООИнновационная Экологическая Платформа"
    },
    {
        "title": "Программист-разработчик Middle\\Senior на Python",
        "url": "https://hh.ru/vacancy/71213824?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка API. - Разработка архитектурных решений действующего проекта. - Интеграции с внешними сервисами. - Работа с базами данных PostgreSQL. - Работа с брокерами сообщений.\nКоммерческий опыт разработки на Python от 3 лет. - Опыт написания микросервисов, понимание микросервисной архитектуры. - Docker/ docker-compose. - Понимание разницы между...",
        "company": "ОООНЬЮЭРАМЕДИА"
    },
    {
        "title": "Python разработчик",
        "url": "https://hh.ru/vacancy/46188764?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка новых/доработка существующих/сопровождение сервисов компании (Python,T-SQL). - Автоматизация и совершенствование внутренних бизнес-процессов с помощью Python. - \nЗнание принципов ООП, умение применять их на практике. - Уверенное владение языком программирования Python. - Опыт работы с реляционными БД. - ",
        "company": "ООООмкирмет-плюс"
    },
    {
        "title": "Middle Python developer",
        "url": "https://hh.ru/vacancy/70030892?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "...Python: от проектирования новой архитектуры до рефакторинга существующего кода, оптимизация. Поиск узких мест, поддержка существующих продуктов компании на языке Python. \nPython3 - уверенное знание языка и стандартной библиотеки. PostgreSQL - написание сложных запросов. Технологии: wsgi, redis, RabbitMQ. Работа в команде: git. ",
        "company": "ОООКеду Лабс"
    },
    {
        "title": "Python Developer",
        "url": "https://hh.ru/vacancy/71210358?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Топовое железо и доп. комплектующие по запросу.\nПрофильный опыт back-end разработки на Python (Django/Flask/FastApi) от 3-х лет. Опыт коммерческой разработки Python от 2...",
        "company": "INSITECH Development"
    },
    {
        "title": "Специалист по автоматизации тестирования (python), Логистика / Автосортеры",
        "url": "https://hh.ru/vacancy/71436091?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать и поддерживать автоматизированные тесты и end-to-end тесты. Создавать тест-план, сценарии и чек-листы, опираясь на бизнес...\nОпыт разработки на Python и знание фреймворков для тестирования (PyTest или другие). Знания и опыт работы с SQL. ",
        "company": "Ozon Информационные технологии"
    },
    {
        "title": "Аналитик / IT-Аналитик Wildberries",
        "url": "https://hh.ru/vacancy/70568071?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Оптимизация отчетности. Работа с карточками товаров (поиск \"проблемных\" мест, формирование гипотез вместе с Аналитиком, редактирование действующих карточек, отслеживание изменений). \nЗнание python. Знание Microsoft Office (Word, PowerPoint, Excel - простые и сложные функции). Опыт работы с API. Опыт работы с дашбордами. ",
        "company": "ИПСуворов Павел Алексеевич"
    },
    {
        "title": "Team Lead Python (relocation EU)",
        "url": "https://hh.ru/vacancy/69431361?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Создавать высокоэффективную команду, заботясь о мотивации и росте. Разрабатывать и внедрять нашу новую архитектуру платформы в сотрудничестве с архитекторами и...\nБольшой опыт разработки программного обеспечения на стороне сервера с использованием Python и асинхронных фреймворков. Опыт проектирования и архитектуры микросервисов. ",
        "company": "Дартс рекрутинг сервисез"
    },
    {
        "title": "Junior Backend Test Engineer",
        "url": "https://hh.ru/vacancy/70820888?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Автоматизация тестирования. Разработка автоматических тестов, в том числе возможно участие в написании стресс-тестов. Анализ биржевых спецификаций и данных, анализ...\nОпыт программирования на Python. Знание сетей и сетевых протоколов. Опыт работы c TCP/IP стеком в Python (gevent/socket/asyncio...",
        "company": "CQG"
    },
    {
        "title": "Python разработчик",
        "url": "https://hh.ru/vacancy/71320150?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Наши продукты используются всеми командами Банка, в рамках обеспечения непрерывности конвейера производства. На данный момент мы подошли к переработке Legacy...\nВысшее (Математика). Функциональный опыт: - Опыт разработки ПО на Python v.3+ от 2-х лет. - Опыт работы с командной...",
        "company": "Сбер для экспертов"
    },
    {
        "title": "Разработчик С++/Python",
        "url": "https://hh.ru/vacancy/71224061?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка программных компонентов для описания и реализации прикладных сценариев и пользовательского интерфейса на Python API. Написание библиотек расширений Python/C...\nВысшее техническое образование. Знание С++ (STL, ООП). Начальные знания Python.",
        "company": "ЗАОТоп Системы"
    },
    {
        "title": "Python developer",
        "url": "https://hh.ru/vacancy/71376351?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать и поддерживать приложения/утилиты на языке Python, с использованием современных фреймворков, включая как backend, так и frontend. \nУ вас есть опыт работы с такими фреймворками, как Django, Flask, React, Bootstrap 4/5. Есть навыки и опыт работы...",
        "company": "Иннотех, Группа компаний"
    },
    {
        "title": "Python developer (Senior)",
        "url": "https://hh.ru/vacancy/71257325?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Выстраиваем красивую и качественную платформу для поставки, мониторинга и анализа данных. Выстраиваем сами потоки данных.\nВсё в прод-режиме: надо документировать, пихать в шедулер, делать тесты и мониторинг. Девопсы есть и они хорошие, так что...",
        "company": "ОООДиплей"
    },
    {
        "title": "Python Developer",
        "url": "https://hh.ru/vacancy/71152987?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Ищем Full Stack разработчика на проект ERP/CRM системы для компании ~ 100 человек. Нам необходим веб-клиент для оптимизации бизнес...\nКакие знания и навыки для нас важны: Понимание принципов разработки CRM-cистем. Знания Python/DRF и JavaScript. Опыт с Bootstrap. ",
        "company": "ОООПротектор"
    },
    {
        "title": "Python Developer (CRM)",
        "url": "https://hh.ru/vacancy/68058800?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка бэкэнда продукта CRM на языке Python. Написание автоматических тестов в проекте (Pytest). Участие в командных процессах по CodeReview. \nОпыт коммерческой разработки на Python3 (у нас 3.9) в связке с Django от 2 лет. Уверенное знание SQL...",
        "company": "Emerging Travel Group (Ostrovok.ru, B2B.Ostrovok, RateHawk, ZenHotels)"
    },
    {
        "title": "Data scientist/Antifraud analyst",
        "url": "https://hh.ru/vacancy/68898421?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Создание дашбордов для внешних и внутренних заказчиков. Прототипирование отчетов для внешних заказчиков (антифрод, постклик/поствью, отчет по видимости рекламы, и...\nLinux, Python, bash, etc.. Понимание принципов работы Интернета на уровне http протокола.",
        "company": "Internest"
    },
    {
        "title": "Разработчик Linux",
        "url": "https://hh.ru/vacancy/71401475?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Работа с ОС Linux (Ubuntu и др): ядро и модули ядра, компиляция, кросс-компиляция, системы сборки и тд. \nПонимание архитектуры Linux. Опыт программирования прикладных программ. Опыт программирования на С/C++/python. Понимание принципов функционирования сетей. Опыт программирования сетевых...",
        "company": "3D Rep"
    },
    {
        "title": "Linux Backend Developer",
        "url": "https://hh.ru/vacancy/67593318?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Написание и модификация существующего кода на C/C++/Python/Bash по интеграции Linux-сервисами. Сборка, и выпуск продукта в виде...\n2+ года разработки системного ПО под Linux на C/C++ (STL, Boost) или Python. Базовые навыки администрирования и средств...",
        "company": "Plesk"
    },
    {
        "title": "Программист",
        "url": "https://hh.ru/vacancy/71344759?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проектирование и реализация пользовательского интерфейса. Программирование Linux shell / bash / python. Работа с базами данных SQLite, MySQL. Работа в команде, взаимодействие...\nБазовый опыт работы и администрирования операционных систем Windows/Linux. Опыт программирования приложений. Базовые навыки SQL, запросов, тригеров, теории баз данных. ",
        "company": "БУЗОО ГКПЦ"
    },
    {
        "title": "Преподаватель Python (ООП)",
        "url": "https://hh.ru/vacancy/70219528?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Преподавать можно очно в отделениях в Московской области (Королев, Мытищи, Пушкино) и совмещать с ведением занятий в наших Московских отделениях.\nВладение Pygame, Django, SQLite. Обязательное владение Git. Знакомство с классами в Python. Знакомство с основными конструкциями (ветвление, циклы). ",
        "company": "ЧУ ДО Московская школа программистов"
    },
    {
        "title": "Python Web Developer (Middle)",
        "url": "https://hh.ru/vacancy/53154394?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать и поддерживать web-приложения для внутренних задач.\nИмеет опыт разработки web-приложений с использованием Python (от 2-3 лет). Уверенно владеет Python (фреймворки для web-разработки: Flask...",
        "company": "DNS Головной офис"
    },
    {
        "title": "Senior ML developer",
        "url": "https://hh.ru/vacancy/71420881?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Исследования в области STT / TTS / NLU. Разработка и поддержка движка STT. Разработка и поддержка движка TTS. Развитие кор логики платформы...\nПонимание специфики DNN архитектур для решения задач STT / TTS / NLU. Уверенное знание Python, Pytorch / Tensorflow. Умение доводить DL модели до...",
        "company": "ОООТаргет"
    },
    {
        "title": "Data Analyst",
        "url": "https://hh.ru/vacancy/67887449?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Подготовка различных выборок по запросам бизнеса и для проектных исследовательских целей. Регулярный анализ маркетинговых кампаний, сравнение показателей before/after. \nУверенное знание математической статистики и умение использовать ее в работе. Уверенное знание Python на уровне стандартных библиотек для анализа данных...",
        "company": "INSITECH Development"
    },
    {
        "title": "Middle Data Engineer",
        "url": "https://hh.ru/vacancy/71396382?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Общение с Заказчиком, согласование бизнес-требований, разработка спецификаций. - Подготовка данных. - Работа с данными, создание BI отчетов. - Работа с ad-hoc...\nУверенное знание SQL. - Знание Python. - Знания платформ BI: Visiology, MS Power BI, Qlik Sense. - Опыт работы с любой из следующих...",
        "company": "7RedLines"
    },
    {
        "title": "Ведущий разработчик на Python",
        "url": "https://hh.ru/vacancy/70333858?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Планирование процесса разработки. Участие в полном цикле разработки: от проектирования архитектуры до тестирования. Развертывание и интеграция ПО у заказчиков.\nОпыт коммерческих проектов на Python. Знание Python на уровне не ниже middle. Понимание вэб-стэка. Навыки проектирования микросервисной архитектуры. ",
        "company": "ОООКогнитивные системы"
    },
    {
        "title": "Senior Data Scientist (FinTech)",
        "url": "https://hh.ru/vacancy/70795736?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Исследовать и разработать гибридный алгоритм предикативной модели в финансовом секторе на основе сентимент-анализа.\nМы РЕСТАДВАЙЗЕР – IT компания с опытом более 6 лет и с успешно реализованными проектами на базе машинного обучения, обработки естественного...",
        "company": "ОООРЕСТАДВАЙЗЕР"
    },
    {
        "title": "DevOps-инженер",
        "url": "https://hh.ru/vacancy/71303696?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Одна из лидирующих компаний в области бронирования и продажи авиа и жд билетов в Казахстане. Мониторинг и обслуживание продакшн инфраструктуры. \nЗнание Git и Gitlab CI/CD. Умение писать скрипты на bash и python. Опыт работы в Agile команде. ",
        "company": "ТООAVIATA.KZ"
    },
    {
        "title": "Junior Python разработчик",
        "url": "https://hh.ru/vacancy/71110889?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка кода, направленного на полную или частичную автоматизацию различных бизнес-процессов Компании. Тестирование и установка разработанных в подразделении решений. \nИмеет высшее образование, желательно в области ИТ. Знает один из языков программирования Python/C++/Lua. Знает linux на уровне пользователя. ",
        "company": "ПАОМегаФон, IT"
    },
    {
        "title": "Python-разработчик",
        "url": "https://hh.ru/vacancy/53864420?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка новых приложений и сервисов, а также доработка и сопровождение существующих. Взаимодействие с контрагентами при настройке интеграции с внешними системами.\nУмение читать и понимать чужой код. Опыт разработки на Python (Django, DRF, Aiohttp) от 2-х лет. Знание Postgresql, Redis. ",
        "company": "АОРАСЧЕТНЫЕ РЕШЕНИЯ"
    },
    {
        "title": "Middle Python-разработчик",
        "url": "https://hh.ru/vacancy/71211280?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка и поддержка backend-игр (Android, iOS, web). Разработка и поддержка аналитического сервиса. Разработка и поддержка админки backend-сервисов для...\nОпыт работы с Python — от 2 лет. Релевантный опыт работы с web-проектами. Уверенный пользователь Linux. Игровой опыт (необходим для...",
        "company": "MY.GAMES"
    },
    {
        "title": "Инженер по автоматизации (Python, C++)",
        "url": "https://hh.ru/vacancy/71316422?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Настройка сборки компонентов и библиотек под различные платформы. Устранение потенциальных уязвимостей, выявленных статическим и динамическим анализаторами. Развитие функциональности компонентов. \nЗнание языка C++. Знакомство со скриптовыми языками: Python, Bash, Batch. Знакомство с технологиями сборки: make, CMake. Опыт использования непрерывной интеграции. ",
        "company": "АОИнфоТеКС"
    },
    {
        "title": "Data Analyst",
        "url": "https://hh.ru/vacancy/69216142?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Анализировать и визуализировать структуры данных. Визуализировать средствами Python и MS Excel. Формировать простые отчеты, в соответствии с техническим заданием. \nПрактический опыт работы с SQL: подзапросы, объединения, агрегации, фильтрация. Практический опыт работы с Python: re, pandas, numpy, matplotlib. ",
        "company": "ОООМоризо Диджитал"
    },
    {
        "title": "Senior Python разработчик (Intelligent Document Processing)",
        "url": "https://hh.ru/vacancy/69537461?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проектировать и писать нагруженные сервисы на Python. Создавать масштабируемую и надежную архитектуру и API. Интегрироваться с партнерами и внутренними системами...\nОпыт создания высоконагруженных продуктов. Опыт промышленной разработки на Python от 3-х лет (мы используем Django, Asyncio). Хорошие знания алгоритмов...",
        "company": "Сбер. IT"
    },
    {
        "title": "Back-end разработчик (Python)",
        "url": "https://hh.ru/vacancy/68599942?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать и поддерживать работоспособность модулей интеграции как с конечным оборудованием (работа с сокетами, протоколами обмена), так и со внешними API. – \nОпыт коммерческой разработки на python от 2х лет. – Понимание принципов ООП, асинхронного программирования. – Опыт работы с REST API. – ",
        "company": "ОООЮникорн"
    },
    {
        "title": "Python программист (Наставник онлайн-курса по Python)",
        "url": "https://hh.ru/vacancy/67864415?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Отвечает на вопросы студентов в учебном чате или мессенджере. Делает код-ревью проектов и практик. Проводит дополнительные активности (вебинары, слаконары...\nУ вас есть опыт коммерческой разработки на Python и его фреймворках (в частности, Django). У вас есть базовые знания алгоритмов...",
        "company": "Hexlet"
    },
    {
        "title": "Python-разработчик",
        "url": "https://hh.ru/vacancy/67226964?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проектировать компоненты систем. Организовывать процесс разработки. Писать и ревьюить код. Наставлять менее опытных коллег.\nЗнаешь Python 3 и имеешь опыт промышленной разработки на Python от трех лет. Есть опыт многопоточного и асинхронного программирования. ",
        "company": "Тинькофф"
    },
    {
        "title": "Middle Python developer",
        "url": "https://hh.ru/vacancy/70097265?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Написание чистого, понятного кода. Ведение (исправление багов, модернизация, улучшение) разработанного микросервиса.\nУверенное знание Python3: SQLAlchemy, pymysql, json, (io)pika. Опыт работы с ОС семейства Linux, умение запустить свой код. ",
        "company": "ОООСелфсек"
    },
    {
        "title": "Python Developer",
        "url": "https://hh.ru/vacancy/71152998?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Ищем Full Stack разработчика на проект ERP/CRM системы для компании ~ 100 человек. Нам необходим веб-клиент для оптимизации бизнес...\nКакие знания и навыки для нас важны: Понимание принципов разработки CRM-cистем. Знания Python/DRF и JavaScript. Опыт с Bootstrap. ",
        "company": "ОООПротектор"
    },
    {
        "title": "Senior/Программист Python",
        "url": "https://hh.ru/vacancy/70745387?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка нового продукта. Участие в развитии существующих продуктов. Разработка сервисов и API. Построение архитектуры системы. Анализ требований, проектирование решений, оценка...\nУверенное знание методологии разработки автоматизированных решений. Опыт программирования на Python на уровне Middle или Senior. Опыт использования MySQL / PostgreSQL / Redis...",
        "company": "Digift"
    },
    {
        "title": "Python разработчик",
        "url": "https://hh.ru/vacancy/71212585?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка и поддержка собственных систем: бизнес-логика, backend, REST API, интеграция с внешними и внутренними сервисами. Коммуникация с заказчиком по...\nОпыт работы с языком программирования Python от 2-х лет. Хорошее знание базовых библиотек и основ Python. Опыт работы с...",
        "company": "ОООСовкомбанк Технологии"
    },
    {
        "title": "Программист Python (Голосовой робот)",
        "url": "https://hh.ru/vacancy/71144940?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка сценарной логики голосового робота. Разработка backend для аналитики голосового робота. Обеспечение масштабируемости ПО.\nОпыт промышленной разработки от 1 года на Python. Умение писать тесты, знакомство с подходом TDD. Самостоятельность, умение анализировать и структурировать...",
        "company": "Сбер. IT"
    },
    {
        "title": "Python Developer",
        "url": "https://hh.ru/vacancy/71152989?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Ищем Full Stack разработчика на проект ERP/CRM системы для компании ~ 100 человек. Нам необходим веб-клиент для оптимизации бизнес...\nКакие знания и навыки для нас важны: Понимание принципов разработки CRM-cистем. Знания Python/DRF и JavaScript. Опыт с Bootstrap. ",
        "company": "ОООПротектор"
    },
    {
        "title": "Разработчик Python, C++",
        "url": "https://hh.ru/vacancy/70686493?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Заниматься написанием кода, код ревью, рефакторинг. Взаимодействовать с разработчиками команды МФТИ и смежными КФК. Автоматизировать процессы тестирования. Участвовать в проектировании...\nКакие знания и навыки для нас важны: Middle + : Python, C++. Опыт промышленной разработки (IT интегратор, Банк). Понимание DevOps процессов...",
        "company": "Иннотех, Группа компаний"
    },
    {
        "title": "Инженер по автоматизации (Python, C++)",
        "url": "https://hh.ru/vacancy/71219645?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Настройка сборки компонентов и библиотек под различные платформы. Устранение потенциальных уязвимостей, выявленных статическим и динамическим анализаторами. Развитие функциональности компонентов. \nЗнание языка C++. Знакомство со скриптовыми языками: Python, Bash, Batch. Знакомство с технологиями сборки: make, CMake. Опыт использования непрерывной интеграции. ",
        "company": "АОИнфоТеКС"
    },
    {
        "title": "Python разработчик",
        "url": "https://hh.ru/vacancy/71136819?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Решение задач, связанных с инструментами системы исследования данных и интеграциями. Участие в процессах разработки ИС. Участие в активностях по оценке...\nОпыт разработки на Python. Знание и опыт работы со Spark или pyspark, а так же различными Data science библиотеками. ",
        "company": "Иннотех, Группа компаний"
    },
    {
        "title": "Инженер-программист (Python)",
        "url": "https://hh.ru/vacancy/69100495?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка программ, компонентов программ и программных модулей на языке Python. Разработка алгоритмов управления и взаимодействия в программах. Разработка графических пользовательских...\nВысшее техническое образование. Профессиональное знание Python, опыт программирования на языках высокого уровня (преимущество), PyQt - обязательное условие. Знание современных средств разработки...",
        "company": "Diakont"
    },
    {
        "title": "Преподаватель по Информатике (Python)",
        "url": "https://hh.ru/vacancy/71007700?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проведение очных занятий по языку программирования Python, JavaScript для школьников 8-11 классов по разработанным материалам не менее 2-х...\nВысшее профессиональное педагогическое образование или высшее профессиональное образование в области, соответствующей преподаваемому предмету. Глубокое знание своей предметной области, иметь желание...",
        "company": "СИНЕРГИЯ"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/71151635?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка программного обеспечения.\nОпыт работы с Linux, командной строкой. Уверенные знания Python, PostgreSQL, REST/SOAP, XML/JSON, ООП. Опыт разработки программных продуктов в...",
        "company": "АОИнфоТеКС"
    },
    {
        "title": "Пентестер iOS разработчик",
        "url": "https://hh.ru/vacancy/69423735?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Интеграция этих скриптов в существующий Python-проект, основанный на Django. Разработка и реализация решений по управлению фермой iOS устройств. \nОпыт анализа iOS приложений с помощью Frida. Опыт написания Python/JS/TS скриптов для анализа iOS приложений с помощью Frida...",
        "company": "Swordfish Security"
    },
    {
        "title": "Программист-разработчик",
        "url": "https://hh.ru/vacancy/71237578?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Технически грамотная команда и руководство.\nУмение программировать на Python и C# обязательно! (Пожалуйста, не откликайтесь, если не знаете один из этих языков или, если опыт...",
        "company": "Шерстобитова Евгения"
    },
    {
        "title": "Python разработчик",
        "url": "https://hh.ru/vacancy/69988089?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддержка и развитие приложения бизнес-отчетности (Django + Superset) для внутренних потребителей. Поддержка и развитие ряда приложений по интеграции со...\nОпыт работы с Python – не менее 3 лет. SQL – продвинутый уровень владения. Английский не ниже Pre-Intermediate. Уверенное владение UML. ",
        "company": "ANCOR"
    },
    {
        "title": "Ведущий программист поддержки (Python, SQL)",
        "url": "https://hh.ru/vacancy/71257827?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разбор проблем, связанных с эксплуатацией базы географических адресов. Тестирование изменений и доработок. Приборка данных, в том числе, разработка скриптов для...\nВысшее техническое образование. Опыт разработки backend-приложений на Python 3.6+. Опыт работы с реляционными СУБД, знание SQL (Oracle...",
        "company": "ЭР-Телеком"
    },
    {
        "title": "Преподаватель по языку программирования Python",
        "url": "https://hh.ru/vacancy/70791133?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проведение очных занятий по языку программирования Python, JavaScript для школьников 8-11 классов по разработанным материалам не менее 2-х...\nВысшее профессиональное педагогическое образование или высшее профессиональное образование в области, соответствующей преподаваемому предмету. Глубокое знание своей предметной области, иметь желание...",
        "company": "СИНЕРГИЯ"
    },
    {
        "title": "Data Analyst (middle)",
        "url": "https://hh.ru/vacancy/71239668?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Подготовка сегментов для запуска маркетинговых кампаний. Поддержка внутреннего заказчика - консультирование по вопросам применения модельного аппарата для целей бизнеса. \nОпыт разработки на Python и знание основных аналитических библиотек: Pandas, NumPy. Уверенное владение SQL: аналитические функции, оптимизация запросов. ",
        "company": "Лига Цифровой Экономики"
    },
    {
        "title": "Программист Python",
        "url": "https://hh.ru/vacancy/71141972?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка кастомизаций с использованием скриптов на Groovy. Разработка кода на Python (на уровне написания веб-сервисов), sql, unix, bash, docker. \nОпыт разработка кода на Python. Опыт написание скриптов на Groovy. Опыт проведения тестирования внедренных решений. Усидчивость, умение работать в команде.",
        "company": "Газпромбанк"
    },
    {
        "title": "Backend-разработчик",
        "url": "https://hh.ru/vacancy/71279366?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка улучшений. Покрытие кода тестами. Рефакторинг кода.\nPython 3.10. Django 4. Django REST Framework. Postgresql, PostGIS. Celery. Redis. Docker.",
        "company": "АОДжимбо Системс"
    },
    {
        "title": "Middle data scientist",
        "url": "https://hh.ru/vacancy/71330147?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Развитие моделей антифрода. Сегментация клиентов. Развитие моделей клиентского центра (чатбот). Сложная визуализация данных.\nSQL на хорошем уровне: агрегации, группировки, оконные выражения, умение собирать запрос из 10 таблиц. Знание языка Python. Знание основных концепций...",
        "company": "QIWI"
    },
    {
        "title": "Python developer",
        "url": "https://hh.ru/vacancy/71139783?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проектировать архитектуру микросервисов в рамках нового проекта. Разрабатывать высоконагруженные, масштабируемые, безопасные сервисы в рамках SOA-проекта. Менторить junior и middle...\nУмение применять параллелизм, многопоточность, неблокирующие вызовы, асинхронность на python. Опыт работы с FastAPI, RabbitMQ, Kafka. Опыт работы с Service mesh...",
        "company": "ОООФинтех Айкью"
    },
    {
        "title": "Python (Junior) разработчик",
        "url": "https://hh.ru/vacancy/71079183?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Rocketdata.io – белорусская инновационная компания, резидент Парка Высоких Технологий Республики Беларусь, разрабатывающая платформу для управления информацией о бизнесе и работе с...\nМы готовы рассмотреть кандидатов без опыта, но с завершёнными курсами python разработки. Основы python. Html уверенные знания. Js базовые знания.",
        "company": "RocketData"
    },
    {
        "title": "Middle/Senior Data Engineer",
        "url": "https://hh.ru/vacancy/71220088?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Извлечение, преобразование, загрузка данных и их обработка. Построение датасетов для data science моделей и аналитики. Построение надежных и оптимальных пайплайнов...\nОпыт написания процессов загрузки данных ETL. Уверенное знание Python (Pandas, Numpy), опыт разработки, желание писать аккуратный и красивый код. ",
        "company": "ООО24Н Софт"
    },
    {
        "title": "Инженер по автоматизированному тестированию (Python)",
        "url": "https://hh.ru/vacancy/70580895?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "...опыт написания автоматизированных тестовых сценариев API/Web от 1 года. Анализ результатов выполнения автоматизированных тестов. Опыт разработки тестов на Python.\nОпыт использования фреймворков автотестирования. Опыт подготовки и настройки окружения для запуска автотестов. Понимание Agile-методологий (Scrum, Kanban). Опыт использования Selenium...",
        "company": "Сбер для экспертов"
    },
    {
        "title": "Python BackEnd Developer",
        "url": "https://hh.ru/vacancy/70534476?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Помогать в избавлении от legacy: окончательный уход от монолитной архитектуры в некоторых местах и переезд с Python2 на Python...\nОпыт построения высоконагруженных сервисов и обеспечения их доступности и надёжности. Опыт разработки на Python от 3-х лет. ",
        "company": "ОООЗвук"
    },
    {
        "title": "Lead backend developer (Python)",
        "url": "https://hh.ru/vacancy/70031149?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "...Python: от проектирования новой архитектуры до рефакторинга существующего кода, оптимизация. Поиск узких мест, поддержка существующих продуктов компании на языке Python. \nPython3 - уверенное знание языка и стандартной библиотеки. PostgreSQL - написание сложных запросов. Технологии: wsgi, redis, RabbitMQ. Работа в команде: git. ",
        "company": "ОООКеду Лабс"
    },
    {
        "title": "Backend-разработчик (Python)",
        "url": "https://hh.ru/vacancy/71051008?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Удаленная работа, обязательны ежедневные митапы с отчетами, рабочий процесс выстроен по методологии kanban.\nОт 2 лет коммерческий разработки на Python 3.х. Опыт работы в продуктовой команде. Опыт работы с веб-фреймверками (Django...",
        "company": "ОООАвгуро Технолоджис"
    },
    {
        "title": "DevOps инженер",
        "url": "https://hh.ru/vacancy/71403462?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Планирование, развертывание, настройка, мониторинг и поддержание в актуальном состоянии ИТ-инфраструктуры разработки и сопровождения ПО. Управление парком виртуальных машин на...\n...и опыт проектирования и создания распределенных сетей. Хороший опыт документирования результатов работ. Опыт работы с kubernetes, terraform. Знание Python, Ansible.",
        "company": "ОООПрогрэдис"
    },
    {
        "title": "Ведущий Python разработчик (Django)",
        "url": "https://hh.ru/vacancy/69273532?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проект: внутренний продукт для сотрудников подразделения технической аренды Компании. Реализация нового продукта комплексной автоматизации. Проектирование и разработка API. \nЖелательно: Redis (кэширование, транспорт между компонентами приложения), Celery/Python (фоновые задачи, планировщик задач). Понимание принципов CI/CD. Опыт работы с...",
        "company": "билайн: ИТ, Data, Digital"
    },
    {
        "title": "Python – разработчик",
        "url": "https://hh.ru/vacancy/71092815?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Опыт разработки сложных проектов. Обязателен опыт работы с django 2.*, python 3.7, djangorestframework. Знание SQL (в частности, PostgreSQL) и...",
        "company": "ОООМ.Б.А. Финансы"
    },
    {
        "title": "Преподаватель программирования для детей и подростков",
        "url": "https://hh.ru/vacancy/70283526?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проводить занятия по Python ( Scratch, LUA) с применением методических материалов и приемов Алгоритмики. Создавать и поддерживать атмосферу дружеской командной работы...\n...простым, интересным и веселым! Людей, уже умеющих программировать на Scratch, Python (или знать другой язык программирования). Опыт работы с детьми...",
        "company": "ТООIT Mind"
    },
    {
        "title": "Python Developer",
        "url": "https://hh.ru/vacancy/71152996?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Ищем Full Stack разработчика на проект ERP/CRM системы для компании ~ 100 человек. Нам необходим веб-клиент для оптимизации бизнес...\nКакие знания и навыки для нас важны: Понимание принципов разработки CRM-cистем. Знания Python/DRF и JavaScript. Опыт с Bootstrap. ",
        "company": "ОООПротектор"
    },
    {
        "title": "Middle+ Python разработчик",
        "url": "https://hh.ru/vacancy/71158637?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка на Python. Разработка скриптов для БД PostgreSQL. Написание тестов. Участие в разработке архитектуры продукта. Взаимодействие с бизнес-подразделением (проведение...\nУмеешь опыт разработки на Python от 2 лет. Работал с Pandas и NumPy. Опыт рефакторинга кода и его оптимизации. ",
        "company": "Сбер для экспертов"
    },
    {
        "title": "Тренер-наставник по Python/Web/Scratch (удалённо)",
        "url": "https://hh.ru/vacancy/70814969?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "проводить индивидуальные уроки с учеником. - поддерживать имидж и престиж Компании на высоком уровне.\nЧто Ты будешь делать: - обучать детей от 7 до 16 лет навыкам программирования. - владение Python/Web/Scratch (всеми или одной...",
        "company": "ИПХамитов И.Ж"
    },
    {
        "title": "Инженер по автоматизации (Python, C++)",
        "url": "https://hh.ru/vacancy/71316421?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Настройка сборки компонентов и библиотек под различные платформы. Устранение потенциальных уязвимостей, выявленных статическим и динамическим анализаторами. Развитие функциональности компонентов. \nЗнание языка C++. Знакомство со скриптовыми языками: Python, Bash, Batch. Знакомство с технологиями сборки: make, CMake. Опыт использования непрерывной интеграции. ",
        "company": "АОИнфоТеКС"
    },
    {
        "title": "Бэкенд-разработчик Python (Junior+)",
        "url": "https://hh.ru/vacancy/69950701?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддержка и разработка новых фич в микросервисах на python, работа с БД mysql и postgres. Используемые инструменты командной разработки: gitlab...\nЗнание Python (2 — 3). Опыт корпоративной разработки от 1 года. Понимание и опыт использования таких библиотек и фреймворков Python: CherryPy...",
        "company": "QIWI"
    },
    {
        "title": "Fullstack программист С#(WPF)-Python-MySQL",
        "url": "https://hh.ru/vacancy/71025796?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка ПО системы автоматизированного тестирования электронных компонентов (C#, Python, MySQL) Атом-АТЕ.\nКомпетентность, ответственность, высшее техническое образование. Способность работать в команде. Коммуникабельность.",
        "company": "ОООНаучно-исследовательский институт автоматики, телемеханики и метрологии"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/70423235?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка серверной части (Python,Django). Проектирование и разработка новой бизнес логики на уровне СУБД PostgreSQL \\ MS SQL. Оптимизация SQL-запросов. \nТребования: Отличное знание SQL\\T-SQL\\PLPGSQL, опыт не менее 2 лет. Опыт разработки Python от 2 лет. Знание ООП. ",
        "company": "ОООКомпания Дилявер"
    },
    {
        "title": "Python Team Lead",
        "url": "https://hh.ru/vacancy/69169263?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Сотрудничаем с российскими и зарубежными заказчиками, предлагаем индивидуальные концепции и IT-решения для каждого клиента. - Разработка web части сайтов на...\nЗнание Python, ООП, SQL, git, docker. - Опыт работы с фрейворком django/flask. - Опыт управления командой. - Опыт работы над интернет-сервисами. - ",
        "company": "ОООЕВАППС"
    },
    {
        "title": "Data Engineer",
        "url": "https://hh.ru/vacancy/69475611?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Построение высоконагруженных систем хранения больших данных. Выстраивание ETL процессов. Проектирование витрин данных. Выстраивание Pipeline разметки данных.\nОпыт работы с очередями (Kafka / RabbitMQ). Уверенное владение Python. Опыт работы с AirFlow/Luigi. Уверенное владение PySpark. Опыт разворачивания ETL...",
        "company": "КИБЕР-РОМ"
    },
    {
        "title": "ML-Ops/Dev-Ops",
        "url": "https://hh.ru/vacancy/69085670?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Развивать инфраструктуру используя IaaC. Повышать отказоустойчивость и доступность сервисов. Выстраивать Pipleline-ы сборки артефактов и их доставки до стендов. \nВажно уметь развернуть и настроить все своими руками! Владение скриптовыми языками Python/Bash. Опыт использования IaaC c помощью ansible/terraform...",
        "company": "КИБЕР-РОМ"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/71036265?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка ПО (написание программного кода).\nPython, Django ( 3-лет), DRF (Django Rest framework), celery, rabbitmq, redis, postgresql. Git/CI. Знание ООП, Solid, REST. ",
        "company": "Эттон"
    },
    {
        "title": "Junior Python developer (back-end)",
        "url": "https://hh.ru/vacancy/70954269?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка программных продуктов полного цикла: от идеи до внедрения. Разработка программных систем на основе технологии блокчейн.\nЗнание Python 3, опыт работы с Django и/или Flask. Понимание асинхронного программирования (asyncio). Опыт работы с реляционными базами данных...",
        "company": "ОООДесенчери"
    },
    {
        "title": "Data Engineer (Python), remote",
        "url": "https://hh.ru/vacancy/70195952?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Develop analytical tools across numerous DeFi projects. Study DeFi protocols to analyze investment opportunities. Build data pipelines from multiple blockchain...\nExperience in Python including libraries Pandas, Flask, Django, asyncio, plotly. Experience with web3 Python library. Advanced knowledge in PostgreSQL. ",
        "company": "Wise Wolves Group"
    },
    {
        "title": "Python developer",
        "url": "https://hh.ru/vacancy/71091392?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Создает и развивает сервис внутри компании. Цифровизирует обслуживание и делает его быстрее. Автоматизирует все внутренние бизнес-процессы для достижения максимальной...\nЗнание основ языка программирования Java, Python и основных библиотек анализа данных (pandas, numpy, statsmodel). Продвинутые знания SQL, PL/SQL. ",
        "company": "ДОБРОЦЕН"
    },
    {
        "title": "Продуктовый аналитик | Product Analyst",
        "url": "https://hh.ru/vacancy/71119093?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Продуктовая аналитика: Анализировать поведение пользователей внутри продуктов. Формулировать и проверять гипотезы. Проводить а/б тестов внутри приложения. Проводить а/б...\nБудет плюсом: Понимание ETL/ELT процессов. Опыт работы с Python, Jupyter Notebooks. Опыт работы с BigQuery или другими облачными базами...",
        "company": "Humans"
    },
    {
        "title": "Специалист по автоматизации тестирования (python), Логистика / Автосортеры",
        "url": "https://hh.ru/vacancy/71436092?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать и поддерживать автоматизированные тесты и end-to-end тесты. Создавать тест-план, сценарии и чек-листы, опираясь на бизнес...\nОпыт разработки на Python и знание фреймворков для тестирования (PyTest или другие). Знания и опыт работы с SQL. ",
        "company": "Ozon Информационные технологии"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/66097514?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработкой backend приложений на языке Python. Администрированием сервера приложений и БД NoSQL (MongoDB). Разработкой интеграционный интерфейсов. Разработкой API для взаимодействия...\nИмеешь опыт работы программистом от 2-х лет. Знаешь язык программирования Python 3.8+, Фреймфорк Django версии 3+. ",
        "company": "ПАО «Газпром нефть»"
    },
    {
        "title": "Python developer",
        "url": "https://hh.ru/vacancy/66112913?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "2 датацентра. Прирост свыше 200млн публикаций в месяц, по объемам - 2ТБ. Обход >50тыс источников с интервалом менее...\nРабота с большими данными в БД как SQL, так и NoSQL. Программирование асинхронных приложений на python и golang. ",
        "company": "Сайтсофт"
    },
    {
        "title": "Data analyst / BI analyst",
        "url": "https://hh.ru/vacancy/71321097?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Подготовка аналитических отчётов. Визуализация данных. ROI, Markov chain, CJM.\nОпыт работы от 1 года. Подготовка и анализ данных. Визуализация данных. SQL. Google big query. Oracle. Python. Power BI\\Tableau. ",
        "company": "НАО Финансовые системы"
    },
    {
        "title": "Python преподаватель в учебный центр",
        "url": "https://hh.ru/vacancy/70466587?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проведение занятий. Частичная проверка домашних заданий. Коммуникация со студентами вашей группы в телеграм. Обновление и адаптация программы.\nPython. Flask. Docker. PostgreSQL. Git. Опыт создания Restful API.",
        "company": "ОООTEHNIKUM CODE"
    },
    {
        "title": "TeamLead для команды разработки ПО",
        "url": "https://hh.ru/vacancy/70320168?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Технологии тестирования, регресионные, функциональные, интеграционные тесты. Желание работать с командой. Нанимать/увольнять сотрудников, распределять задачи, решать возникающие вопросы.\nЧто мы ожидаем от кандидата из технических навыков: Опыт программирование на Python. Наличие знаний по архитектуре операционной системы Linux. ",
        "company": "Алентис Электроникс"
    },
    {
        "title": "Lead Python Developer",
        "url": "https://hh.ru/vacancy/70850642?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработкой/поддержкой сервисов на Python. Обеспечением хорошего покрытия тестами кода. Ревью/менторинг своей команды по качеству решений. Дизайном архитектуры сервисов. \nЗнание Python. Опыт разработки проектов на Django/Flask/FastAPI. Опыт коммерческой разработки 5+ лет. Опыт в проектировании распределенных систем. ",
        "company": "FunBox"
    },
    {
        "title": "Junior Python Developer (Intranet)",
        "url": "https://hh.ru/vacancy/70962699?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Onboarding новых сотрудников. Календарь событий компании. База знаний и терминология компании. Профили и достижения всех сотрудников. Заказ еды для офисных...\nОпыт коммерческой разработки на Python3 в связке с Django от 1 года. Опыт работы с базами данных (PostgreSQL). ",
        "company": "Emerging Travel Group (Ostrovok.ru, B2B.Ostrovok, RateHawk, ZenHotels)"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/71094494?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Предстоит улучшать и расширять набор готовых блоков для создания сценариев офисной автоматизации (Web, Excel, Word, SAP и прочие приложения). \nРаботаешь с современным стеком. Увлечённо пишешь качественный и чистый код. Python3+ от 2-х лет. Понимание принципов ООП...",
        "company": "АОГринатом"
    },
    {
        "title": "Senior/Lead Python-разработчик",
        "url": "https://hh.ru/vacancy/71358576?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Задачи с высоким уровнем ответственности: предстоит проектировать архитектуру, реализовывать бизнес-логику, самостоятельно принимать решения, запускать сервисы с необходимым уровнем качества. \nГибкость: продукты Контура постоянно адаптируются под рынок и пользователей, нужно уметь работать в меняющихся условиях.",
        "company": "Контур"
    },
    {
        "title": "Инженер (Linux)",
        "url": "https://hh.ru/vacancy/69906235?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проведение внедрений продуктов по информационной безопасности (классы решений SIEM/PAM/UBA). Проведение пилотных проектов и обновлений у заказчиков. \nЗнание скриптовых языков программирования (Ruby, Python). Опыт написания технической документации. Опыт написания скриптов на bash. Опыт администрирования IT структуры. ",
        "company": "Angara Security"
    },
    {
        "title": "Python Team Lead",
        "url": "https://hh.ru/vacancy/70989259?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Управлять задачами контроля качества разрабатываемого ПО (контролировать обязательства и сроки, загрузку сотрудников, обеспечивать прозрачные статусы задач и релизов). \nОпыт на Python от 8 лет. Опыт работы в продуктах/проектах в области виртуализации, дата-центров, облачной инфраструктуры, облачных хранилищ. ",
        "company": "Ростелеком - Центры обработки данных"
    },
    {
        "title": "Data Scientist / ML-инженер",
        "url": "https://hh.ru/vacancy/69856866?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Построение и тестирование гипотез. Создание моделей для задач NLP и CV. Доработка и улучшение существующих моделей. Анализ данных из социальных...\nУверенное знание Python и библиотек для работы с данными (numpy, pandas, sklearn, catboost и др.). Умение писать чистый хорошо структурированный...",
        "company": "Медиалогия"
    },
    {
        "title": "QA engineer (Python)",
        "url": "https://hh.ru/vacancy/67264411?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Развивать и поддерживать фреймворк для тестирования. Инициатива по улучшению фреймворка или тестов - приветствуется.\nОпыт работы с Python3.9+. Опыт использования pytest. Будет плюсом: Знание Jenkins. Знание Allure TestOps. Опыт работы/разработки...",
        "company": "Бюро 1440"
    },
    {
        "title": "Python developer Middle / Senior",
        "url": "https://hh.ru/vacancy/71128382?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Опыт работы с Python 3.x. Отличное знание фреймворков Django, FastAPI , asyncio. Опыт работы с PostgreSQL. Опыт работы с Redis...",
        "company": "ТООТрансавиа"
    },
    {
        "title": "Fullstack developer (Python + JS)",
        "url": "https://hh.ru/vacancy/71080047?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Создание нового портала ИТ заявок для сотрудников банка. В рамках проекта предстоит перенести существующие заявки (около 700 шт.) на новую...\nОпыт работы Python backend разработчиком от 3-х лет и JS от 1-го года в команде с отлаженным процессом...",
        "company": "Кадровое агентство Юнити"
    },
    {
        "title": "Python разработчик (middle)",
        "url": "https://hh.ru/vacancy/70916917?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддержка рабочего кода, улучшения в работе сервиса видеонаблюдения и ТВ. Разработка сервиса домофонии. Взаимодействие с билинговой системой (есть возможность выбора...\nPython. Docker. Понимание процессов и опыт CI/CD. GitLab. Python (FastAPI в приоритете, django). Kafka. Знание одного из диалектов SQL...",
        "company": "ИНСИС"
    },
    {
        "title": "Преподаватель компьютерных курсов для взрослых С++ ,С#, Python, JavaScript, г.Липецк",
        "url": "https://hh.ru/vacancy/70344838?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Весь методический материал уже есть, придумывать ничего не нужно!). Преподавание (лекционные и практические занятия) в группах до 16 человек в...\nВладение по отдельности или одновременно языками программирования: С++ ,С#, Python, JavaScript, HTML/CSS. - Ответственность, пунктуальность, желание делиться знанием и опытом. - ",
        "company": "Компьютерная Академия Top"
    },
    {
        "title": "Ведущий инженер-программист – Бэкенд-разработчик на Python",
        "url": "https://hh.ru/vacancy/70975202?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "В проект разработки автоматизированной системы управления связью. Функциональные обязанности. - Backend разработка. - Реализация бизнес-логики. - Участие в улучшении и доработке текущей...\nОпыт разработки от 5 лет на Python. - Опыт в ОС Linux. - Стек: Flask/FastAPI, SQLAlchemy, Postgres, Redis, Celery. - ",
        "company": "АООмский НИИ Приборостроения"
    },
    {
        "title": "Fullstack-разработчик (Python + JS)",
        "url": "https://hh.ru/vacancy/71111225?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Добавление интеграций с другими ИС. Создание новых справочников (БД). Перенос части функционала из MF SM в портал. Добавление новых разделов...\nОпыт работы Python backend разработчиком от 3-х лет и JS от 1-го года в команде с отлаженным процессом...",
        "company": "Outlines Technologies"
    },
    {
        "title": "Senior Data Scientist (Big Data)",
        "url": "https://hh.ru/vacancy/71212571?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проведение Proof-of-Concept по возможности построения моделей, решающих конкретные бизнес-задачи (например, подтвердить возможность выделение из разговора с клиентом...\nУверенное владение sql (Oracle/PostgreSQL). Классический стек на python (pandas, numpy, sklearn, xgboost, etc.) и хотя бы один DL-framework...",
        "company": "ОТП Банк, АО (OTP bank)"
    },
    {
        "title": "Middle/Middle+ Python Developer",
        "url": "https://hh.ru/vacancy/70460727?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Работал в команде более 7 человек.\nУверенное знание Python. Опыт работы с Django/Django REST framework. Понимание принципов ООП, SOLID. Знание и понимание принципов построения REST...",
        "company": "FIRECODE"
    },
    {
        "title": "Преподаватель Python",
        "url": "https://hh.ru/vacancy/71274778?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Подготовка методического материала. Обучение программированию учеников. Контроль успеваемости и выполнения домашних заданий. Предоставление обратной связи ученикам.\nЗнание теории алгоритмов и структуры данных. Знание синтаксиса языка программирования Python. Знание дополнительных модулей будет плюсом. Знание Framework-ов Django...",
        "company": "ТОО2дэй академи"
    },
    {
        "title": "Преподаватель на программу \"Язык программирования Python\"",
        "url": "https://hh.ru/vacancy/71332825?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проведение очных (г. Подольск) занятий по темам: Ведение лекционных и практических занятий. Проверка итоговых работ.\nОпыт работы преподавателем или специалистом-практиком по профилю программы. Знание предметной области. Грамотная письменная и устная речь. Наличие разработанных учебных...",
        "company": "СИНЕРГИЯ"
    },
    {
        "title": "Разработчик python (Middle/Senior)",
        "url": "https://hh.ru/vacancy/70698542?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Интересные проекты и современный стек (Celery, FastAPI, Tornado, PostgreSQL, RabbitMQ, Docker. Для разработки используем VS Code, Gitlab, Jira, Confluence). \nНестандартные решения и желание экспериментировать. Успешный опыт в разработке на Python 3.* (скоринговых карт, анти-фрод решений, интеграционной шины). ",
        "company": "Eqvanta"
    },
    {
        "title": "Backend разработчик python",
        "url": "https://hh.ru/vacancy/69286251?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в проектировании и реализации архитектурных решений. Реализация модулей взаимодействия между сервисами, приложениями и серверами. Код- ревью разработки внешней команды.\nОпыт работы в виде разработчика микросервисных решений на базеbackend технологий языка Python (Flask, FastAPI). Знание AMQP брокеров сообщений RabbitMQ, Redis...",
        "company": "ПАО «Газпром нефть»"
    },
    {
        "title": "Senior/Lead Python-разработчик",
        "url": "https://hh.ru/vacancy/71358583?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Задачи с высоким уровнем ответственности: предстоит проектировать архитектуру, реализовывать бизнес-логику, самостоятельно принимать решения, запускать сервисы с необходимым уровнем качества. \nГибкость: продукты Контура постоянно адаптируются под рынок и пользователей, нужно уметь работать в меняющихся условиях.",
        "company": "Контур"
    },
    {
        "title": "Python developer (Кипр)",
        "url": "https://hh.ru/vacancy/70977511?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Создание сложных торговых алгоритмов, статистических моделей. Поиск закономерностей в данных. Проверка валидности результатов тестов и гипотез. Генерация и поиск новых...\nОпыт разработки на Python 3 не менее 3-х лет. Высшее образование (физмат или Computer Science). Знание многопоточности и асинхронного...",
        "company": "Wanted"
    },
    {
        "title": "Senior/Lead Python-разработчик",
        "url": "https://hh.ru/vacancy/71358588?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Задачи с высоким уровнем ответственности: предстоит проектировать архитектуру, реализовывать бизнес-логику, самостоятельно принимать решения, запускать сервисы с необходимым уровнем качества. \nГибкость: продукты Контура постоянно адаптируются под рынок и пользователей, нужно уметь работать в меняющихся условиях.",
        "company": "Контур"
    },
    {
        "title": "Middle разработчик нейросетевых алгоритмов / Reinforcement Learning",
        "url": "https://hh.ru/vacancy/71038868?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Самостоятельно разбираться в предложенной области и предлагать решения. Углублять свои теоретические знания и использовать их на практике. Исследовать современные подходы...\nНаличие опыта написания и удачного использования хотя бы нескольких из них. Владение Python на уровне middle разработчика (основные концепции языка...",
        "company": "Федеральное автономное учреждение Государственный Научно-Исследовательский Институт Авиационных Систем"
    },
    {
        "title": "Разработчик Python/Django (Middle)",
        "url": "https://hh.ru/vacancy/71026821?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в разработке проектов. Разработка backend (REST API ) для сервисов, как в рамках новых проектов, так и для уже существующих. \nОтличное знание Python, Django, Celery, PostgreSQL, Redis, ClickHouse (желателен опыт работы от 3-х лет). Опыт написания unit-тестов. ",
        "company": "AlfaBit.Group"
    },
    {
        "title": "Python Developer",
        "url": "https://hh.ru/vacancy/71080955?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Ищем Full Stack разработчика на проект ERP/CRM системы для компании ~ 100 человек. Нам необходим веб-клиент для оптимизации бизнес...\nКакие знания и навыки для нас важны: Понимание принципов разработки CRM-cистем. Знания Python/DRF и JavaScript. Опыт с Bootstrap. ",
        "company": "ОООПротектор"
    },
    {
        "title": "Python Middle+ разработчик",
        "url": "https://hh.ru/vacancy/70907778?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддерживать и оптимизировать текущие проекты, создавать новые. Учавствовать в проработке и улучшении архитектуры системы и API. Использовать современные подходы, инструменты...\nЭкспертное владение Python, PostgreSql и MySQL. Опыт работы с синхроннными фреймворками ( Django/Flask). Навыки создания Rest API. Понимаете суть принципов...",
        "company": "it-aces.com"
    },
    {
        "title": "Инженер по автоматизации (Python, C++)",
        "url": "https://hh.ru/vacancy/71316420?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Настройка сборки компонентов и библиотек под различные платформы. Устранение потенциальных уязвимостей, выявленных статическим и динамическим анализаторами. Развитие функциональности компонентов. \nЗнание языка C++. Знакомство со скриптовыми языками: Python, Bash, Batch. Знакомство с технологиями сборки: make, CMake. Опыт использования непрерывной интеграции. ",
        "company": "АОИнфоТеКС"
    },
    {
        "title": "Senior Data scientist (Антифрод)",
        "url": "https://hh.ru/vacancy/71139342?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Анализировать данные и выдвигать гипотезы по новым типам нарушений. Разрабатывать новые механики автоматической проверки объявлений. Оценивать результаты внедренных моделей. \nВладение SQL на уровне написания сложных запросов (мы используем postgres и clickhouse). Уверенное владение Python (Pandas, NumPy, SkiPy, scikit-learn...",
        "company": "Домклик"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/71039358?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Виртуализация/контейнеризация: Openstack, Vmware, Docker, OpenShift. Базы данных: Postgres, Clickhouse. Взаимодействия: REST API, JSON, Rabbit MQ. Разработка: Python, React, Ruby. \nБольшой опыт работы с Python (мы используем Python 3.6+) и смежными технологиями. Django, DRF, Celery, - вы пробовали что...",
        "company": "Сбер для экспертов"
    },
    {
        "title": "Руководитель Backend разработки (Python)",
        "url": "https://hh.ru/vacancy/70152181?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Лидирование и непосредственное участие в формировании архитектуры общих библиотек. Форматирование и актуализация структуры собеседования новых специалистов. Создание и развитие системы...\nОпыт разработки Python более 5 лет. Опыт управления командой/командами более 1 года. Опыт выстраивания процессов найма. Темп найма от...",
        "company": "Группа Самолет"
    },
    {
        "title": "Разработчик СУБД (C/Python)",
        "url": "https://hh.ru/vacancy/70030990?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Заниматься разработкой новой функциональности ядра СУБД Greenplum. Участвовать в разработке Open Source проекта Greenplum. Обеспечивать поддержку 3-го уровня (багфиксы...\nВладеете стандартами языка ANSI С. Имеете опыт системного серверного программирования. Знание Python будет плюсом. Имеете навыки работы с Git. ",
        "company": "ОООАренадата Софтвер"
    },
    {
        "title": "DevOps Engineer",
        "url": "https://hh.ru/vacancy/69310423?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Route4Me - наиболее используемая платформа оптимизации маршрутов для наземного транспорта в мире. Каждый день мы помогаем бизнесу, от крупных...\n...CentOS, Alpine, etc.). Желательно: - Опыт работы с hashicorp vault. - Знание основ любого из интерпритируемых языков программирования (желательно Python). - Знание Bash.",
        "company": "Route4Me"
    },
    {
        "title": "Аналитик страховых данных",
        "url": "https://hh.ru/vacancy/71291234?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Анализ данных с помощью Python. Ad Hoc аналитика. Подготовка данных и обучение моделям ML. Подготовка ТЗ для команды разработчиков. \nОпыт работы аналитиком от 2 лет. Знание Python (pandas, numpy, plt, sklearn), SQL (умение создавать таблицы и выводить данные). ",
        "company": "Совкомбанк Страхование"
    },
    {
        "title": "Senior/Lead Python-разработчик",
        "url": "https://hh.ru/vacancy/71358586?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Задачи с высоким уровнем ответственности: предстоит проектировать архитектуру, реализовывать бизнес-логику, самостоятельно принимать решения, запускать сервисы с необходимым уровнем качества. \nГибкость: продукты Контура постоянно адаптируются под рынок и пользователей, нужно уметь работать в меняющихся условиях.",
        "company": "Контур"
    },
    {
        "title": "Backend разработчик python",
        "url": "https://hh.ru/vacancy/70960750?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка бекэнд сервисов на Python. Добавление, извлечение и анализ данных из SQL и NoSQL баз данных: Clickhouse, PostgreSQL, MongoDB. \nУверенное пользование: Django Rest Framework. Рассматриваем кандидатов ТОЛЬКО с опытом работы не менее 3 лет. Категория и специализация.",
        "company": "Tandemseller"
    },
    {
        "title": "Data analyst",
        "url": "https://hh.ru/vacancy/71270057?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка математических моделей для решения аналитических задач. Автоматизация регулярных процессов и отчетности. Разработка гипотез по улучшению ключевых метрик и оптимизация...\nАналитические навыки (умение анализировать и структурировать данные, умение делать выводы, выдвигать и проверять гипотезы). Владение Python для анализа данных (обработка...",
        "company": "ОООМедиапоинт"
    },
    {
        "title": "Разработчик python (Middle/Senior)",
        "url": "https://hh.ru/vacancy/70501811?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Интересные проекты и современный стек (Celery, FastAPI, Tornado, PostgreSQL, RabbitMQ, Docker. Для разработки используем VS Code, Gitlab, Jira, Confluence). \nНестандартные решения и желание экспериментировать. Успешный опыт в разработке на Python 3.* (скоринговых карт, анти-фрод решений, интеграционной шины). ",
        "company": "Eqvanta"
    },
    {
        "title": "Программист-разработчик (удаленно)",
        "url": "https://hh.ru/vacancy/71121496?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Компания Эра Маркетплейсов (ERA MP) создает различные IT-продукты для продвижения селлеров на Wildberries и Ozon. Ищем разработчика для улучшения...\nЗнание Python (NumPy, Pandas) на высоком уровне. Знание Rabbit. Опыт работы в ElasticSearch (не менее года). Опыт работы в Postman. ",
        "company": "ERA MP"
    },
    {
        "title": "Data-инженер",
        "url": "https://hh.ru/vacancy/69471604?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в разработке ядра продуктов Data Platform. Разработка и оптимизация процессов выгрузки данных.\nЗнание одного из языков программирования: Python, Java, Go. Знание основ ООП, теории алгоритмов, структур данных. Знание SQL. Опыт написания процессов...",
        "company": "Тинькофф"
    },
    {
        "title": "Разработчик",
        "url": "https://hh.ru/vacancy/70742504?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Мы компания-разработчик ПО для промышленности – с помощью, математики, статистки и науки о данных оптимизируем технологические процессы на обогатительных фабриках. \nОпыт разработки веб-приложений на Python. Опыт разработки веб-приложений на скриптовых языках программирования для разработки интерфейсов (vue.js, react). ",
        "company": "ОООБелка Диджитал"
    },
    {
        "title": "Data Engineer (Python), remote",
        "url": "https://hh.ru/vacancy/70195991?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Develop analytical tools across numerous DeFi projects. Study DeFi protocols to analyze investment opportunities. Build data pipelines from multiple blockchain...\nExperience in Python including libraries Pandas, Flask, Django, asyncio, plotly. Experience with web3 Python library. Advanced knowledge in PostgreSQL. ",
        "company": "Wise Wolves Group"
    },
    {
        "title": "Инженер по автоматизации тестирования (QA Automation Engineer) (Python/JavaScript/TypeScript)",
        "url": "https://hh.ru/vacancy/70836931?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Самостоятельно разрабатывать и улучшать автоматические тесты для онлайн платформы по разметке данных для искусственного интеллекта (https://github.com/opencv/cvat). \nОпыт работы с системой контроля версий (Git). Достаточно хорошее знание Python или JavaScript/TypeScript для написания и отладки тестовых сценариев. ",
        "company": "ОООXperience.ai"
    },
    {
        "title": "Product Analyst",
        "url": "https://hh.ru/vacancy/70703653?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проверять гипотезы (формирование, тестирование, оценка результата). Составлять отчеты и анализировать динамику ключевых метрик продуктов. Разрабатывать метрики, которые помогут определять успех...\nПонимать, моделировать и анализировать LTV, ROI, ARPU, retention, churn и др. Опыт автоматизации процессов аналитики (Python/R). Умение проводить А...",
        "company": "KIVORK"
    },
    {
        "title": "Senior/Lead Python-разработчик",
        "url": "https://hh.ru/vacancy/71358585?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Задачи с высоким уровнем ответственности: предстоит проектировать архитектуру, реализовывать бизнес-логику, самостоятельно принимать решения, запускать сервисы с необходимым уровнем качества. \nГибкость: продукты Контура постоянно адаптируются под рынок и пользователей, нужно уметь работать в меняющихся условиях.",
        "company": "Контур"
    },
    {
        "title": "Разработчик Python (Блок Риски)",
        "url": "https://hh.ru/vacancy/71079969?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Внедрение новых и сопровождение (доработка/внесение изменений) текущих моделей оценки кредитного риска в автоматизированных системах Банка. Подготовка технической документации для...\nВысшее образование. Знание Python: написание, отладка и тестирование кода. Опыт в написании сервисов на Python. Опыт в анализе логов сервиса...",
        "company": "Сбер. Экспертам и руководителям"
    },
    {
        "title": "Python-разработчик (FastAPI)",
        "url": "https://hh.ru/vacancy/68918258?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Решение задач разработки в рамках команды Финансовых сервисов. Сейчас команда начинает работу над сервисом агрегации данных по статистике и роялти...\nОпыт коммерческой разработки на Python от 2х лет. Python (FastAPI), понимание принципов работы асинхронности. Глубокое понимание asyncio. ",
        "company": "ЛитРес"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/51472686?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка новых модулей и расширение существующего функционала систем по требованиям заказчика. Работа с системой контроля версий и системой управления проектом...\nИмеете опыт работы от 1 года. Знаете популярные Python-библиотеки и фреймворки (Django, Flask). Работали с Docker, Docker Compose. ",
        "company": "ОООЭлРос"
    },
    {
        "title": "Разработчик программного обеспечения (Python)",
        "url": "https://hh.ru/vacancy/70975436?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "ООО «Центр инженерной физики МГУ» разрабатывает системы для диагностики электроники, контроллеры электродвигателей и другие промышленные электронные устройства. Мы ведём как...\nхорошие базовые знания Python и его стандартных библиотек. - хорошее знание стандартных математических библиотек и библиотек для обработки изображений. - ",
        "company": "ОООЦентр инженерной физики МГУ"
    },
    {
        "title": "Python разработчик",
        "url": "https://hh.ru/vacancy/69717093?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Выполнение задач, поставленных ведущим разработчиком или руководителем проекта. Анализ, проектирование, разработка и тестирование программного обеспечения в соответствии со стандартами, принятыми...\nБудет плюсом: Опыт работы с другими фреймворками Python (FastAPI). Опыт работы с фреймворками FrontEnd (ReactJS). Знание OS Linux на уровне...",
        "company": "Т1 Интеграция"
    },
    {
        "title": "Python developer",
        "url": "https://hh.ru/vacancy/66934335?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Наставление менее опытных коллег.\nОтличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ",
        "company": "Тинькофф"
    },
    {
        "title": "Data Scientist",
        "url": "https://hh.ru/vacancy/69293111?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Model system development (credit scoring, antifraud, behavior scoring). Model system monitoring and support. Risk analytics and reporting. DWH data quality...\nAdvanced SQL level. Advanced in ML modeling (Python). Advanced data analysis skills. Proficient with MS Excel. Knowledge of retail credit...",
        "company": "Finstar Financial Group"
    },
    {
        "title": "QA-инженер в отделе разработки СУБД (Postgres Pro)",
        "url": "https://hh.ru/vacancy/71230600?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "30% проверка инцидентов непрохождения автотестов, развитие тестового фреймворка на Python. - 10% расследование инцидентов и поиск редких/сложновоспроизводимых багов. \nОпыт работы в Linux от 2х лет. Базовое (или выше) знание Python. Английский язык, достаточный для чтения технической документации. ",
        "company": "Postgres Professional"
    },
    {
        "title": "Аналитик данных (Junior)",
        "url": "https://hh.ru/vacancy/71114723?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "В рамках анализа бизнес-процесса самостоятельно ставить гипотезы, анализировать данные, проводить и оценивать эксперименты. Исследовать источники данных, обеспечивать сбор и...\nЗнание основ математической статистики и теории вероятности. Уверенное владение стандартным стеком python-библиотек (sklearn, pandas, numpy, scipy, matplotlib, LightGBM и...",
        "company": "АОНПФ ЭВОЛЮЦИЯ"
    },
    {
        "title": "Senior/Lead Python-разработчик",
        "url": "https://hh.ru/vacancy/71358577?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Задачи с высоким уровнем ответственности: предстоит проектировать архитектуру, реализовывать бизнес-логику, самостоятельно принимать решения, запускать сервисы с необходимым уровнем качества. \nГибкость: продукты Контура постоянно адаптируются под рынок и пользователей, нужно уметь работать в меняющихся условиях.",
        "company": "Контур"
    },
    {
        "title": "Разработчик СУБД (C/Python)",
        "url": "https://hh.ru/vacancy/70030989?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Заниматься разработкой новой функциональности ядра СУБД Greenplum. Участвовать в разработке Open Source проекта Greenplum. Обеспечивать поддержку 3-го уровня (багфиксы...\nВладеете стандартами языка ANSI С. Имеете опыт системного серверного программирования. Знание Python будет плюсом. Имеете навыки работы с Git. ",
        "company": "ОООАренадата Софтвер"
    },
    {
        "title": "Middle/Senior Python-разработчик в команду Добычи данных",
        "url": "https://hh.ru/vacancy/68116288?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Форматы, в которых мы получаем данные, многообразны: от хорошо документированных и структурированных REST API до заполняемых человеком Excel-файлов. \nЗнакомство с чем-то из списка выше, больше — лучше. Опыт парсинга — желательно сайтов. Опыт работы с ETL, AirFlow, PostGIS, ArcGIS...",
        "company": "2ГИС"
    },
    {
        "title": "Data Engineer (Python), remote",
        "url": "https://hh.ru/vacancy/70195900?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Develop analytical tools across numerous DeFi projects. Study DeFi protocols to analyze investment opportunities. Build data pipelines from multiple blockchain...\nExperience in Python including libraries Pandas, Flask, Django, asyncio, plotly. Experience with web3 Python library. Advanced knowledge in PostgreSQL. ",
        "company": "Wise Wolves Group"
    },
    {
        "title": "Web-разработчик (Python/ReactJS)",
        "url": "https://hh.ru/vacancy/70157666?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка front-end интерфейса, как для внутренних, так и внешних пользователей ведомственных информационных систем. Работа с внутренними (СУБД) и с...\nВысшее образование. Опыт работы в качестве Web-разработчика от 1 года. Уверенные знания HTML 5, CSS 3, Java Script. ",
        "company": "ФБУ Информационно-технический центр ФАС России"
    },
    {
        "title": "Инженер по конфигурационному управлению/DevOps",
        "url": "https://hh.ru/vacancy/71354023?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Автоматизация сборки и установки программных продуктов. Автоматизация установки программных продуктов. Настройка, управление и поддержка DevOps процессов (CI/CD и другие). \nБазовые знания языков программирования (Python) и баз данных. Опыт работы и администрирования ОС семейства Linux, знание Bash/Unix shell. ",
        "company": "ОООТелеформ ИС"
    },
    {
        "title": "Python-разработчик (junior)",
        "url": "https://hh.ru/vacancy/70857648?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Реализовывать алгоритмы и структуры данных для решения задач на графах. Оптимизировать и рефакторить существующий код. Разрабатывать прототипы для проверки гипотез...\nУверенное использование Python 3.8. Знание базовых структур данных и алгоритмов, способность оценивать скорость работы алгоритмов. Умение вникать в большие...",
        "company": "ОООЦелус Менеджмент"
    },
    {
        "title": "DevOps / SRE инженер",
        "url": "https://hh.ru/vacancy/70915117?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Обеспечивать работоспособность и доступность бизнес-систем. Управлять конфигурациями и микросервисами. Администрировать сервера приложений и СУБД (в основном SaaS). \nНавыки работы с Docker. Уверенное владение SQL. Опыт автоматизация на Python,BASH. Будет плюсом, если есть: Опыт работы с российскими...",
        "company": "ОООГородской информационный центр Инфосити"
    },
    {
        "title": "Разработчик СУБД (C/Python)",
        "url": "https://hh.ru/vacancy/70030991?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Заниматься разработкой новой функциональности ядра СУБД Greenplum. Участвовать в разработке Open Source проекта Greenplum. Обеспечивать поддержку 3-го уровня (багфиксы...\nВладеете стандартами языка ANSI С. Имеете опыт системного серверного программирования. Знание Python будет плюсом. Имеете навыки работы с Git. ",
        "company": "ОООАренадата Софтвер"
    },
    {
        "title": "Программист Python",
        "url": "https://hh.ru/vacancy/69328736?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка и поддержка клиентских и не только интерфейсов. Программирование Python. Ждем в команду программиста backend или full-stack, который знаком...\nЯзык - python 2.7 , 3.6. Субд - postgresql 9.2 + mssql. Django rest framework. Уверенное владение Linux (ubuntu).",
        "company": "Дельта системы безопасности"
    },
    {
        "title": "Fullstack Python Developer",
        "url": "https://hh.ru/vacancy/71391452?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Без проблем переключается между задачами на frontend и backend.\nБольшая гибкость в технологиях и подходах. Имеет опыт разработки на Python от 3 лет. Знает JavaScript, React (или любой другой...",
        "company": "Nitka Technologies"
    },
    {
        "title": "Руководитель группы разработки (Python)",
        "url": "https://hh.ru/vacancy/70860611?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Роль: 75% управление бекэнд разработкой, 25% - кодинг. Проект: приложение для застройщика, в котором реализованы сервисы управляющей компании, оплата счетов, наблюдение...\nзнание методологий управления проектами и методологий гибкой разработки. (Hard Skills): - уверенное знание Python. - фундаментальные знания в области информационных технологий. - ",
        "company": "Mintrocket"
    },
    {
        "title": "Преподаватель по программированию",
        "url": "https://hh.ru/vacancy/71261582?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Выполнение задач в рамках рабочего процесса. Программирование на языке Python: Знания классов и ООП, архитектуры CLI приложений, virtualenv, стандартов написания...\nЗнания графических функции Visual C++ (вывод графического текста функциями C++), STL и её составляющие, синтаксиса рекурсивной функции, функций чтения и...",
        "company": "Композиты России"
    },
    {
        "title": "Python Developer в команду тестирования/Remote",
        "url": "https://hh.ru/vacancy/69045414?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Осуществлять интеграцию с внешними сервисами (API) на языке Python. Анализировать и оптимизировать существующий код на языке Python. Написание и выполнение...\nУмение работать из Python кода с базами данных Postgres, Clickhouse. Понимание протоколов HTTP, TCP, UDP, и метода передачи данных в...",
        "company": "Tradetech Development"
    },
    {
        "title": "Python Team Lead",
        "url": "https://hh.ru/vacancy/71319429?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Мы в поиске талантливого разработчика (Team Lead) на языке Python для проекта по созданию портала мониторинга ИТ-инфраструктуры и сервисов...\nБудет плюсом: Опыт построения и понимание процессов команды разработки. Опыт работы с другими фреймворками Python. Опыт работы с фреймворками FrontEnd...",
        "company": "Т1 Интеграция"
    },
    {
        "title": "Программист-математик",
        "url": "https://hh.ru/vacancy/68235157?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Исследование алгоритмов. Проведение проверок новых гипотез и подходов. Построение математических моделей. Разработка программных моделей по математическому описанию.\nГрафы, группы, поля, кольца, конечные автоматы, вычислительная сложность. Численные методы, теория вероятностей, линейная алгебра. C/C++. Python. Паскаль. Нестандартное мышление. ",
        "company": "ОООСпециальный Технологический Центр (ООО СТЦ)"
    },
    {
        "title": "Python Developer (Django)",
        "url": "https://hh.ru/vacancy/70347727?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в проектировании архитектуры в сотрудничестве с архитекторами и другими руководителями. Backend-разработка веб-приложений на Django. Написание функций обработчиков...\nPython3 (знание на уровне написания собственных метаклассов и декораторов). Django (знание фреймворка на уровне переопределения QuerySet, models.Manager, написания собственных...",
        "company": "Рексофт"
    },
    {
        "title": "Программист Backend в Технический блок (Python, SQL)",
        "url": "https://hh.ru/vacancy/70743803?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Работа в VEON подразумевает соблюдение высокого уровня деловой этики, юридических обязательств, наших ценностей и Кодекса поведения, поддержки политик и процедур...\nОпыт Backend разработки не менее 3-х лет. ∙ Уверенное знание языка программирования Python, опыт использования фреймворков/библиотек. ∙ Опыт работы MySQL...",
        "company": "Beeline, ТМ"
    },
    {
        "title": "Python разработчик в CM.Expert (Яндекс Вертикали)",
        "url": "https://hh.ru/vacancy/68613226?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Вместе с нами решать сложные архитектурные вопросы. Выполнять обилие разных задач: продуктовые, которые приносят пользу пользователям, совместные задачи с ML...\nБольше трех лет работали с Python 3 с использованием асинхронного программирования. Имели дело с клиент-серверными приложениями и знаете, что...",
        "company": "Яндекс"
    },
    {
        "title": "Разработчик backend (python)",
        "url": "https://hh.ru/vacancy/69426809?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка ML пайплайнов и сервисов как собственными силами, так и совместно с бизнес-подразделениями и подрядчиками. R&D, исследование новых...\nВладение языками Python (90% разработки) и Kotlin (10% разработки). Опыт в разработке backend от 2-х лет. Приветствуется опыт работы...",
        "company": "Росгосстрах"
    },
    {
        "title": "Middle Python Developer (блок навигации)",
        "url": "https://hh.ru/vacancy/69778861?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Задачи: Написание сервисов, выполняющих python - скрипты в Armbian на ARM - вычислителе. Скрипты направлены на создание удобного UI для навигационного блока...\nОбязательные навыки. Python: умение работать с потоками; использование логирования (настройка уровня логирования, ротация логов по превышению объема). Уверенное владение системами...",
        "company": "Cognitive Pilot"
    },
    {
        "title": "Программист С++ / Python",
        "url": "https://hh.ru/vacancy/69327662?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка специализированного мультиплатформенного мебельного приложения для Компас-3D средствами Open API. Разработка интерфейса с наличием специализированных для проектирования мебели...\nЗнание языка программирования C++ / Python. Опыт разработки приложений на C++ / Python. Опыт работы в CAD системах на уровне уверенного пользователя...",
        "company": "Ангстрем, Группа компаний"
    },
    {
        "title": "Инженер по автотестированию/QA (Python)",
        "url": "https://hh.ru/vacancy/71036773?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддерживать существующие и разрабатывать новые функциональные автотесты (мы используем Python3 + Pytest). Заниматься нагрузочным тестированием (внутренний инструмент). \nПонимание сетевых протоколов (модель OSI, стек TCP/IP - описание, сравнение, примеры). Опыт программирования на python. Опыт работы с БД на...",
        "company": "Протей, НТЦ"
    },
    {
        "title": "Middle/Senior Python Developer",
        "url": "https://hh.ru/vacancy/70798597?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка клиентских продуктов Банка. Участие в проектировании архитектуры и предложений по улучшению решений и процессов.\nОпыт создания приложений и разработки API на Python, используя веб-фреймворки и библиотеки (DJango или Asyncio / FastAPI и др.). ",
        "company": "Bank RBK, АО"
    },
    {
        "title": "Преподаватель Python",
        "url": "https://hh.ru/vacancy/70820002?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проведение очных занятий по JavaScript для школьников 8-11 классов по разработанным материалам (не менее 2-х занятий в неделю...\nОпыт разработки сайтов на Python. Опыт преподавания детям как преимущество.",
        "company": "СИНЕРГИЯ"
    },
    {
        "title": "Автор работ по программированию Python",
        "url": "https://hh.ru/vacancy/71021487?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "1. Качественно выполнять студенческие работы (дипломные, курсовые, контрольные, рефераты и тд.). 2. Выполнять необходимые корректировки. 3. Соблюдать установленные сроки и...\n1. Умение работать с большими объемами информации. 2. Ответственность, умение распределять рабочее время и количество поставленных задач. 3. ",
        "company": "Homework"
    },
    {
        "title": "Разработчик Python (Senior)",
        "url": "https://hh.ru/vacancy/70688454?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка backend для web и мобильных приложений. Создание API.\nОпыт работы в коммерческой разработке от 2х лет ( Python, Django), уверенная работа с DRF. Опыт разработки API. ",
        "company": "Sitronics Group"
    },
    {
        "title": "Программист JavaScript, Python",
        "url": "https://hh.ru/vacancy/67607743?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка отдельных веб-приложений. Интеграция со сторонними сервисами.\nУмение пользоваться LINUX (обязательно базово). Знание JS или Python (обязательно). Знание ООП (обязательно). Умение пользоваться системой контроля версий TortoiseHg (будет...",
        "company": "ОООЕдиные Электронные Системы"
    },
    {
        "title": "Программист Python",
        "url": "https://hh.ru/vacancy/70481201?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка приложения с микросервисной архитектурой. Участие в анализе и решении задач по развитию архитектуры приложения.\nОпыт работы с Python (от 3-х лет). Знание одного из современных web frameworks Django/Flask/FastAPI. Знание SQL (PostgreSQL...",
        "company": "АОГринатом"
    },
    {
        "title": "Ведущий разработчик отдела интеграции (python)",
        "url": "https://hh.ru/vacancy/66071239?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Умение пользоваться стандартной документацией (нужной версии) python, Django и поиск возможных решений в поисковых системах. Использование и актуализация (при необходимости...\nУверенные знания и опыт работы с Python 3.5+, Git. Понимание многопоточного/многопроцессного программирования в Python. Умение работать с...",
        "company": "Группа компаний Астра"
    },
    {
        "title": "Python-разработчик (VK рекламные технологии)",
        "url": "https://hh.ru/vacancy/70531151?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка бэкендной части веб-интерфейса рекламной системы. Развитие API. Развитие системы обработки статистики. Оптимизация работы высоконагруженного проекта.\nОпыт разработки на Python ― от 2 лет. Отличное знание SQL. Знание основных сетевых web-протоколов, как минимум HTTP(S). ",
        "company": "VK, Рекламные технологии"
    },
    {
        "title": "Преподаватель направления «Разработка программного обеспечения Python» проекта Цифровая Кафедра",
        "url": "https://hh.ru/vacancy/70992774?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "...языке Python. ЦК-PY3. Базовые алгоритмы и структуры данных на языке Python. ЦК-PDA1. Программирование на Python для...\n...языка Python и особенностей работы с ним. Знание и умение применять на практике пакеты из стандартной библиотеки языка Python (os...",
        "company": "Санкт-Петербургский политехнический университет Петра Великого (ФГАОУ ВО СПбПУ)"
    },
    {
        "title": "Python Developer",
        "url": "https://hh.ru/vacancy/69537598?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка backend на Python. Проработка ETL. Взаимодействие с командами Data Science, DevOps и Frontend. Проектирование приложения и базы данных. \nОпыт разработки Backend на Python от 3х лет. Опыт работы с любым веб-фреймворком на Python (Flask, Django, Falcon...",
        "company": "ЕВРАЗ. ИТ-специалисты"
    },
    {
        "title": "Техлид/СТО/Fullstack developer на Python в стартап",
        "url": "https://hh.ru/vacancy/70773889?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Управление разработкой продукта. Формирование технических заданий для младших товарищей; контроль выполнения работ, проверки, правки и помощь при необходимости. \nВы умеете слушать и слышать, адекватно принимать конструктивные замечания по работе. Работа по дедлайнам.",
        "company": "Шамедько Анастасия"
    },
    {
        "title": "Тестировщик на Python, ReactJS",
        "url": "https://hh.ru/vacancy/70671227?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "выбор необходимых тест-кейсов и инструментов. - разработка средств автоматизации тестирования. - проведение автоматического и ручного тестирования. - поддержание в актуальном состоянии тестовой...\nопыт по созданию сценария тестирования. - основы: программирования, протокола HTTP, HTML и CSS. - умение работать с инструментами автоматического тестирования (например: python...",
        "company": "А-Контракт"
    },
    {
        "title": "Python Developer",
        "url": "https://hh.ru/vacancy/51099029?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать новые части системы (микросервисы, SOA). Проводить Code Review коллег. Покрывать написанный код тестами. Вести документирование технической части. \nПонимание специфики работы с потоками/процессами и асинхронностью в Python. Умение применять Docker в разработке. Умение анализировать поведение системы, работа...",
        "company": "ЕДИНЫЙ ЦУПИС"
    },
    {
        "title": "Senior Python Developer",
        "url": "https://hh.ru/vacancy/71196309?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Gather, address & implement technical and design requirements. Refactor existing applications to optimize their performance through setting the appropriate architecture and...\n...work experience as a Python Back-end Developer including at least 2 years of experience in Python Frameworks (Flask or...",
        "company": "Toughbyte"
    },
    {
        "title": "Преподаватель по программированию на языке Java, С++, Python",
        "url": "https://hh.ru/vacancy/54521200?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "...языка Java, С++, Python. Преподавателя с практическим опытом программирования. Для нас важно: Знание языка Java, С++, Python, практический опыт программирования...",
        "company": "ОООЦентр Автоматизации Бизнеса Форвард"
    },
    {
        "title": "Senior/Lead Python-разработчик",
        "url": "https://hh.ru/vacancy/71358498?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Задачи с высоким уровнем ответственности: предстоит проектировать архитектуру, реализовывать бизнес-логику, самостоятельно принимать решения, запускать сервисы с необходимым уровнем качества. \nГибкость: продукты Контура постоянно адаптируются под рынок и пользователей, нужно уметь работать в меняющихся условиях.",
        "company": "Контур"
    },
    {
        "title": "Python - разработчик (ALM 2.0 Динамическое моделирование баланса)",
        "url": "https://hh.ru/vacancy/71146280?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Осуществлять полный цикл разработки всех слоёв хранилища данных, начиная с ядра. Участвовать в составлении плана проекта, детализации, оценка проектных сроков...\nГлубокие знания ООП. Опыт программирования на Python. Опыт работы с экосистемой Hadoop (Hive, Spark, Parquet) приветствуется. Опыт работы с аналитическими...",
        "company": "Иннотех, Группа компаний"
    },
    {
        "title": "Senior Python developer (MLOps)",
        "url": "https://hh.ru/vacancy/69772933?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Помогать data scientist-ам с продакшн кодом. Налаживать инфраструктуру и выполнять отдельные небольшие задачи. Погружаться в архитектуру проекта и активно...\nKafka. MySQL. Airflow.",
        "company": "Wisebits"
    },
    {
        "title": "Data-analyst",
        "url": "https://hh.ru/vacancy/71232983?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Обрабатывать и анализировать пользовательские данные и продуктовые метрики, а также визуализировать результаты. Выявлять тенденции и закономерности в поведении пользователей, ошибки...\nУверенное знание SQL (оконные функции, оптимизация запросов, приветствуется опыт работы с ClickHouse), знание Python, включая библиотеки для анализа данных(numpy...",
        "company": "Employcity"
    },
    {
        "title": "Senior Python Developer (Django)",
        "url": "https://hh.ru/vacancy/70328122?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Самостоятельно декомпозировать задачи бэклога. Оценивать трудоемкость задач вместе с командой. Прорабатывать архитектуру, вносить вклад в развитие общих библиотек компании, интегрировать...\nОпыт разработки на Python (Go как плюс), опыт с Django Framework от 1,5 лет обязательно. Умение писать эффективный и...",
        "company": "Группа Самолет"
    },
    {
        "title": "Разработчик",
        "url": "https://hh.ru/vacancy/66529705?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Работа со стеком технологий: Python 3.x, Pytest, PostgreSQL 12+, JS/React 17, Ansible 2.9+. \nОпыт промышленной back-end разработки (Full-stack или опыт front-end будет плюсом). Хорошее знание языка Python, опыт промышленной разработки...",
        "company": "Скала^р"
    },
    {
        "title": "Разработчик баз данных и интеграционных сервисов (Middle)",
        "url": "https://hh.ru/vacancy/71103747?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка новых и оптимизация существующих SQL-запросов. Разработка интеграционных сервисов на Python, связанных с базой данных. Разработка отчетов по существующим...\nPython - на начальном уровне. Oracle - желательно. SQL, PL/SQL или pl/pgSQL - на хорошем уровне. Python - на начальном уровне. ",
        "company": "АОАйСи Сервис"
    },
    {
        "title": "Преподаватель компьютерных курсов для взрослых С++ ,С#, Python, JavaScript, г.Липецк",
        "url": "https://hh.ru/vacancy/70968230?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Весь методический материал уже есть, придумывать ничего не нужно!). Преподавание (лекционные и практические занятия) в группах до 16 человек в...\nВладение по отдельности или одновременно языками программирования: С++ ,С#, Python, JavaScript, HTML/CSS. - Ответственность, пунктуальность, желание делиться знанием и опытом. - ",
        "company": "Компьютерная Академия Top"
    },
    {
        "title": "Разработчик СУБД (C/Python)",
        "url": "https://hh.ru/vacancy/70030988?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Заниматься разработкой новой функциональности ядра СУБД Greenplum. Участвовать в разработке Open Source проекта Greenplum. Обеспечивать поддержку 3-го уровня (багфиксы...\nВладеете стандартами языка ANSI С. Имеете опыт системного серверного программирования. Знание Python будет плюсом. Имеете навыки работы с Git. ",
        "company": "ОООАренадата Софтвер"
    },
    {
        "title": "Python разработчик (Senior) (PT CERT)",
        "url": "https://hh.ru/vacancy/71119794?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Наша команда разрабатывает ПО, которое поможет наладить взаимодействие между государственными и коммерческими организациями. Их совместная работа касается сбора, хранения и...\nОпыт разработки на Python от 5 лет. - Опыт работы с реляционными СУБД (PostgreSQL). - Опыт работы с Docker. - Умение писать модульные...",
        "company": "Positive Technologies"
    },
    {
        "title": "Python-разработчик",
        "url": "https://hh.ru/vacancy/70872117?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка/поддержка API почтового решения и сервисов к нему.\nЗнание Python 3, Flask. Знание SQL, опыт работы с PostgreSQL. Знание ОС Linux. Английский язык на уровне чтения технической документации. ",
        "company": "МойОфис"
    },
    {
        "title": "DevOps engineer \\ Девопс инженер (удалённо)",
        "url": "https://hh.ru/vacancy/70230966?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Сопровождение инфраструктуры текущих проектов. Настройка и развитие CI\\CD процессов на базе GitLab. Автоматизация рутинных процессов. Консультирование разработчиков. \nОпыт автоматизации рутинных процессов на скриптовых языках bash/python/etc. Знание технологий виртуализации и контейнеризации, опыт работы с docker/docker...",
        "company": "FOXY WAY"
    },
    {
        "title": "Младший python-разработчик",
        "url": "https://hh.ru/vacancy/70798827?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Python-разработчику предстоит разрабатывать скрипты безопасности для сбора данных из различных средств защиты информации включая антивирусы, SIEM, DLP, IDS/IPS...\nЗнания/опыт работы с сетями. Опыт разработки на языке программирования Python от 1 года. Будет плюсом: Опыт сбора, анализа и...",
        "company": "Уральский центр систем безопасности"
    },
    {
        "title": "Python-разработчик",
        "url": "https://hh.ru/vacancy/69542170?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в разработке бэкенда веб-приложений на Django. Проверка, поддержка собственного кода, написание сопроводительной документации. Участие в планировании и обсуждении...\nУверенные знания языка Python. Опыт работы с фреймворком Django и DRF. Умение проектировать системы ориентированные на удобство front-end. ",
        "company": "ОООРед Софт"
    },
    {
        "title": "Senior Python/Django разработчик",
        "url": "https://hh.ru/vacancy/69542539?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проектировать и разрабатывать веб-приложения компании на Python / Django. Самостоятельно декомпозировать задачи бэклога. Оценивать трудоемкость задач вместе с командой. \nОпыт разработки на Python (Go как плюс), опыт с Django Framework от 2-3-х лет обязательно. Умение писать эффективный...",
        "company": "Группа Самолет"
    },
    {
        "title": "Аналитик данных",
        "url": "https://hh.ru/vacancy/70992003?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Выгрузка информации из ЕМИАС. Своевременное обеспечение помощников врачей базой пациентов для работы. Подготовка оперативной отчетности. Автоматизация отчетности. Сбор, оценка и...\nВысшее образование. Уверенное владение Python обязательно. Опыт работы в качестве аналитика/программиста от 1 года. Аналитический склад ума, ответственность.",
        "company": "ГБУ Кадровый центр ДЗМ"
    },
    {
        "title": "Python разработчик (Senior) (PT CERT)",
        "url": "https://hh.ru/vacancy/71119795?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Наша команда разрабатывает ПО, которое поможет наладить взаимодействие между государственными и коммерческими организациями. Их совместная работа касается сбора, хранения и...\nОпыт разработки на Python от 5 лет. - Опыт работы с реляционными СУБД (PostgreSQL). - Опыт работы с Docker. - Умение писать модульные...",
        "company": "Positive Technologies"
    },
    {
        "title": "Преподаватель компьютерных курсов для взрослых Python",
        "url": "https://hh.ru/vacancy/70515628?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Преподавание в виде практических занятий в группах до 16 человек в соответствии с учебными планами и материалами. - Участие в мероприятиях...\nОтветственность, пунктуальность, желание делиться знанием и опытом. - Знание или опыт работы в одной из предметных областей в сфере компьютерных технологий. - ",
        "company": "Компьютерная Академия Top"
    },
    {
        "title": "Аналитик (SQL, OLAP)",
        "url": "https://hh.ru/vacancy/71100433?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Подготовка регулярной отчетности. Работа с MS SQL (уверенный пользователь), Python (начальный уровень), OLAP (готовы обучить), DAX (готовы обучить ).\n...уровне базовых запросов. Готов нести ответственность и работать на результат. Готов к развитию в аналитической сфере. Навыки программирования в Python.",
        "company": "Hoff"
    },
    {
        "title": "Back-end developer (Python / Golang)",
        "url": "https://hh.ru/vacancy/70729806?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Dockerfile / Docker Compose. - Celery / Celery Beat, Flower. - Databases: Contact to email.\nUML diagrams. - Clean and understandable code, documenting your code, independence and analytical thinking, teamwork mindset. - Python Pandas, Apache Spark.",
        "company": "ОООQuanto Servicing"
    },
    {
        "title": "Backend (Python) разработчик",
        "url": "https://hh.ru/vacancy/70848875?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка Backend части коммуникационной платформы.\nОпыт веб-разработки на Python от 2-ух лет. Опыт работы с PostgreSQL и MongoDB. Опыт разработки REST API. ",
        "company": "Neuro.net"
    },
    {
        "title": "Ведущий инженер по автоматизированному тестированию (frontend)",
        "url": "https://hh.ru/vacancy/67611024?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддержка/доработка инструментов автоматизированного тестирования на языке Python. Развитие подходов к тестированию и участие в формировании методик. Интеграция инструментов автоматизированного...\nПонимание жизненного цикла ПО. Опыт разработки на Python. Опыт работы с Selenium. Практический опыт использования Linux окружения. Опыт работы с...",
        "company": "Netris"
    },
    {
        "title": "Senior Python developer",
        "url": "https://hh.ru/vacancy/71201935?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка комплекса информационных систем, призванного повысить эффективность операционной деятельности аэропорта путем качественного и своевременного прогнозирования и оптимизации потребностей в ресурсах. \nстатистики. Навыки применения оптимизационных алгоритмов. Опыт работы с библиотеками Python Pyomo, Pulp, SciPy.optimize. Опыт в обработке/очистке/подготовке данных. ",
        "company": "АОМеждународный аэропорт Шереметьево"
    },
    {
        "title": "Python разработчик",
        "url": "https://hh.ru/vacancy/70901326?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка сценарие/навыков для виртуальных ассистентов Сбера. Формирование технических требований к функциональности виртуальных ассистентов. Тестирование и отладка сценариев, работа с...\nОпыт коммерческой разработки на Python от 2-х лет. Уверенные знания алгоритмов и структур данных. Опыт производства чистого, документированного, высокопроизводительного...",
        "company": "Сбер. IT"
    },
    {
        "title": "Middle/Senior Python-разработчик в команду Добычи данных",
        "url": "https://hh.ru/vacancy/68116289?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Форматы, в которых мы получаем данные, многообразны: от хорошо документированных и структурированных REST API до заполняемых человеком Excel-файлов. \nЗнакомство с чем-то из списка выше, больше — лучше. Опыт парсинга — желательно сайтов. Опыт работы с ETL, AirFlow, PostGIS, ArcGIS...",
        "company": "2ГИС"
    },
    {
        "title": "Product Analyst",
        "url": "https://hh.ru/vacancy/70703010?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проверять гипотезы (формирование, тестирование, оценка результата). Составлять отчеты и анализировать динамику ключевых метрик продуктов. Разрабатывать метрики, которые помогут определять успех...\nПонимать, моделировать и анализировать LTV, ROI, ARPU, retention, churn и др. Опыт автоматизации процессов аналитики (Python/R). Умение проводить А...",
        "company": "KIVORK"
    },
    {
        "title": "Преподаватель Программирования",
        "url": "https://hh.ru/vacancy/71353535?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Ведение занятий и мастер-классов по программированию в Красногорском филиале «Инжинириум МГТУ им. Н.Э. Баумана». Подготовка обучающихся к различным...\nОконченное высшее образование или студенты старших курсов технических специальностей. ​Python: Знание базовых алгоритмов и структур данных, Python (все версии выше...",
        "company": "Инжинириум (ООО Инженеры Будущего)"
    },
    {
        "title": "Python-разработчик",
        "url": "https://hh.ru/vacancy/70709226?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработкой API. Интеграцией сторонних сервисов. Участием в полном цикле разработки - проектирование, программирование, тестирование, поддержка. Проводить код-ревью.\nОпыт производственной разработки в команде на Python 2 (scapy), Python 3 (aiohttp) от 1-года. Разработка на *nix + git. ",
        "company": "EPG Service"
    },
    {
        "title": "Senior Python Engineer (Flask, FastApi, Starlette)",
        "url": "https://hh.ru/vacancy/71065307?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка функционала на базе вендорского процессинга. Поддержка и развитие платежных продуктов на базе вендорского процессинга. Обеспечение интеграции с внешними инфосервисами...\nPython 3.6+. Понимание и использование асинхронности. Понимание мультипоточности. Владение следующими фреймворками: Flask, FastApi, Starlette. SQL Alchemy. ",
        "company": "Person Hunters, ООО"
    },
    {
        "title": "Data Аналитик",
        "url": "https://hh.ru/vacancy/71043973?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Анализ существующих процессов компании для оцифровки и автоматизации. Подключении/анализ новых источников данных. Создания ТЗ для витрин. Совместная и индивидуальная...\nУверенное владение MS Office c акцентом на MS Excel, MS PowerPoint. Знание/опыт работы на Python. Знание/опыт работы с...",
        "company": "АОAitas KZ"
    },
    {
        "title": "DevOps-инженер",
        "url": "https://hh.ru/vacancy/71240763?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проектирование, внедрение, развертывание и обслуживание инструментов и приложений, критически важных для нашей платформы SaaS и конвейера CI / CD. \nJenkins. Ansible. HashiCorp. Знание TeamCity, Gitlab CI, Jenkins. Опыт разработки на Java (опционально). ELK. HashiCorp (terraform, vault).",
        "company": "Swordfish Security"
    },
    {
        "title": "Разработчик на Python",
        "url": "https://hh.ru/vacancy/70752761?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддерживать актуальность меню всех ресторанов и магазинов. Создавать и отправлять по-настоящему большие отчёты. Повышать надёжность работы с заказами. \nПонимаете, когда нужна многопоточность, а когда — многопроцессность. Знакомы с хотя бы одной из современных СУБД (PostgreSQL, MongoDB или ClickHouse).",
        "company": "Яндекс"
    },
    {
        "title": "Senior Python Developer",
        "url": "https://hh.ru/vacancy/71399616?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать backend мобильного приложения HR. Совместно с Team Lead принимать архитектурные решения проекта. Осуществлять интеграции с ERP-системами компании. \nКоммерческий опыт на Python от 5 лет, общий опыт в backend разработке от 10 лет. Опыт работы с Django, DRF...",
        "company": "МАГНИТ, Розничная сеть"
    },
    {
        "title": "Разработчик Python, удаленно",
        "url": "https://hh.ru/vacancy/70854019?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддерживать существующий код. Адаптировать общие библиотеки под нужды продукта. Оптимизировать производительность. Разрабатывать новые модули для продукта, основанные на открытых библиотеках.\nПонимание процесса разработки ПО. Практический опыт в разработке Python от 2 лет. Знание GIT. Знание Gunicorn (Многопоточное программирование). ",
        "company": "САТЕЛ, Группа компаний"
    },
    {
        "title": "Разработчик баз данных (PostgreSQL, Python, PL/pgSQL, Bash)",
        "url": "https://hh.ru/vacancy/70522774?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "СУБД PostgreSQL (БД хранилища). Специализированные утилиты (ps1/bash-скрипты) экспорта данных из различных источников. Менеджер импорта данных в хранилище...\nВысшее техническое образование. Отличные знания и опыт работы с СУБД PostgreSQL, Python. Практический опыт разработки прикладных промышленных решений под управлением...",
        "company": "Сбер. IT"
    },
    {
        "title": "Python Senior developer",
        "url": "https://hh.ru/vacancy/70089376?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка backend/server-side для сайта на Python Django. Разработка масштабируемых высоконагруженных решений. Создание новых компонентов, модулей системы. \nОпыт работы с python обязателен. Умение быстро разбираться в чужом коде. Обязателен опыт работы с django. Опыт работы с реляционными...",
        "company": "Stroyportal.ru - интернет-площадка"
    },
    {
        "title": "QA Auto (Python)",
        "url": "https://hh.ru/vacancy/68682861?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Тестировать. Мы используем автоматизированное тестирование, но не боимся тестировать вручную если необходимо. Анализировать требования и прорабатывать тест-кейсы. \nЗнанием теории и методик тестирования. Опытом в автоматизации тестирования на Python. Знанием основ Linux/Unix. Имеет опыт работы с PostgreSQL. ",
        "company": "SberTech"
    },
    {
        "title": "Senior Python developer",
        "url": "https://hh.ru/vacancy/70911557?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Взаимодействие с командой из США (ежедневные созвоны).\n5+ лет опыта разработки. Опыт работы с Python от 3-х лет. Уверенное знание реляционных БД. Участие в крупном...",
        "company": "Nitka Technologies"
    }
]