[
    {
        "title": "Разработчик C++ (релокация в Dubai)",
        "url": "https://hh.ru/vacancy/70893089?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка алгоритмов управления роботизированной системой, разработка вспомогательных инструментов для наладки, тестирования и диагностики роботизированных систем, написание тестов различного уровня.\nПлюсом будет: Знание или готовность освоить nodejs и python для написания простых вспомогательных скриптов. Знание или готовность освоить docker. ",
        "company": "R2CMarket"
    },
    {
        "title": "Python разработчик (backend)",
        "url": "https://hh.ru/vacancy/69853369?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "...и отвечать за интеграции между различными моделями прогнозирования и автоматизированными системами банка. Участвовать в разработке и опромышливании ML-моделей (Python).\nПрофильное высшее техническое или математическое образование. Не менее 1 года работы c python. Понимать и уметь использовать методологию Devops. ",
        "company": "Сбер для экспертов"
    },
    {
        "title": "Data Scientist",
        "url": "https://hh.ru/vacancy/70519282?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Обработка больших данных как структурированных, так и неструктурированных (видео, изображения, текст, таблицы) c помощью методов ML и нейронных сетей. \nЗнание математической статистики и теории вероятностей. Знание алгоритмов машинного обучения, знания Python, библиотеки ML. Опыт структурирования данных, подготовки данных для...",
        "company": "Сбер для экспертов"
    },
    {
        "title": "Разработчик DevOps - Отдел роботизации процессов, внедрения мобильных ботов и технологии реальности",
        "url": "https://hh.ru/vacancy/70744075?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Развертывание и поддержка ОС, сервисов, роботов, платформ для разработки и вспомогательного ПО. Взаимодействие со смежными отделами. Работа c командой.\nУмение отстаивать свою точку зрения. Понимание CI/CD. Желательно, но не обязательно: работа с Gitlab, Jenkins, Docker, PostgreSQL, Prometheus, Python.",
        "company": "ТООBusiness and Technology Services"
    },
    {
        "title": "Team lead, Data Scientist (команда Скоринг партнерств и платформы больших данных)",
        "url": "https://hh.ru/vacancy/68650334?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Построение моделей на основе временных рядов. Построение моделей на графах. Построение look-alike моделей. Задачи по работе с текстом, табличными...\nНаличие управленческого опыта или опыта наставничества. Хорошее знание Python. Понимание и опыт Classic ML. Знание SQL и умение делать запросы...",
        "company": "Банк ВТБ (ПАО)"
    },
    {
        "title": "Разработчик сетевого ПО / BackEnd",
        "url": "https://hh.ru/vacancy/70868927?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка backend и серверной части для проектов VPN, TON Site, Игровой портал: - Активно участвовать в процессе разработки, начиная с планирования...\nСвободное знание C/C++. 10. Базовые навыки программирования на bash/python: управление оборудованием по SSH/REST API; сбор, обработка и...",
        "company": "ИПШаповалов Сергей Андреевич"
    },
    {
        "title": "Devops инженер",
        "url": "https://hh.ru/vacancy/70675891?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка архитектуры инфраструктурной части проекта. Построение и поддержка процессов CI/CD. Внедрение и сопровождение высоконагруженных сервисов. Выполнение задач по повышению...\nПонимание сетевых протоколов, принципов построения высоконагруженных и отказоустойчивых систем. Знание bash/sh/python, умение писать рабочие скрипты. Опыт работы с...",
        "company": "ОООТеории от практиков"
    },
    {
        "title": "Python Разработчик",
        "url": "https://hh.ru/vacancy/70907292?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Доработка и разработка микросервисов на DRF. Поддержка существующих проектов и решений. Интеграция с существующей инфраструктурой.\nТребования: Реальный практический опыт разработки программных систем. Реальный опыт работы с Python. Плюсом будет PHP / .NET / Java / Go. ",
        "company": "ТООEncom Systems Technology"
    },
    {
        "title": "Python developer (Senior)",
        "url": "https://hh.ru/vacancy/54956212?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработкой архитектуры, поддержкой, развитием и оптимизацией проектов. Проектированием и развитием архитектуры баз данных. Разработкой новой функциональности и улучшением имеющейся. \nОтличные знания Python. Высокий уровень знаний Django. Разнообразный опыт работы с asyncio, aiohttp. Большой опыт разработки высоконагруженных и распределенных систем. ",
        "company": "ОООВайт Код"
    },
    {
        "title": "Разработчик Solidity/Разработчик Rust/Разработчик Go/Разработчик python(удаленно)",
        "url": "https://hh.ru/vacancy/48457284?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проектировать, кодировать и внедрять бизнес‐приложения. Интегрировать блокчейны с нашей платформой. Работа с API и микросервисами. Разработка и проверка криптографических...\nSolidity (от 3‐х лет) или Rust (от 3‐х лет) или Go (от 3-х лет) или Python(от...",
        "company": "ArtVolkov.ru"
    },
    {
        "title": "Junior Программист/Разработчик Python",
        "url": "https://hh.ru/vacancy/70722660?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка, тестирование, отладка и поддержка кросс-платформенных (x86/ARM) приложений на Python.\nЗнание английского языка достаточное для чтения технической документации. Опыт разработки приложений на Python/Qt/C++/C#. Желателен опыт работы с.",
        "company": "ОООТелеком-Инжиниринг"
    },
    {
        "title": "Программист-разработчик (Python)",
        "url": "https://hh.ru/vacancy/70842180?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка приложений на языке Python, включая основанные на Python фреймфорки в срок, определенный в плане проекта и с должным качеством...\nУровень разработчика – сильный junior или middle разработчик Python 3. Навыки работы с фреймфорком django.",
        "company": "Телекоммуникационная Компания Телезон"
    },
    {
        "title": "Python developer (Middle)",
        "url": "https://hh.ru/vacancy/67856203?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддержкой, развитием и оптимизацией проектов. Проектированием и развитием архитектуры баз данных. Разработкой новой функциональности и улучшением имеющейся. Связкой backend и...\nХорошие знания Python. Хорошие знания Django. Опыт работы с asyncio, aiohttp. Опыт разработки высоконагруженных систем. Большой опыт работы с SQL...",
        "company": "ОООВайт Код"
    },
    {
        "title": "Разработчик C# / Python",
        "url": "https://hh.ru/vacancy/54951058?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка систем анализа, обработки и визуализации данных, в т.ч. Big data. Автоматизация бизнес-операций и интеграция с текущими процессами.\nОпыт разработки приложений на базе С# под .NET Core от 3 лет. Опыт работы с Python 3 (numpy, pandas, sklearn...",
        "company": "ОООАйти Прайм"
    },
    {
        "title": "Разработчик (Backend developer / Python)",
        "url": "https://hh.ru/vacancy/70871208?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Python на бэкенде, взаимодействие через GraphQL и REST API. SPA на Vue.js + Typescript на фронте и Quasar как библиотека...\nОпыт работы от 1,5 лет и знание: PostgreSQL, MongoDB, REST API, GraphQL, Git. Знание языка Python (3.9, Flask...",
        "company": "ОООСтатус"
    },
    {
        "title": "Data Analyst (Remote)",
        "url": "https://hh.ru/vacancy/70449444?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участвовать в разработке, внедрении и поддержке data-driven процессов в продуктовых командах. Разрабатывать и поддерживать дашборды и системы метрик. \nГлубокое понимание продуктовых и бизнес-метрик. Знание Python/R и соответствующих фреймворков для работы с данными (предпочтительно Python, бекенд на...",
        "company": "Novakid Inc"
    },
    {
        "title": "Python разработчик",
        "url": "https://hh.ru/vacancy/70692749?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "...придется читать) на Python (у нас 3.8). Участие в дальнейшей поддержке и развитии продукта на Python. Оценка, декомпозиция задач. \nОт 3 лет опыта разработки на Python 3. Опыт работы с асинхронными фреймворками. Опыт работы с микросервисной архитектурой и монолитом. ",
        "company": "Ассоциация IPChain"
    },
    {
        "title": "Middle+ Python developer Web3",
        "url": "https://hh.ru/vacancy/70894549?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "SQL. Умеет работать с Git. Понимает принципы написания безопасного кода. Готов быстро погружаться в область Web 3.0, DeApp, DeFi. ",
        "company": "Remokate"
    },
    {
        "title": "Программист Python, удаленно",
        "url": "https://hh.ru/vacancy/69908838?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка внутренних R&D проектов компании (Natural Language Understanding, интеграция ML моделей, MRCP Asterisk Plugin и другие). Участие в разработке...\nОпыт работы с медиапротоколами (MRCP/RTP/SDP/SIP). Опыт написания C-расширений для Python. Опыт работы с технологиями машинного обучения...",
        "company": "Кадровое агентство ЕВА"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/70423235?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка серверной части (Python,Django). Проектирование и разработка новой бизнес логики на уровне СУБД PostgreSQL \\ MS SQL. Оптимизация SQL-запросов. \nТребования: Отличное знание SQL\\T-SQL\\PLPGSQL, опыт не менее 2 лет. Опыт разработки Python от 2 лет. Знание ООП. ",
        "company": "ОООКомпания Дилявер"
    },
    {
        "title": "Python Developer",
        "url": "https://hh.ru/vacancy/70847956?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать web-приложения с использованием Python. Проектировать и разрабатывать масштабируемые приложения с использованием современных подходов и фреймворков. Участвовать в собеседованиях...\nОтличные знания и опыт разработки на Python. Хорошие знания Django, Django rest framework, docker, docker-compose. Хорошее понимание клиент-серверной...",
        "company": "Innowise Group / Фабрика инноваций и решений"
    },
    {
        "title": "Data Scientist (Удаленная работа)",
        "url": "https://hh.ru/vacancy/69594028?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Построение моделей оценки кредитного риска. Валидация моделей. Подготовка данных для валидации, моделирования и калибровки моделей. Участие в количественных исследованиях. \nОпыт работы в роли Data Scientist/Аналитик данных от 1 года и выше. Опыт программирования на языке Python. ",
        "company": "JetLend"
    },
    {
        "title": "Разработчик Python, удаленно",
        "url": "https://hh.ru/vacancy/70854019?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддерживать существующий код. Адаптировать общие библиотеки под нужды продукта. Оптимизировать производительность. Разрабатывать новые модули для продукта, основанные на открытых библиотеках.\nПонимание процесса разработки ПО. Практический опыт в разработке Python от 2 лет. Знание GIT. Знание Gunicorn (Многопоточное программирование). ",
        "company": "САТЕЛ, Группа компаний"
    },
    {
        "title": "Python-разработчик",
        "url": "https://hh.ru/vacancy/70899389?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддерживать существующие и разрабатывать новые бэкенд-сервисы, использующие ML-модели. Заниматься оптимизацией производительности существующих и разрабатываемых сервисов. Проектировать архитектуру разрабатываемых...\nИмеете качественный опыт написания кода на python. Работаете с golang (в качестве преимущества). Свободно владеете linux (bash, sed, grep и...",
        "company": "Иви"
    },
    {
        "title": "Linux Backend Developer",
        "url": "https://hh.ru/vacancy/67381872?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Написание и модификация существующего кода на C/C++/Python/Bash по интеграции Linux-сервисами. Сборка, и выпуск продукта в виде...\n2+ года разработки системного ПО под Linux на C/C++ (STL, Boost) или Python. Базовые навыки администрирования и средств...",
        "company": "Plesk"
    },
    {
        "title": "Python-разработчик (backend)",
        "url": "https://hh.ru/vacancy/70203352?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка новых продуктов на языке python. Взаимодействие с мобильным приложением со стороны backend. Интеграция системы с другими внутренними проектами. \nОпыт Python от 2-3 лет. Умение выбирать оптимальный стек под продукт/задачу, работать с легковесными фреймворками. Опыт работы в...",
        "company": "билайн: ИТ, Data, Digital"
    },
    {
        "title": "SRE/Системный администратор Linux",
        "url": "https://hh.ru/vacancy/70857671?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Администрирование инфраструктуры. Траблшутинг. Управление мониторингами качества работы проектов. Реакция на инциденты и последующий анализ. Работа с Kubernetes.\nЗнание ЯП на уровне скриптов. Ngnix. Linux от 3-х лет. Ansible.",
        "company": "HR Prime"
    },
    {
        "title": "Data scientist",
        "url": "https://hh.ru/vacancy/69724262?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Работа в команде по созданию модуля Data Science & AI, отвечающего за обработку данных, консолидированных в хранилище, и интеллектуальное обеспечение различных...\nЗнание основных алгоритмов и метрик машинного обучения. Ключевые навыки: Python, SQL, ML. Практические навыки работы с рекомендательными системами: знание архитектур...",
        "company": "Астор"
    },
    {
        "title": "Python разработчик",
        "url": "https://hh.ru/vacancy/51112764?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка и совершенствование сервисов ядра платформы. Разработка алгоритмов и методов процессинга данных. Разработка инструментов для команды аналитиков и ML-инженеров. \nОпыт профессиональной разработки Python/Scala/Java. Дополнительное образование в ML – специальные курсы по машинному обучению, анализу данных. Опыт разработки микросервисов. ",
        "company": "КОМПЛИТ"
    },
    {
        "title": "Python Developer",
        "url": "https://hh.ru/vacancy/70890626?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Наставление менее опытных коллег.\nОтличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ",
        "company": "Тинькофф"
    },
    {
        "title": "Специалист-математик (data science)",
        "url": "https://hh.ru/vacancy/70741730?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Мы компания-разработчик ПО для промышленности – с помощью, математики, статистки и науки о данных оптимизируем технологические процессы на обогатительных фабриках. \nОпыт работы с одним из скриптовых языков для исследований (R\\Python). Опыт работы с СУБД, например PostgreSQL, MS SQL, Oracle...",
        "company": "ОООБелка Диджитал"
    },
    {
        "title": "Data Analyst (Аналитик)",
        "url": "https://hh.ru/vacancy/70165043?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проводить разведочный анализ данных (EDA). - Проводить исследования и аналитические разборы. - Формирование срезов данных для построения отчетов. - Построение моделей данных. - \nОбщие аналитические навыки, критическое мышление, внимание к деталям, опыт работы с большим количеством информации. - Продвинутый пользователь Excel (Power Query, Power...",
        "company": "ОООНЬЮЭРАМЕДИА"
    },
    {
        "title": "Python Django разработчик, удаленно",
        "url": "https://hh.ru/vacancy/70588587?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Успешный кандидат будет участвовать в команде разработки нового функционала и проектах кастомизации функционала для клиентов. Полная занятость, полный день. \n3+ лет Python/Django на бэкенде с подтвержденным \"боевым\" опытом. Желательно опыт frontend: React. Опыт управления командой будет большим...",
        "company": "эдмин"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/70858530?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка back-end решений в международном проекте. Работа со стеком технологий: Python 3.6, PostgreSQL, SQLAlchemy, Celery, Rabbitmq, Redis, Buildout...\nВысшее образование. Опыт промышленной разработки на Python от 4-х лет. Опыт работы с современными инструментами разработки: JIRA, github и...",
        "company": "Кадровый холдинг ПРОФИЛЬ"
    },
    {
        "title": "Team Lead Python",
        "url": "https://hh.ru/vacancy/70685901?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Системный интегратор, с акцентом на государственные проекты, в том числе и коммерческие. - Работаем преимущественно с новыми проектами, с минимальной поддержкой...\nВ фазе активного роста с 2019 года. - Отличное знание технологий: Python 3.8 на Django, FastApi, Typescript, PostgreSQL, Tarantool, Nuxt.js...",
        "company": "Дартс рекрутинг сервисез"
    },
    {
        "title": "Аналитик данных (data analyst / data scientist)",
        "url": "https://hh.ru/vacancy/70852713?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Прогнозирование спроса, построение предиктивных, оптимизационных моделей, алгоритмы на Python, статистический анализ. Ведение и оптимизация отчетности, расчет мотиваций. Выполнение AdHoc запросов...\nЗнание экономико-математических методов прогнозирования и анализа данных. Опыт работы с Python, SQL. Знание Excel на уровне эксперта, DAX – как...",
        "company": "ОООБристоль, сеть магазинов"
    },
    {
        "title": "АККРЕДИТОВАННАЯ КОМПАНИЯ Программист Python (прикладная математика)",
        "url": "https://hh.ru/vacancy/48411370?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Мы предоставляем услуги web-разработки, мобильной разработки, десктопной разработки, разработки в области data science, проектирования, тестирования и создания графического дизайна. - \nЗнания и опыт разработки Python (2 или 3, знание отдельных версий и понимание различий приветствуется). Опыт работы с различными научными...",
        "company": "ЗАЗЕКС"
    },
    {
        "title": "Python Developer",
        "url": "https://hh.ru/vacancy/69776722?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проектировать API для доступа к функциональности платформы (дорабатывать ее, реализовывать новые фичи). Оптимизировать процесс разработки, тестирования и тд. \nОпыт работы с Python (Django) от 3х лет. Понимание принципов построения ПО. Понимание SOLID. Знание и умение общаться на...",
        "company": "Remokate"
    },
    {
        "title": "Data Analyst (Remote)",
        "url": "https://hh.ru/vacancy/70449443?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участвовать в разработке, внедрении и поддержке data-driven процессов в продуктовых командах. Разрабатывать и поддерживать дашборды и системы метрик. \nГлубокое понимание продуктовых и бизнес-метрик. Знание Python/R и соответствующих фреймворков для работы с данными (предпочтительно Python, бекенд на...",
        "company": "Novakid Inc"
    },
    {
        "title": "Разработчик C++",
        "url": "https://hh.ru/vacancy/69205889?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка алгоритмов управления роботизированной системой, разработка вспомогательных инструментов для наладки, тестирования и диагностики роботизированных систем, написание тестов различного уровня. \nУверенное владение письменным английским языком. Знание или готовность освоить nodejs и python для написания простых вспомогательных скриптов. Знание или готовность...",
        "company": "R2CMarket"
    },
    {
        "title": "Инженер-программист Python",
        "url": "https://hh.ru/vacancy/67029599?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Диагностировать проблем и исправлять баги в инфраструктуре клиентов. Добавлять исправления обнаруженных багов в основной код продукта. Заниматься обучением инженеров технической...\nПонимание сетевых протоколов, модели OSI, протоколов прикладного уровня (HTTP, TLS, FTP, SMB). Опыт разработки на python или желание перейти из...",
        "company": "ОООАйдеко"
    },
    {
        "title": "Python Developer",
        "url": "https://hh.ru/vacancy/70868484?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "разрабатывать кастомные плагины для этих редакторов. - разрабатывать плагины глубокой интеграции различных веб-сервисов. - разрабатывать и улучшать микросервисы компании. - \nуверенное знание Python 3. - знание структур данных Python, алгоритмов работы с ними. - следование принципам DRY, SOLID. - умение писать чистый, понятный...",
        "company": "ICVR"
    },
    {
        "title": "Программист Python",
        "url": "https://hh.ru/vacancy/70792116?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Наш продукт повышает эффективность работы сотрудников технической поддержки за счет быстрой и удобной работы с обращениями, анализа нагрузки на сотрудников...\nУверенное знание чистого Python. Хорошее знание SQL. Владение БД. Умение и желание писать качественный, поддерживаемый и документированный код.",
        "company": "Тензор"
    },
    {
        "title": "ML C++ разработчик",
        "url": "https://hh.ru/vacancy/70815371?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Реализация и поддержка функционала для стека технологий LTE (Uplink Power Control, Carrier Aggregation и так далее) с применением машинного обучения.\nЗнание C/C++ на высоком уровне (не ниже middle) в контексте Machine Learning. Опыт работы с крупными проектами в команде...",
        "company": "TQB Russia"
    },
    {
        "title": "Backend-разработчик",
        "url": "https://hh.ru/vacancy/68729729?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Знание Python 3. Уверенная работа с СУБД и SQL. Опыт разработки серверного приложения. Опыт работы с backend на python от...",
        "company": "Веб Крафт"
    },
    {
        "title": "Data Analyst - NLP (to Canada/Serbia)",
        "url": "https://hh.ru/vacancy/70138595?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Build data-driven and ML-based compliance / conduct solutions in Python. Work on production applications. Refine internal tools and automations. \nFirst-hand experience in analyzing and adjusting ML models performance. Python development, preferably related to ML or NLP (sklearn, pandas...",
        "company": "Behavox"
    },
    {
        "title": "Программист Python",
        "url": "https://hh.ru/vacancy/70914688?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Написание новых и поддержка существующих веб-сервисов. Проработка архитектурных решений с командой. Подготовка сервисов к релизу. Взаимодействие с командой devops. \n...Python от 3 лет. Понимание что такое High availability, CAP, ACID. Важно понимание работы современных асинхронных web-фреймворков в python...",
        "company": "Ventra"
    },
    {
        "title": "Backend-разработчик Python middle+ / senior",
        "url": "https://hh.ru/vacancy/69733791?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Startup с ресурсами крупного энтерпрайза: экспертиза, финансовая поддержка и сильная менеджерская команда. Чтобы быть лучшими, мы используем много данных и...\nОпыт разработки комплексных приложений на языке Python 3 с использование аннотацией типов. - Понимание принципов SOLID и Clean architecture. - ",
        "company": "БАРАНКА"
    },
    {
        "title": "Руководитель группы разработки (Python)",
        "url": "https://hh.ru/vacancy/70860609?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Роль: 75% управление бекэнд разработкой, 25% - кодинг. Проект: приложение для застройщика, в котором реализованы сервисы управляющей компании, оплата счетов, наблюдение...\nзнание методологий управления проектами и методологий гибкой разработки. (Hard Skills): - уверенное знание Python. - фундаментальные знания в области информационных технологий. - ",
        "company": "Mintrocket"
    },
    {
        "title": "Программист Python (Middle+)",
        "url": "https://hh.ru/vacancy/70083465?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Backend: Python 3.8, Django. Базы данных: PostgreSQL, Redis, TimescaleDB, InfluxDB. Frontend: React/Vue. Контейнеризация: Docker, k8s. \nУверенное знание Web-технологий, стремление к расширению IT-кругозора. Уверенное знание Python, Django, ORM, REST Framework, Celery, UnitTest, Docker, OpenAPI. ",
        "company": "ОООПиклема"
    },
    {
        "title": "Middle Python developer (Сочи)",
        "url": "https://hh.ru/vacancy/70824756?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка back-end части (в основном). Доработки front-end части.\nКоммерческий опыт разработки на Python. Уверенное знание одного из web фреймворков (Django, Flask, FastAPI). Опыт работы с бд через ORM...",
        "company": "ОООКолл-Тулз"
    },
    {
        "title": "Программист Python",
        "url": "https://hh.ru/vacancy/70852079?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "...Linux (С/С++),Python. - Разработка драйверов устройств для ОС GNU/Linux. - Поддержка ранее разработанного ПО (С/С++,Python). - \nОпыт работы не менее 2-х лет. - Знание языков программирования C/С++;Python. - Опыт использования встраиваемых операционных систем, встраиваемых файловых...",
        "company": "Team4You"
    },
    {
        "title": "Python Developer",
        "url": "https://hh.ru/vacancy/54936646?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поработать над моделью предсказания вероятности ДТП в сервисе для расчета цены ОСАГО. Улучшать и разрабатывать парсеры (миллионы запросов в день...\nОпыт коммерческой разработки на Python. Понимание микросервисной архитектуры. Умение работать с асинхронным кодом. Знание Linux, умение работать с Git, опыт...",
        "company": "SpectrumData"
    },
    {
        "title": "Программист-разработчик Python",
        "url": "https://hh.ru/vacancy/70845944?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка архитектуры новых проектов и технологических решений. Разработка back-end и front-end компонентов. Осуществлять интеграции с существующими компонентами проектов. \nОпыт разработки на Python, знание ООП. Опыт разработки задач асинхронного программирования. Опыт разработки REST архитектуры и API. Знакомство/опыт разработки...",
        "company": "Группа Ремедиум"
    },
    {
        "title": "Python Team Lead / Руководитель backend разработки (в аккредитованную ИТ компанию)",
        "url": "https://hh.ru/vacancy/48216332?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Управление командой разработчиков. В начале придется тоже покодить, в дальнейшем можно будет выстроить систему так, что нужно будет только лидовать. \nОпыт разработки Python (2.7/3) – от 2 лет. Знание SQL – MySQL или PostgreSQL. Уверенный пользователь *nix. Опыт работы с...",
        "company": "GRI"
    },
    {
        "title": "Backend разработчик (Python)",
        "url": "https://hh.ru/vacancy/67764198?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в разработке бэкенда облачного сервиса.\nУверенные знания python3.6 (желателен опыт от 2 лет). Опыт работы с Flask/Django. Опыт работы с Celery/RabbitMQ. ",
        "company": "АОИОТ"
    },
    {
        "title": "Руководитель группы разработки (Python)",
        "url": "https://hh.ru/vacancy/70860617?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Роль: 75% управление бекэнд разработкой, 25% - кодинг. Проект: приложение для застройщика, в котором реализованы сервисы управляющей компании, оплата счетов, наблюдение...\nзнание методологий управления проектами и методологий гибкой разработки. (Hard Skills): - уверенное знание Python. - фундаментальные знания в области информационных технологий. - ",
        "company": "Mintrocket"
    },
    {
        "title": "Младший python-разработчик",
        "url": "https://hh.ru/vacancy/70798827?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Python-разработчику предстоит разрабатывать скрипты безопасности для сбора данных из различных средств защиты информации включая антивирусы, SIEM, DLP, IDS/IPS...\nЗнания/опыт работы с сетями. Опыт разработки на языке программирования Python от 1 года. Будет плюсом: Опыт сбора, анализа и...",
        "company": "Уральский центр систем безопасности"
    },
    {
        "title": "Game Analyst (игровой аналитик)",
        "url": "https://hh.ru/vacancy/69669726?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проведение исследований по монетизации, вовлеченности игроков, игровому балансу по запросам отдела гейм-дизайна. Поиск точек роста на проекте. \nОпыт работы аналитиком данных от 1 года. Владение Python для ежедневной работы. Опыт работы с библиотеками (pandas, numpy). ",
        "company": "Gear Games"
    },
    {
        "title": "Руководитель группы разработки (Python)",
        "url": "https://hh.ru/vacancy/70860612?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Роль: 75% управление бекэнд разработкой, 25% - кодинг. Проект: приложение для застройщика, в котором реализованы сервисы управляющей компании, оплата счетов, наблюдение...\nзнание методологий управления проектами и методологий гибкой разработки. (Hard Skills): - уверенное знание Python. - фундаментальные знания в области информационных технологий. - ",
        "company": "Mintrocket"
    },
    {
        "title": "Python Developer",
        "url": "https://hh.ru/vacancy/69910421?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "...сервисов, которые парсят соц. сети, размещают заказы и забрать часть сервисов, которые написаны на PHP и реализовать их на Python.\nPython 3, CURL, MySQL, Redis, Threading, Multiprocessing, Debian. Обязательно: Git, MySQL: умение оптимизированные запросы, понимание принципов ООП, умение работать с...",
        "company": "Perfect Panel"
    },
    {
        "title": "Python разработчик",
        "url": "https://hh.ru/vacancy/69847783?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка ПО сбора данных с измерительных приборов (шумомеров, станций приема данных ADS-B, метеостанций, дополнительных датчиков и сенсоров позволяющих контролировать...\n...качестве Python-разработчика не менее 2-x лет. Уверенное владение стеком технологий для разработки программного обеспечения на основе Python 3. ",
        "company": "ОООЦентр экологической безопасности гражданской авиации"
    },
    {
        "title": "Python/С++ разработчик",
        "url": "https://hh.ru/vacancy/70861198?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Опыт коммерческой разработки от 2 лет. Уверенные знания C++/Python. Понимание принципов ООП. Опыт работы с PostgreSQL: построение оптимальных sql...",
        "company": "Тензор"
    },
    {
        "title": "Младший разработчик",
        "url": "https://hh.ru/vacancy/70572202?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Работа со стеком технологий: Python 3.x, Pytest, PostgreSQL 12+, JS/React 17, Ansible 2.9+. \nОпыт промышленной back-end разработки (Full-stack или опыт front-end будет плюсом). Хорошее знание языка Python, желателен опыт промышленной...",
        "company": "Скала^р"
    },
    {
        "title": "Middle Python Developer",
        "url": "https://hh.ru/vacancy/68555478?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать микросервисы и участвовать в проектировании и создании высоконагруженного сервиса. Участвовать в проектировании архитектуры системы. Делать интеграции с внешними сервисами...\nИмеешь опыт продуктовой разработки на Python (Flask, FastAPI) от 2-3 лет. Работал с SQL/NoSQL базами данных. ",
        "company": "ООО«Инносети»"
    },
    {
        "title": "Senior Python Developer",
        "url": "https://hh.ru/vacancy/67488072?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка игрового портала и других веб-приложений, с которыми взаимодействует пользователь. Поддержка и развитие существующей инфраструктуры сервисов. Разработка высоконагруженных backend...\nОпыт разработки для Web. Уверенные знания языка программирования Python. Опыт работы с MySQL. Знание фреймворка FastAPI, либо других современных фреймворков...",
        "company": "Lesta Games"
    },
    {
        "title": "Python Django разработчик, удаленно",
        "url": "https://hh.ru/vacancy/70588586?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Успешный кандидат будет участвовать в команде разработки нового функционала и проектах кастомизации функционала для клиентов. Полная занятость, полный день. \n3+ лет Python/Django на бэкенде с подтвержденным \"боевым\" опытом. Желательно опыт frontend: React. Опыт управления командой будет большим...",
        "company": "эдмин"
    },
    {
        "title": "Middle Python разработчик (Django)",
        "url": "https://hh.ru/vacancy/67115536?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Приветствуем вовлеченность разработчиков в бизнес, а не просто написание кода по ТЗ. Ценим готовность брать ответственность и делиться опытом с...\nВозможность напрямую влиять на продукт и принимать технические решения. Опыт разработки на Python3. Опыт работы с Django. ",
        "company": "МедРокет"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/70786117?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка серверных приложений на Python. Разработка новой функциональности. Разработка архитектуры. Написание unit-тестов. Оптимизация и рефакторинг кода. Ревью кода.\nОпыт разработки Backend на Python от 3х лет. Опыт работы с любым веб-фреймворком на Python (Flask, Django, Falcon...",
        "company": "Stroki"
    },
    {
        "title": "Python-разработчик",
        "url": "https://hh.ru/vacancy/69542170?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в разработке бэкенда веб-приложений на Django. Проверка, поддержка собственного кода, написание сопроводительной документации. Участие в планировании и обсуждении...\nУверенные знания языка Python. Опыт работы с фреймворком Django и DRF. Умение проектировать системы ориентированные на удобство front-end. ",
        "company": "ОООРед Софт"
    },
    {
        "title": "Python Backend разработчик/программист",
        "url": "https://hh.ru/vacancy/70793284?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка и поддержка существующего проекта. Внедрение нового функционала в проект. Работа над новыми проектами.\nОпыт работы c Python. Опыт написания REST API. Знание одного из фреймворков (flask, django, fastapi) и желание познакомиться с остальными. ",
        "company": "ОООГуру Групп"
    },
    {
        "title": "ML C++ разработчик",
        "url": "https://hh.ru/vacancy/70815370?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Реализация и поддержка функционала для стека технологий LTE (Uplink Power Control, Carrier Aggregation и так далее) с применением машинного обучения.\nЗнание C/C++ на высоком уровне (не ниже middle) в контексте Machine Learning. Опыт работы с крупными проектами в команде...",
        "company": "TQB Russia"
    },
    {
        "title": "Middle Python Developer (микросервисная архитектура)",
        "url": "https://hh.ru/vacancy/70801212?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Доработка и разработка микросервисов на DRF. Поддержка существующих проектов и решений. Интеграция с существующей инфраструктурой. Готовность изучать новые технологии.\nРеальный практический опыт разработки программных систем. Реальный опыт работы с Python. Плюсом будет PHP / .NET / Java / Go. Понимание принципов микросервисных...",
        "company": "ОООБаксэт"
    },
    {
        "title": "Senior Python разработчик",
        "url": "https://hh.ru/vacancy/70850553?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в митапах и возможность публикации в профильных СМИ.\nБазовые знания алгоритмов и структур данных. Опыт работы с Python от 3ех лет. Уверенный пользователь Linux, bash. ",
        "company": "Xello"
    },
    {
        "title": "Стажер-аналитик (большие данные)",
        "url": "https://hh.ru/vacancy/70704887?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Задача аналитиков — извлекать из данных смысл и помогать командам принимать правильные решения. Этим и занимаются стажёры, которых интересует аналитика. \nЗнание математической статистики. Python. Приветствуются: Знание английского языка на уровне чтения технической литературы. Опыт применения машинного обучения.",
        "company": "Яндекс"
    },
    {
        "title": "Python Backend Developer",
        "url": "https://hh.ru/vacancy/70803033?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка backend’а высоконагруженных проектов (ccu до 80 тыс. в минуту). Работа с новыми игровыми фичами и игровыми механиками. \nОпыт работы над высоконагруженными проектами. Уверенные знания Python. Опыт работы с микрофреймворками (Falcon, Flask). Умение работать с базами данных как...",
        "company": "ОООЛАЙТ МЭП"
    },
    {
        "title": "Junior Backend Test Engineer",
        "url": "https://hh.ru/vacancy/70820888?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Автоматизация тестирования. Разработка автоматических тестов, в том числе возможно участие в написании стресс-тестов. Анализ биржевых спецификаций и данных, анализ...\nОпыт программирования на Python. Знание сетей и сетевых протоколов. Опыт работы c TCP/IP стеком в Python (gevent/socket/asyncio...",
        "company": "CQG"
    },
    {
        "title": "Python/Django разработчик",
        "url": "https://hh.ru/vacancy/69991945?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проектировать и разрабатывать веб-приложения компании на Python / Django. Самостоятельно декомпозировать задачи бэклога. Оценивать трудоемкость задач вместе с командой. \nОпыт разработки на Python (Go как плюс), опыт с Django Framework от 2-3-х лет обязательно. Умение писать эффективный...",
        "company": "Группа Самолет"
    },
    {
        "title": "Разработчик на Python",
        "url": "https://hh.ru/vacancy/70752761?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддерживать актуальность меню всех ресторанов и магазинов. Создавать и отправлять по-настоящему большие отчёты. Повышать надёжность работы с заказами. \nПонимаете, когда нужна многопоточность, а когда — многопроцессность. Знакомы с хотя бы одной из современных СУБД (PostgreSQL, MongoDB или ClickHouse).",
        "company": "Яндекс"
    },
    {
        "title": "Middle Data analyst в Data Accelerator (работа в РФ)",
        "url": "https://hh.ru/vacancy/70827486?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Работа с большими данными, построение выборок. Сбор, составление требований к продуктам. Моделирование и интерпретация данных. Участие в формировании и проверке...\nОпыт анализа бизнес-процессов или желание его приобрести. Уверенное знание python (стандартная библиотека, pandas, numpy и пр.). Уверенное знание SQL. ",
        "company": "Леруа Мерлен. Центральный офис"
    },
    {
        "title": "Стажер разработчик BI",
        "url": "https://hh.ru/vacancy/70355093?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Помогать в реализации дашбардов и поддержке уже реализованных в BI Qlik.\nЗнание SQL. Знание языков программирования. Базовые знания устройства сети. Знание и владение средствами разработки. В Билайн мы развиваем и поддерживаем...",
        "company": "билайн: Стажировки"
    },
    {
        "title": "Инженер по автоматизации тестирования Python (Путешествия,Travel)",
        "url": "https://hh.ru/vacancy/68429662?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Создавать backend тесты на Python. Рефакторить и поддерживать существующий фреймворк автотестов. Разрабатывать внутренние инструменты, библиотеки и сервисы для тестирования. \nУмение писать автотесты. Опыт ручного тестирования. Знание теории тестирования. Знание баз данных на уровне написания запросов простой-средней сложности. ",
        "company": "Ozon Информационные технологии"
    },
    {
        "title": "Junior Python разработчик (Django)",
        "url": "https://hh.ru/vacancy/69467314?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "МЕДРОКЕТ - платформа IT-решений для медицины. Мы разрабатываем и развиваем цифровые продукты для клиник, врачей и пациентов: сайт отзывов ПроДокторов...\nЗнание Python3. Базовое владение HTML, CSS. В компании есть отдельные FrontEnd разработчики, но желательно уметь читать их код. ",
        "company": "МедРокет"
    },
    {
        "title": "Ведущий программист Python",
        "url": "https://hh.ru/vacancy/70669629?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать распределенные высоконагруженные информационные системы. Разрабатывать объекты бизнес-логики и эффективные методы для доступа к данным. Оптимизировать скорость обращения к...\nВладение Python на высоком уровне. Знание ООП. Знание паттернов проектирования и умение их применять. Опыт работы с базами данных. ",
        "company": "Тензор"
    },
    {
        "title": "Machine Learning инженер (NLP)",
        "url": "https://hh.ru/vacancy/68525212?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать алгоритмы для эффективной предварительной обработки (подготовка, очистка, feature engineering) разнородных неструктурированных и частично-структурированных текстов. Разрабатывать алгоритмы многозначной классификации...\nУверенно знаете язык Python. Уверенно знаете основные структуры данных и классические алгоритмы ML (SVM, Naive Bayes, Random Forest, kNN, k...",
        "company": "ЭВРИКА, Санкт-Петербург"
    },
    {
        "title": "Программист Python (Senior)",
        "url": "https://hh.ru/vacancy/69869831?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Backend разработка. Реализация бизнес-логики. Рефакторинг старого кода и проектирование нового. Написание тестов. Решение нестандартные задач и изучение новых технологий.\nОпыт работы python программистом 7+ лет. Отличное знание Python(>3.6), ООП, паттернов проектирования. Наличие реализованных проектов на Python. ",
        "company": "Смарт Текнолоджис,ООО"
    },
    {
        "title": "Python developer",
        "url": "https://hh.ru/vacancy/66112913?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "2 датацентра. Прирост свыше 200млн 2ТБ публикаций в месяц, по объемам - 2ТБ. Обход >50тыс источников с...\nРабота с большими данными в БД как SQL, так и NoSQL. Программирование асинхронных приложений на python и golang. ",
        "company": "Сайтсофт"
    },
    {
        "title": "Стажер DevOps",
        "url": "https://hh.ru/vacancy/70870973?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Мульти-мастер координация изменений календарей экспертов в режиме распределенной системы. Поддержка LowCode скриптинга для изменения логики работы с вопросами сообщества. \nЗнание Linux, базовые знания Python, теории компиляторов. Высшее образование по профильным специальностям, либо в процессе его получения, фундамент в математике...",
        "company": "GetMeTeam (ИП Калараш Александр Федорович)"
    },
    {
        "title": "Python-разработчик в команду клиентских сервисов",
        "url": "https://hh.ru/vacancy/70853309?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать сервис учета действий клиентов. Проектировать и развивать функционал системы уведомлений для клиентов. Оптимизировать скорость работы и эффективность реализованного функционала. \nОтличное знание Python >3.5. Опыт разработки с учетом постоянно обновляющихся требований. Опыт работы с базами данных (в частности, с...",
        "company": "Selectel"
    },
    {
        "title": "Разработчик Python / Django Developer (middle/senior)",
        "url": "https://hh.ru/vacancy/70326637?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка и поддержка web-приложений, CRM систем, интеграция. Участие в интересных и крупных проектах с нуля в сфере B2...\nОпыт коммерческой разработки от 2х лет. Знание Python-веб-фреймворков Django.",
        "company": "ТООBP Contact"
    },
    {
        "title": "Middle Python backend developer",
        "url": "https://hh.ru/vacancy/70020770?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка веб-приложений и микросервисов. Участие в разработке архитектур проектов. Ведение и поддержка в актуальном состоянии технической документации и тестов. \nОпыт коммерческой разработки проектов на языке Python от 2-х лет. Знание актуальных стабильных версии Django / DRF / Flask / FastAPI. ",
        "company": "Федеральное автономное учреждение Государственный Научно-Исследовательский Институт Авиационных Систем"
    },
    {
        "title": "Разработчик автотестов на Python",
        "url": "https://hh.ru/vacancy/69957813?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Создание и поддержание автоматических тестов. Разработка стратегии и планирование тестирования. Анализ результатов тестирования.\nИмеется опыт автоматизации тестов на языках программирования (Python, C#). Знание SQL и опыт работы с БД (Postgres). Понимание принципов и...",
        "company": "Русские базовые информационные технологии, Научно-производственное объединение"
    },
    {
        "title": "Python Developer",
        "url": "https://hh.ru/vacancy/70915135?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Product development with the choice to make architectural decisions, such as services, and the entire ecosystem. Completion of the administrative...\nExperience in commercial development on the Django Framework. Knowledge and ability to use: iterators, generators, streams. Experience with MySQL, PostgreSQL. ",
        "company": "B2Broker"
    },
    {
        "title": "Python developer (Core команда)",
        "url": "https://hh.ru/vacancy/69533152?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка и поддержка: Сore-сервисов, являющихся основной для всех других продуктов: Механизмы лицензирования и сервер лицензий. Библиотеки Python-клиентов к...\nОтличное знание Python 3.6+. Знание Linux на уровне продвинутого пользователя, bash. Знание MongoDB, PostgreSQL. Опыт работы с асинхронным...",
        "company": "ОООНТехЛаб"
    },
    {
        "title": "Junior Python developer",
        "url": "https://hh.ru/vacancy/70670646?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участвовать в разработке и поддержке программного обеспечения, обеспечивающего работу Транспортных компаний. Тестировать проект на всех этапах разработки. Работать с базами...\nУмение программировать на Python, писать читаемый код. Знание фреймворков Django. Разбираться в верстке HTML и CSS. Опыт работы со сторонними...",
        "company": "ОООАбакам"
    },
    {
        "title": "Python Разработчик в Яндекс Рассылки (remote)",
        "url": "https://hh.ru/vacancy/69352542?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Построить надёжную, масштабируемую и производительную инфраструктуру для сегментации миллионных аудиторий, планирования и отправки миллионов писем при условии роста нагрузки на...\nЗанимались промышленной разработкой больше трёх лет. Имеете опыт многопоточного и сетевого программирования. Знаете классические алгоритмы и структуры данных. ",
        "company": "Яндекс"
    },
    {
        "title": "Python Developer",
        "url": "https://hh.ru/vacancy/70422712?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Design, develop and maintain new and existing Python code in accordance with the coding standards and best practices in one...\nExperience in backend applications (2+ years). Experience in Python (sanic, FastAPI, aiohttp). Knowledge of Linux, Git, Docker, REST API. ",
        "company": "OpenWeather Ltd."
    },
    {
        "title": "Преподаватель программирования для детей и подростков",
        "url": "https://hh.ru/vacancy/70905798?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проводить занятия по Python и по Scratch с применением методических материалов и приемов Алгоритмики. Создавать и поддерживать атмосферу дружеской командной...\n...программирование простым, интересным и веселым! Людей, уже умеющих программировать на Python /Scratch, если имеющих большое желание обучиться! Опыт работы с...",
        "company": "ТООIT Mind"
    },
    {
        "title": "Python Middle+ разработчик",
        "url": "https://hh.ru/vacancy/70907778?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддерживать и оптимизировать текущие проекты, создавать новые. Учавствовать в проработке и улучшении архитектуры системы и API. Использовать современные подходы, инструменты...\nЭкспертное владение Python, PostgreSql и MySQL. Опыт работы с синхроннными фреймворками ( Django/Flask). Навыки создания Rest API. Понимаете суть принципов...",
        "company": "it-aces.com"
    },
    {
        "title": "Python-developer (Кипр)",
        "url": "https://hh.ru/vacancy/70747717?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Задача: переписать жесткое легаси-приложение для расчета показателей облигаций (смесь из C#/C++/Java/Python) на свежий облачный стек. \nПрежде всего, сильного технологиста, не боящегося влезать в дебри старого кода (в основном C# и Python) для выяснений особенностей старой...",
        "company": "ОООФиндев"
    },
    {
        "title": "Backend разработчик",
        "url": "https://hh.ru/vacancy/70866962?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Опыт разработки масштабируемых высоконагруженных Web сервисов (REST API) на Python. Понимание работы протоколов TCP, HTTP(S). Опыт многопоточного и асинхронного...",
        "company": "CG Tribe"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/70711480?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Вам предстоит участвовать в собственной разработке платформы для решения сложных задач оптимизации и стратегического моделирования.\nОпыт разработки на Python от 3х лет. - Опыт разработки web-приложений. - Отличные знания в области ООП. - Хорошие знания SQL...",
        "company": "АОРамакс Интернейшнл"
    },
    {
        "title": "Разработчик Python (Рекламная платформа)",
        "url": "https://hh.ru/vacancy/70739357?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать и поддерживать личный кабинет рекламной системы. Создавать и поддерживать разнообразные API, на которых основаны интерфейс и интеграции с другими...\nОпыт использования Python. Хорошее знание алгоритмов и структур данных. Умение проектировать архитектуру веб-приложений и систем по обработке данных. ",
        "company": "Сбер. IT"
    },
    {
        "title": "Python-разработчик",
        "url": "https://hh.ru/vacancy/70709226?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработкой API. Интеграцией сторонних сервисов. Участием в полном цикле разработки - проектирование, программирование, тестирование, поддержка. Проводить код-ревью.\nОпыт производственной разработки в команде на Python 2 (scapy), Python 3 (aiohttp) от 1-года. Разработка на *nix + git. ",
        "company": "EPG Service"
    },
    {
        "title": "Разработчик бэкенда (Python)",
        "url": "https://hh.ru/vacancy/70705582?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Кроме того, мы формируем группу, которая будет разрабатывать общую инфраструктуру для всех текущих и будущих продуктов, создавать новые фичи, строить...\nМы свободны в выборе технологий, в т. ч. опенсорсных и внешних облаков, при этом можем использовать внутренние технологии, знания и...",
        "company": "Яндекс"
    },
    {
        "title": "Python Backend Engineer, Remote",
        "url": "https://hh.ru/vacancy/70851811?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Develop new features, testing and releasing Property Management platforms into production for end users. Work with Property Management Software in...\nAt least 3-4 years experience with Python web development. Experience with Cloud (ideally AWS). Experience with MQs (Kafka or...",
        "company": "ГК ВИЗАВИ Консалт"
    },
    {
        "title": "Стажер-разработчик (Machine Learning)",
        "url": "https://hh.ru/vacancy/70026582?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Решение сложных задач для улучшения жизни людей.\nЗнание классических алгоритмов и структур данных. Умение писать код на Python. Знание основных методов машинного обучения. Опыт ML разработки и...",
        "company": "Яндекс"
    },
    {
        "title": "Инженер по автоматизации тестирования Python, Поиск и Каталог, Личный кабинет продавца",
        "url": "https://hh.ru/vacancy/53804528?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать автотесты на Python. Создавать тест-планы и проверять новые фичи. Разрабатывать инфраструктурные решения для тестирования. Работать в тесном контакте...\nУмение разбираться в новых технологиях и предметных областях. Опыт создания автотестов на C#/Java/Python. Опыт работы с Git и...",
        "company": "Ozon Информационные технологии"
    },
    {
        "title": "Middle/Senior Python разработчик (удаленно)",
        "url": "https://hh.ru/vacancy/69896075?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка программируемых (правила формирует человек) систем анализа и. Фильтрации сетевого трафика. Разработка самообучающихся автономных систем фильтрации трафика: сбор. \nНаходить решения нетривиальных задач. Желание обучаться новому. Опыт разработки программ на Python. Умение разрабатывать ПО под Linux. Базовые знания протоколов...",
        "company": "StormWall™"
    },
    {
        "title": "Разработчик чат-ботов в Telegram (Python)",
        "url": "https://hh.ru/vacancy/69408489?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Создание чат-ботов. Поддержĸа ĸода в случае необходимости. Кратĸое доĸументирование того, ĸаĸ работает ĸод.\nУверенное знание Telegram API и его требования. Знание Python на уровне выше среднего. Умение построить струĸтуру бота в таĸом виде...",
        "company": "Human Capital"
    },
    {
        "title": "Python-разработчик в R&D отдел",
        "url": "https://hh.ru/vacancy/70097294?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Написание чистого, понятного кода. Реализация сетевых клиентов и протоколов по документации. Взаимодействие с исследователями. Покрытие тестами. Написание документации. \nУверенное знание Python3. Умение использовать ООП. Знание сетевых протоколов разного уровня (TCP, UDP, HTTP, WebSocket, etc) и способов сериализации...",
        "company": "ОООСелфсек"
    },
    {
        "title": "Python Developer (Crypto)",
        "url": "https://hh.ru/vacancy/70708535?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Software development. Highload and high available web stack services to support various customer journeys (Payments management). Supporting and back-office...\nYou have 5 years of commercial software development using Python or Go and have excellent knowledge of its stack. ",
        "company": "EXNESS Global Limited"
    },
    {
        "title": "Python developer (middle)",
        "url": "https://hh.ru/vacancy/70403202?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать фреймворк для тестирования железа: фиксить баги, внедрять фичи. Разрабатывать “драйверы” для работы с промышленным оборудованием. Разрабатывать графические утилиты для...\nВысшее образование (IT). Опыт коммерческой разработки на python. Опыт работы с Python3.9+. Опыт использования pytest. ",
        "company": "Бюро 1440"
    },
    {
        "title": "Научный сотрудник / Deep Learning researcher по направлению Life Science",
        "url": "https://hh.ru/vacancy/70899953?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проведение научных исследований и публикация статей по направлению Life Science (проекты: Расчет электронных свойств молекул и др.). Выступления на научных...\nОпыт работы или готовые проекты в DL Python ML stack (Pandas, NumPy, SciPy, ...) + DL фреймворк (PyTorch/Tensorflow/Keras). ",
        "company": "Институт искусственного интеллекта AIRI"
    },
    {
        "title": "Lead Python разработчик",
        "url": "https://hh.ru/vacancy/70484294?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Опыт Python для работы с данными от 5-х лет. Алгоритмическая подготовка, понимание основных алгоритмов и структур данных. ",
        "company": "Юрент"
    },
    {
        "title": "Data Scientist",
        "url": "https://hh.ru/vacancy/70862418?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Прогнозирование жизненного цикла пользователя. Решение задачи оттока. Решение задачи uplift-моделирования.\nЗнать и уметь Python, SQL, Airflow. Общаться с бизнесом и конвертировать \"боли\" бизнеса в задачу на уровне данных, метрик, формулировки. ",
        "company": "ОООЗвук"
    },
    {
        "title": "Data Analyst",
        "url": "https://hh.ru/vacancy/69900837?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поиск, сбор, подготовка, анализ и визуализация данных. Анализ и сегментация клиентской базы. Анализ и прогноз эффективности по CVM активностям. \nЗнание SQL на продвинутом уровне, опыт работы с Python, Hadoop. Опыт работы в CVM направлении. Знание основ математической статистики. ",
        "company": "билайн: ИТ, Data, Digital"
    },
    {
        "title": "Python Developer (Data Science)",
        "url": "https://hh.ru/vacancy/70681099?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Внедрение моделей машинного обучения. Разработка систем аналитики и мониторинга. Поддержка, оптимизация, модернизация уже существующих приложений и сервисов.\nPython 3. SQL. Навыки работы в Linux. Git. Опыт написания unit-тестов (unittest, pytest). Понимание принципов ООП и функционального программирования. ",
        "company": "ОООСима-ленд"
    },
    {
        "title": "Руководитель веб-разработки на Python",
        "url": "https://hh.ru/vacancy/70333858?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Планирование процесса разработки. Участие в полном цикле разработки: от проектирования архитектуры до тестирования. Развертывание и интеграция ПО у заказчиков.\nОпыт коммерческих проектов на Python. Знание Python на уровне не ниже middle. Понимание вэб-стэка. Навыки проектирования микросервисной архитектуры. ",
        "company": "ОООКогнитивные системы"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/69588204?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать код для применения ML-решений в промышленных процессах Банка. Проектировать и реализовывать решения для промышленного применения ML алгоритмов. \nКакие знания и навыки для нас важны: Знание принципов ООП. Знание Python. Опыт разработки веб-приложений/сервисов (Python/Java/JavaScript). ",
        "company": "Иннотех, Группа компаний"
    },
    {
        "title": "ML Engineer / MLOps",
        "url": "https://hh.ru/vacancy/70889139?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Исследование и поиск промышленных источников для создания признаков и целевой переменной для моделей. Воссоздание необходимых источников на промышленных данных. \nPython, SQL. Понимание методологии DevOps. Linux, Git (понимание GitFlow, GithubFlow). Базовые знания по ML-моделям. Опыт работы с экосистемой Hadoop...",
        "company": "Сбер. Data Science"
    },
    {
        "title": "Преподаватель программирования для детей и подростков",
        "url": "https://hh.ru/vacancy/70283526?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проводить занятия по Python ( Scratch, LUA) с применением методических материалов и приемов Алгоритмики. Создавать и поддерживать атмосферу дружеской командной работы...\n...простым, интересным и веселым! Людей, уже умеющих программировать на Scratch, Python (или знать другой язык программирования). Опыт работы с детьми...",
        "company": "ТООIT Mind"
    },
    {
        "title": "Middle Python developer",
        "url": "https://hh.ru/vacancy/70904443?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка нового функционала, оптимизация, рефакторинг и развитие существующего кода на языке Python с использованием лучших практик разработки (автоматическое тестирование, код...\nОпыт разработки веб-приложений с использованием фреймворков экосистемы Python (asyncio, fastapi, django и др.). Понимание принципов объектно-ориентированного программирования. ",
        "company": "АОРТСофт"
    },
    {
        "title": "Junior+ Python разработчик",
        "url": "https://hh.ru/vacancy/70578724?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Документирование API в Swagger. Работа с инструментами отладки. Профилирование выполнения функций и разработка тестов.\nОпыт коммерческой разработки от 1,5 года. Уверенное знание Python, Django, опыт работы с Django REST Framework. Навык оценки и...",
        "company": "Sibdev"
    },
    {
        "title": "Senior Machine Learning Engineer",
        "url": "https://hh.ru/vacancy/69082423?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Подготавливать ML модели к промышленной эксплуатации. Разрабатывать сервисы с ML компонентами. Автоматизировать процессы подготовки данных. Оптимизировать потребление ресурсов сервисами, а...\nУмение написания Production кода на Python/С++/Go с опытом от 3х лет. Глубокое понимание, как работают алгоритмы машинного...",
        "company": "КИБЕР-РОМ"
    },
    {
        "title": "Разработчик backend (python)",
        "url": "https://hh.ru/vacancy/69426809?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка ML пайплайнов и сервисов как собственными силами, так и совместно с бизнес-подразделениями и подрядчиками. R&D, исследование новых...\nВладение языками Python (90% разработки) и Kotlin (10% разработки). Опыт в разработке backend от 2-х лет. Приветствуется опыт работы...",
        "company": "Росгосстрах"
    },
    {
        "title": "Python разработчик в CM.Expert (Яндекс Вертикали)",
        "url": "https://hh.ru/vacancy/70677410?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Вместе с нами решать сложные архитектурные вопросы. Выполнять обилие разных задач: продуктовые, которые приносят пользу пользователям, совместные задачи с ML...\nБольше трех лет работали с Python 3 с использованием асинхронного программирования. Имели дело с клиент-серверными приложениями и знаете, что...",
        "company": "Яндекс"
    },
    {
        "title": "Python Developer",
        "url": "https://hh.ru/vacancy/68851413?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Product development with the choice to make architectural decisions, such as services, and the entire ecosystem. Completion of the administrative...\nExperience in commercial development on the Django Framework. Knowledge and ability to use: iterators, generators, streams. Experience with MySQL, PostgreSQL. ",
        "company": "B2Broker"
    },
    {
        "title": "Machine Learning Engineer, Ozon Fresh",
        "url": "https://hh.ru/vacancy/70905461?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Высшее математическое или техническое образование. Опыт разработки на Python. Знание ООП (solid, grasp, ...). Знание Git. Знание SQL на уровне построения...",
        "company": "Ozon fresh"
    },
    {
        "title": "Data-аналитик",
        "url": "https://hh.ru/vacancy/70686241?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Анализ данных по показателям бизнеса розничной сети. Поиск инсайтов, разработка алгоритмов системного выявления отклонений в деятельности сотрудников и партнеров компании. \nОпыт работы аналитиком данных от 2 лет. Уверенное использование SQL. Плюсом будет навык обработки данных с помощью Python.",
        "company": "билайн: ИТ, Data, Digital"
    },
    {
        "title": "Аналитик данных / продукта (Поисковый движок)",
        "url": "https://hh.ru/vacancy/67619831?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "В команду Улучшения поиска Департамента управления данными, ищем специалиста на позицию Аналитик данных. Вы будете помогать команде с развитием инструмента...\nУверенное владение SQL: подзапросы, объединения, агрегации, аналитические функции. Уверенное владение Python (в части анализа данных). Начальные знания Query DSL, языка...",
        "company": "Компания «СПОРТМАСТЕР», Sportmaster Lab"
    },
    {
        "title": "Machine Learning Engineer, Ozon Fresh",
        "url": "https://hh.ru/vacancy/70905341?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Высшее математическое или техническое образование. Опыт разработки на Python. Знание ООП (solid, grasp, ...). Знание Git. Знание SQL на уровне построения...",
        "company": "Ozon fresh"
    },
    {
        "title": "Team Lead Python",
        "url": "https://hh.ru/vacancy/69431365?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать и внедрять нашу новую архитектуру платформы в сотрудничестве с архитекторами и другими руководителями. Применять передовой опыт проектирования во всех...\nБольшой опыт разработки программного обеспечения на стороне сервера с использованием Python и асинхронных фреймворков. Опыт проектирования и архитектуры микросервисов. ",
        "company": "Дартс рекрутинг сервисез"
    },
    {
        "title": "QA Engineer (SDET, Hardware + Python)",
        "url": "https://hh.ru/vacancy/70375910?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Писать hardware тесты. Это как unit тесты, но в тестах происходит взаимодействие с “железом”. Железо - это спутник и его бортовые...\nВысшее образование (IT). Опыт коммерческой разработки на python. Опыт работы с Python 3.9+. Опыт использования pytest.",
        "company": "Бюро 1440"
    },
    {
        "title": "Младший инженер машинного обучения / ML Engineer Junior",
        "url": "https://hh.ru/vacancy/70800587?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в реализации проектов с применением статистических и математических подходов(ML/DL) на накопленных данных. Формирование бизнесовых гипотез, дизайн и...\nВладение SQL, Python (pandas, numpy, pytorch, keras, tensorflow). Желательно: MS SQL Server, MS Power BI.",
        "company": "Главстрой Санкт-Петербург"
    },
    {
        "title": "Программист Python",
        "url": "https://hh.ru/vacancy/67711604?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка клиентских приложений реализующих удаленное управление, обработку и представление видео и телеметрической информации. Разработка сервисов, обеспечивающих обмен и преобразование данных.\nПрактический опыт разработки ПО на языках С++ 11/14, Python 3. Понимание принципов ООП. Знание и опыт использования библиотек Qt...",
        "company": "НИЦ СПб ЭТУ (Научно-инженерный центр Санкт-Петербургского электротехнического университета)"
    },
    {
        "title": "Python программист (Наставник онлайн-курса по Python)",
        "url": "https://hh.ru/vacancy/67864415?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Отвечает на вопросы студентов в учебном чате или мессенджере. Делает код-ревью проектов и практик. Проводит дополнительные активности (вебинары, слаконары...\nУ вас есть опыт коммерческой разработки на Python и его фреймворках (в частности, Django). У вас есть базовые знания алгоритмов...",
        "company": "Hexlet"
    },
    {
        "title": "Backend разработчик Python midlle",
        "url": "https://hh.ru/vacancy/44070869?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать внутренние web-сервисы на Python. Взаимодействие в команде по разработке ПО (Scrum). Разрабатывать удобные инструменты управления платформой (системы генерации...\nОбщий опыт работы в должности Back-end разработчика от 1 года. Хорошие знания Python 3. Знание одного из веб-фреймворков...",
        "company": "ГРЧЦ, ФГУП"
    },
    {
        "title": "Руководитель группы разработки (Python)",
        "url": "https://hh.ru/vacancy/70822946?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Техническое руководство командой разработки, декомпозиция задач, контроль выполнения. Участие в подборе команды разработчиков. Плотное взаимодействие с группой компьютерного зрения. \nопыт профилирования и отладки приложений на Python под Linux. Опыт разработки многопоточных приложений, а также знание характерных для Linux способов...",
        "company": "ОООТМХ ИНТЕЛЛЕКТУАЛЬНЫЕ СИСТЕМЫ"
    },
    {
        "title": "Инженер по автоматизации тестирования (QA Automation Engineer) (Python/JavaScript/TypeScript)",
        "url": "https://hh.ru/vacancy/70836931?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Самостоятельно разрабатывать и улучшать автоматические тесты для онлайн платформы по разметке данных для искусственного интеллекта (https://github.com/opencv/cvat). \nОпыт работы с системой контроля версий (Git). Достаточно хорошее знание Python или JavaScript/TypeScript для написания и отладки тестовых сценариев. ",
        "company": "ОООXperience.ai"
    },
    {
        "title": "Инженер-программист",
        "url": "https://hh.ru/vacancy/70906571?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка функционала ПО «Енисей-М». Разработка ППО для SCADA-систем, различных производителей. Наладка на объекте.\nВладение языками программирования. Приоритетно Delphi, Python. Опционально С, С++, Java и пр. Опыт работы с пакетами SCADA-систем различных производителей...",
        "company": "ОООРакурс-инжиниринг"
    },
    {
        "title": "Главный инженер разработки Python ETL (удаленно)",
        "url": "https://hh.ru/vacancy/69984222?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в процессах автоматизации: Написание высоконагруженных приложений на Python стеке. Разработка промышленных ООП приложений. Airflow в кластерной конфигурации (Celery/Kubernetes...\nПрофессионально значимые качества:: способность к анализу, систематизации, классификации; стрессоустойчивость; способность работать с большими объемами информации; умение брать на себя ответственность...",
        "company": "Газпромбанк"
    },
    {
        "title": "Python-разработчик в команду клиентских сервисов",
        "url": "https://hh.ru/vacancy/70853310?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать сервис учета действий клиентов. Проектировать и развивать функционал системы уведомлений для клиентов. Оптимизировать скорость работы и эффективность реализованного функционала. \nОтличное знание Python >3.5. Опыт разработки с учетом постоянно обновляющихся требований. Опыт работы с базами данных (в частности, с...",
        "company": "Selectel"
    },
    {
        "title": "Data Engineer",
        "url": "https://hh.ru/vacancy/69710334?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Там порядка 40 тысяч строк на Python 3.8 и 3 тысячи на TypeScript (это админка). Критическая функциональность покрыта тестами...\nОпыт работы инженером данных от 3 лет. Отличное знание Python и SQL. Опыт с AWS или опыт с Apache Impala.",
        "company": "Aviasales.ru"
    },
    {
        "title": "Machine Learning Engineer, Ozon Fresh",
        "url": "https://hh.ru/vacancy/70905436?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Высшее математическое или техническое образование. Опыт разработки на Python. Знание ООП (solid, grasp, ...). Знание Git. Знание SQL на уровне построения...",
        "company": "Ozon fresh"
    },
    {
        "title": "Data Scientist",
        "url": "https://hh.ru/vacancy/70752727?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Роль будет сквозной, от понимания структуры и взаимосвязей в данных до исследовательского анализа данных и разработки функций до обучения моделей...\nОтличное знание SQL. - Навыки программирования Python. - Высшее техническое образование. - Английский язык - не ниже С1. - Опыт проектирования ETL-конвейеров бизнес...",
        "company": "Marksman"
    },
    {
        "title": "Python разработчик",
        "url": "https://hh.ru/vacancy/70611335?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддержка существующих Python-модулей real-time обработки SMS трафика. Внедрение в существующее решение кастомных доработок. Разработка unit-тестов. \nУмеете работать с чужим кодом. Имеете опыт промышленной разработки на Python от 5-ти лет. Работали с прикладными протоколами передачи...",
        "company": "SWOYO"
    },
    {
        "title": "С/С++ Linux разработчик (remote)",
        "url": "https://hh.ru/vacancy/70374667?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Желательно: Опыт в разработке для Linux kernel (kernel/, mm/, net/, security/). Владение Python для написания тестовых скриптов. Хороший письменный английский...",
        "company": "ОООТемпеста"
    },
    {
        "title": "Middle Backend Engineer (Python)",
        "url": "https://hh.ru/vacancy/69618811?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Платформа работает с множеством различных слоев данных, в том числе с лидарными облаками точек, фотограмметрическими и 3Д-моделями (BIM...\nProject Management: Gitlab, Enterprise Architect, Asana. 1. опыт работы на Python не менее 3х лет. 2. хорошее понимание паттернов...",
        "company": "ОООТазмар"
    },
    {
        "title": "Python-разработчик в команду клиентских сервисов",
        "url": "https://hh.ru/vacancy/70853307?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать сервис учета действий клиентов. Проектировать и развивать функционал системы уведомлений для клиентов. Оптимизировать скорость работы и эффективность реализованного функционала. \nОтличное знание Python >3.5. Опыт разработки с учетом постоянно обновляющихся требований. Опыт работы с базами данных (в частности, с...",
        "company": "Selectel"
    },
    {
        "title": "Стажер-разработчик бэкенда (Python)",
        "url": "https://hh.ru/vacancy/70584056?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Знание языка программирования Python. Отличное знание алгоритмов и структур данных. Опыт разработки в Unix или Linux (приветствуется).",
        "company": "Яндекс"
    },
    {
        "title": "Backend Python программист",
        "url": "https://hh.ru/vacancy/69393306?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка на Python сервисной части продукта. Разработка скриптов для интеграции со сторонними сервисами по REST API/SOAP. Устранение багов в...\nОпыт разработки с использованием Python от 2 лет. Опыт использования Swagger. Опыт работы в команде. Знание MySQL. Опыт использования REST...",
        "company": "Lexicom"
    },
    {
        "title": "Research Developer (Python)",
        "url": "https://hh.ru/vacancy/53162087?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поиск неоптимальностей в работе продукта. Проведение исследований сложных случаев подтормаживаний и лагов. Предлагать улучшения архитектуры и алгоритмов. Принимать участие в...\nУверенное администрирование Linux. Знание bash, python. Опыт настройки и работы с Redis, docker, swarm, kafka. Умение работать с огромным количеством...",
        "company": "Лаборатория Касперского"
    },
    {
        "title": "ML-Ops/Dev-Ops",
        "url": "https://hh.ru/vacancy/69085670?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Развивать инфраструктуру используя IaaC. Повышать отказоустойчивость и доступность сервисов. Выстраивать Pipleline-ы сборки артефактов и их доставки до стендов. \nВажно уметь развернуть и настроить все своими руками! Владение скриптовыми языками Python/Bash. Опыт использования IaaC c помощью ansible/terraform...",
        "company": "КИБЕР-РОМ"
    },
    {
        "title": "Разработчик python (Middle/Senior)",
        "url": "https://hh.ru/vacancy/70501812?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Интересные проекты и современный стек (Celery, FastAPI, Tornado, PostgreSQL, RabbitMQ, Docker. Для разработки используем VS Code, Gitlab, Jira, Confluence). \nНестандартные решения и желание экспериментировать. Успешный опыт в разработке на Python 3.* (скоринговых карт, анти-фрод решений, интеграционной шины). ",
        "company": "Eqvanta"
    },
    {
        "title": "Python Developer (Senior/Middle)",
        "url": "https://hh.ru/vacancy/70585016?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в интересном проекте телемедицины. Разработка Бэк и Фронт. - Проектирование решений. - Обучение и контроль работы джунов и фрилансеров. - \nОпыт разработки на Python от 3 лет. Опыт работы с Django (Django Rest Framework, Django ORM). Опыт разработки VueJS. ",
        "company": "ОООТелеком-ВИСТ"
    },
    {
        "title": "Middle Backend Engineer (Python)",
        "url": "https://hh.ru/vacancy/69618812?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Платформа работает с множеством различных слоев данных, в том числе с лидарными облаками точек, фотограмметрическими и 3Д-моделями (BIM...\nProject Management: Gitlab, Enterprise Architect, Asana. 1. опыт работы на Python не менее 3х лет. 2. хорошее понимание паттернов...",
        "company": "ОООТазмар"
    },
    {
        "title": "Data scientist (Антифрод)",
        "url": "https://hh.ru/vacancy/67820939?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Анализировать данные и выдвигать гипотезы по новым типам нарушений. Разрабатывать новые механики автоматической проверки объявлений. Оценивать результаты внедренных моделей. \nВладение SQL на уровне написания сложных запросов (мы используем postgres и clickhouse). Уверенное владение Python (Pandas, NumPy, SkiPy, scikit-learn...",
        "company": "Домклик"
    },
    {
        "title": "Python Web Developer (Middle)",
        "url": "https://hh.ru/vacancy/53154394?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать и поддерживать web-приложения для внутренних задач.\nИмеет опыт разработки web-приложений с использованием Python (от 2-3 лет). Уверенно владеет Python (фреймворки для web-разработки: Flask...",
        "company": "DNS Головной офис"
    },
    {
        "title": "Senior DevOps Engineer (Yepp)",
        "url": "https://hh.ru/vacancy/67119426?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Систему честного разделения доходов от рекламы с авторами мемов. ML-редактор, с которым каждый может создавать виральный контент. \nУмение программировать на одном из языков программирования: Python, Bash, PHP, Go. Умение и желание глубоко познавать работу различного софта (Nginx...",
        "company": "FUNCORP"
    },
    {
        "title": "Back End Engineer (Python)",
        "url": "https://hh.ru/vacancy/69721147?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Todo: Code extract&load marketing data from 1000+ sources (facebook api, google api, pinterest api … ). Build and improve ELT...\nAt least 3 years of experience in a similar position. Experience with microservices architecture. Framework. PostgreSQL, ClickHouse, etc. ",
        "company": "Improvado"
    },
    {
        "title": "Разработчик программного обеспечения",
        "url": "https://hh.ru/vacancy/70000040?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка программного обеспечения для обеспечения функционирования измерительных приборов на платформе NVIDIA JETSON. Программирование ПЛК.\nЗнание языков программирования C/Cpp, Python. Знание особенностей портирования на AArch64 в ОС Linux. Знание синтаксиса БД SQL. ",
        "company": "ОООНПП Интервал"
    },
    {
        "title": "Middle python developer",
        "url": "https://hh.ru/vacancy/70747313?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Написание пайплайнов обработки данных по циклу ETL.\nСо знанием базовых структур данных и алгоритмов. С опытом работы с Docker. С опытом работы с реляционными базами данных (PostgreSQL). ",
        "company": "Positive Technologies"
    },
    {
        "title": "Релиз-инженер (DevOps Junior)",
        "url": "https://hh.ru/vacancy/67878560?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "подготавливать окружение эксплуатации для релиза продукта. - сопровождать релиз программного продукта при развертывании в промышленную среду. - отслеживать ошибки развертывания. - \nОпыт работы с системами контроля версий (Git). - Опыт автоматизации на скриптовых языках (bash/python/etc). - Опыт работы с пакетным менеджером...",
        "company": "Группа Самолет"
    },
    {
        "title": "Data / ML Engineer (Персонализация)",
        "url": "https://hh.ru/vacancy/55135245?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать, оптимизировать и поддерживать пайплайны обработки данных и машинного обучения. Реализовывать высокопроизводительные процедуры расчета витрин признаков. Развитые problem solving skills...\nОпыт разработки и автоматизации пайплайнов обработки данных. Уверенное владение Python (структуры данных, пакеты для обработки данных). Умение работать с системами...",
        "company": "Компания «СПОРТМАСТЕР», Sportmaster Lab"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/70515470?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Наставление менее опытных коллег.\nОтличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ",
        "company": "Тинькофф"
    },
    {
        "title": "Ведущий Python-разработчик / Senior Python Developer",
        "url": "https://hh.ru/vacancy/70846265?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проектировать и разрабатывать сервисы с использованием стека технологий, описанного ниже. Разворачивать разработанные сервисы в Kubernetes-кластер, настраивать их мониторинг, улучшать...\nОтличное знание языка Python, опыт работы с web-фреймворками Flask или FastAPI. Продвинутое знание SQL, понимание нюансов работы СУБД PostgreSQL...",
        "company": "Marilyn System Russia"
    },
    {
        "title": "Python-developer",
        "url": "https://hh.ru/vacancy/67635148?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка высоконагруженного финансового приложения. - Реализация сервиса доставки. - Развитие и сопровождение высоконагруженного приложения фиксации активности пользователей.\nДелать лучший продукт в России. Уверенные знания Python, ООП. Опыт работы с PostgreSQL: построение оптимальных sql-запросов (без использования ORM...",
        "company": "Тензор"
    },
    {
        "title": "Инженер-программист (Python)",
        "url": "https://hh.ru/vacancy/69100495?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка программ, компонентов программ и программных модулей на языке Python. Разработка алгоритмов управления и взаимодействия в программах. Разработка графических пользовательских...\nВысшее техническое образование. Профессиональное знание Python, опыт программирования на языках высокого уровня (преимущество), PyQt - обязательное условие. Знание современных средств разработки...",
        "company": "Diakont"
    },
    {
        "title": "Middle Python Developer - разработчик Пайтон",
        "url": "https://hh.ru/vacancy/69826021?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в проектировании архитектуры системы. Разработка микросервисов и участие в создании высоконагруженных систем (10.000 пользователей в сутки). \nКоммерческая разработка на Python от 2-х лет. Опыт написания микросервисов, понимание микросервисной архитектуры. Опыт работы с MySQL/Postgres. ",
        "company": "ОООДэстэн Партнерс"
    },
    {
        "title": "Lead Python Developer",
        "url": "https://hh.ru/vacancy/70850642?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработкой/поддержкой сервисов на Python. Обеспечением хорошего покрытия тестами кода. Ревью/менторинг своей команды по качеству решений. Дизайном архитектуры сервисов. \nЗнание Python. Опыт разработки проектов на Django/Flask/FastAPI. Опыт коммерческой разработки 5+ лет. Опыт в проектировании распределенных систем. ",
        "company": "FunBox"
    },
    {
        "title": "Бэкенд-разработчик Python (Middle)",
        "url": "https://hh.ru/vacancy/67599054?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддержка и разработка новых фич в микросервисах на python, работа с БД mysql и postgres. Используемые инструменты командной разработки: gitlab...\nОпыт промышленной разработки на python от года. Понимание принципов микросервисной архитектуры. Опыт работы с FastAPI, docker, mysql, postgresql.",
        "company": "QIWI"
    },
    {
        "title": "Python-разработчик",
        "url": "https://hh.ru/vacancy/69270134?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать сценарии автоматизации настройки Linux-серверов, модулей Ansibe (Python). Автоматизировать и развивать процессы выдачи, конфигурирования и сопровождения Linux-серверов. \nЗнание back-end разработки. Работа с Python. Знание Linux системы на уровне администратора. Опыт эксплуатации OpenStack, VMWare, знание архитектуры и...",
        "company": "Сбер. IT"
    },
    {
        "title": "Инженер-Программист (отдела функционального тестирования Python + Selenium )",
        "url": "https://hh.ru/vacancy/69412074?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Автоматизация тестирования Web UI. Развитие и поддержка инфраструктуры автоматизации тестирования. Разработка и проведение нагрузочного тестирования. Взаимодействие с командой разработки, аналитиками...\nОпыт программирования на Python + Selenium. Опыт программирования на Python. Понимание OSI, сетевых сервисов. Опыт работы в тестировании ПО от...",
        "company": "СИРИУС"
    },
    {
        "title": "Python-разработчик",
        "url": "https://hh.ru/vacancy/67226964?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проектировать компоненты систем. Организовывать процесс разработки. Писать и ревьюить код. Наставлять менее опытных коллег.\nЗнаешь Python 3 и имеешь опыт промышленной разработки на Python от трех лет. Есть опыт многопоточного и асинхронного программирования. ",
        "company": "Тинькофф"
    },
    {
        "title": "Python Developer",
        "url": "https://hh.ru/vacancy/70736925?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Creating clean, well-documented, maintainable, testable and scalable code. Ensuring high-quality solutions produced through automated testing and monitoring code...\nCommercial Python development experience for 3+ years. Experience with a single web framework (Django or Flask). Good knowledge of...",
        "company": "Andersen"
    },
    {
        "title": "Data engineer Инженер данных (Аналитик)",
        "url": "https://hh.ru/vacancy/70692233?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Формализация бизнес задачи и реализация ее решения с помощью Data Science и математики. -Построение моделей по прогнозу спроса и предложения...\nЖелаемые ЗУН: -Желателен опыт работы с большими данными (Spark, EMR)). -Желателен опыт сбора или разметки датасетов из открытых источников. -",
        "company": "ОООИмператив Медиа"
    },
    {
        "title": "Ведущий разработчик Python/Django",
        "url": "https://hh.ru/vacancy/70536153?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддержка и доработка существующего портала компании на базе Python/Django. Разработка интеграций с инфраструктурными сервисами компании. Разработка нового функционала по...\nОтличное знание SQL, реляционных баз данных (Postgres). Отличное знание Python 3 и Django. Отличное знание HTML/CSS, JavaScript. ",
        "company": "АОДеловая среда"
    },
    {
        "title": "FullStack QA Engineer (Python)",
        "url": "https://hh.ru/vacancy/70807001?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "участвовать в автоматизации тестирования разрабатываемых продуктов на Python. - совершенствовать и модернизировать технологические процессы для оптимизации работы QА. - работать с баг...\nЗнание и опыт автоматизации тестирования на Python (от 2 лет). Знание принципов ООП. Знание Selenium и Pytest. Опыт тестирования бэкенда. ",
        "company": "ОООЗащищенные Телекоммуникации"
    },
    {
        "title": "Преподаватель по программированию",
        "url": "https://hh.ru/vacancy/70905600?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Обучение групп студентов программированию. - Проверка домашних заданий. - Сопровождение студентов в течение всего курса.\nЗнание одного из следующих технологии: Python (Django & Data Science), Java (Spring), React. - Стажировки в Microsoft и Google (только для студентов).",
        "company": "ИПSkyLearn (IP AZAURBEKOV)"
    },
    {
        "title": "Middle Data engineer",
        "url": "https://hh.ru/vacancy/69876645?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Построение аналитической системы. Построение единого хранилища данных и работы с имеющимся функционалом.\nУчаствовать в разработке отчетной системы. Разрабатывать и поддерживать ETL-процессы (Python, SQL, Airflow). Создавать агрегированные таблицы из сырых данных со...",
        "company": "ТООAVIATA.KZ"
    },
    {
        "title": "Python разработчик",
        "url": "https://hh.ru/vacancy/70476534?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка компонентов и нового функционала. Доработка существующего кода. Активное взаимодействие с коллегами, обсуждение архитектуры приложения.\n...сервисов (backend) на языке Python от 1 года. Опыт работы с различными CУБД(MySQL\\Postgres\\Mongo). Python 3.6+. ",
        "company": "ОООСтудия цифровых решений"
    },
    {
        "title": "Middle Python Developer",
        "url": "https://hh.ru/vacancy/70825133?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Реализовывать новый функционал, рефакторить код, фиксить баги, участвовать в code review и т.д.. Заниматься написанием pytest'ов. \nХорошие знания Python. Опыт работы c Git. Опыт работы с Asyncio. Опыт работы с Pydantic. Опыт работы с Sanic. ",
        "company": "Алабуга. IT-Разработка игр"
    },
    {
        "title": "Python Developer",
        "url": "https://hh.ru/vacancy/70527680?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка web части сайтов на Django. - Разработка REST сервисов на DRF. - Разработка async сервисов. - Разработка клиентов для работы со сторонними...\nЗнание PEP8 и понимание для чего он нужен. — Понимание The Zen of Python. — Умение, и главное, желание создавать pythonic...",
        "company": "ТООGloberce Inc."
    },
    {
        "title": "Python-разработчик ВИСТ Групп",
        "url": "https://hh.ru/vacancy/69765726?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проектирование, разработка, рефакторинг микросервисов и прикладных модулей системы диспетчеризации горной добычи. Покрытие кода тестами. Проведение сodereview. Разработка ТЗ на программные...\nЭкспертные знания Python 3. Опыт написания unit-тестов, pytest. Умение распознавать и применять Design Patterns. Знание архитектурных шаблонов. ",
        "company": "ОООЦИФРА"
    },
    {
        "title": "Python + Go Developer Центр HR TECH",
        "url": "https://hh.ru/vacancy/68553752?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Исправлять баги и улучшать технические характеристики сервиса. Интеграция с различными внешними системами и сервисами. Участвовать в собеседованиях python разработчиков.\nПонимание принципов разработки многопоточных/ асинхронных/ многопроцессорных приложений и их особенности в python. Умение поддерживать высокое качество создаваемых продуктов (unit/ integration...",
        "company": "АОГринатом"
    },
    {
        "title": "Python разработчик (Team Lead) (PT CERT)",
        "url": "https://hh.ru/vacancy/70897261?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Наша команда разрабатывает ПО, которое поможет наладить взаимодействие между государственными и коммерческими организациями. Их совместная работа касается сбора, хранения и...\nОпыт разработки на Python от 7 лет. - Опыт работы с реляционными СУБД (PostgreSQL). - Опыт работы с Docker. - Умение писать модульные...",
        "company": "Positive Technologies"
    },
    {
        "title": "Data Scientist (Core)",
        "url": "https://hh.ru/vacancy/69662529?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Отвечать за полный цикл внедрения алгоритмов - анализ и подготовка данных, прототипирование идей, создание production решений, работа с development командами над...\nPython, Vertica, Airflow, Git, Docker, Grafana, InfluxDB. У вас есть знание фундаментальной математике в том числе Теории вероятностей и математической...",
        "company": "ОООЭдСервер"
    },
    {
        "title": "Python-разработчик",
        "url": "https://hh.ru/vacancy/69107011?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывает тестовые процедуры с нуля, подбирает всё необходимое железо и автоматизирует его работу. Разрабатывает надёжный софт для программно-аппаратной валидации...\nСможете оформить свой python-код не хуже, чем популярные проекты на pypi.org, слышали про yapf и wemake-python. ",
        "company": "ОООСалютДевайсы"
    },
    {
        "title": "Data Engineer (Python) Middle-Senior",
        "url": "https://hh.ru/vacancy/69265532?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать и поддерживать цепочки процессов обработки и хранения данных. Писать MapReduce-операции на SQL и Python с использованием специализированных библиотек.\nОпыт промышленной разработки от 1,5 лет. Владение SQL, знание на базовом уровне Bash, Linux. Знание процессов бизнеса и разработки. ",
        "company": "Digital Nomads"
    },
    {
        "title": "Разработчик Python в команду Data&AI",
        "url": "https://hh.ru/vacancy/70591601?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Генерация YML-файлов для ДАГ-ов. Генерация DDL для деплоя модели (Python). Разработка универсального TPT-Extract и встраивание в ДАГ. ",
        "company": "ОООAxenix (ранее Accenture)"
    },
    {
        "title": "Middle+ backend python",
        "url": "https://hh.ru/vacancy/70089365?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка backend/server-side для сайта на Python Django. Разработка масштабируемых высоконагруженных решений. Создание новых компонентов, модулей системы. \nОпыт работы Python. Умение быстро разбираться в чужом коде. Знание любого web фреймворка, лучше django. Опыт работы с реляционными базами...",
        "company": "Stroyportal.ru - интернет-площадка"
    },
    {
        "title": "Программист Backend в Технический блок (Python, SQL)",
        "url": "https://hh.ru/vacancy/70743803?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Работа в VEON подразумевает соблюдение высокого уровня деловой этики, юридических обязательств, наших ценностей и Кодекса поведения, поддержки политик и процедур...\nОпыт Backend разработки не менее 3-х лет. ∙ Уверенное знание языка программирования Python, опыт использования фреймворков/библиотек. ∙ Опыт работы MySQL...",
        "company": "Beeline, ТМ"
    },
    {
        "title": "DevOps инженер",
        "url": "https://hh.ru/vacancy/70745065?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддержка и развитие Kubernetes. Построение CI/CD. Создание и поддержка сред разработки и тестирования. В ближайшие планы входят работы по...\nОпыт использования систем управления конфигурациями (ansible, saltstack). Опыт написания скриптов (bash, python) и приложений для автоматизации (go ). Знания и опыт...",
        "company": "iiko, Компания Aйко"
    },
    {
        "title": "Senior backend разработчик Python",
        "url": "https://hh.ru/vacancy/70894457?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Компания 3D Smile занимается производством элайнеров и разработкой уникального программного обеспечения для моделирования движения зубов и корней. \nОпыт 4+ лет на Python в качестве основного языка для production-разработки. Работа с фреймворками Flask \\ Django или схожими. ",
        "company": "ООО3DSmile"
    },
    {
        "title": "Python разработчик в CM.Expert (Яндекс Вертикали)",
        "url": "https://hh.ru/vacancy/70677409?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Вместе с нами решать сложные архитектурные вопросы. Выполнять обилие разных задач: продуктовые, которые приносят пользу пользователям, совместные задачи с ML...\nБольше трех лет работали с Python 3 с использованием асинхронного программирования. Имели дело с клиент-серверными приложениями и знаете, что...",
        "company": "Яндекс"
    },
    {
        "title": "DevOps-специалист",
        "url": "https://hh.ru/vacancy/69674804?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддерживать и развивать существующую инфраструктуру внутренних сервисов. Развивать существующую CI/CD. Взаимодействовать с командами разработчиков и тестировщиков, помогать им в...\nWindows на уровне уверенного пользователя. Bash, Python или другой скриптовый язык. Понимать принципы работы систем контроля версий, использовать Git. ",
        "company": "Jobers"
    },
    {
        "title": "Data Engineer",
        "url": "https://hh.ru/vacancy/69475611?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Построение высоконагруженных систем хранения больших данных. Выстраивание ETL процессов. Проектирование витрин данных. Выстраивание Pipeline разметки данных.\nОпыт работы с очередями (Kafka / RabbitMQ). Уверенное владение Python. Опыт работы с AirFlow/Luigi. Уверенное владение PySpark. Опыт разворачивания ETL...",
        "company": "КИБЕР-РОМ"
    },
    {
        "title": "Разработчик Python (Middle/Senior)",
        "url": "https://hh.ru/vacancy/70688454?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка backend для web и мобильных приложений. Создание API.\nОпыт работы в коммерческой разработке от 2х лет ( Python, Django), уверенная работа с DRF. Опыт разработки API. ",
        "company": "Sitronics Group"
    },
    {
        "title": "Machine Learning Engineer, Ozon Fresh",
        "url": "https://hh.ru/vacancy/70905395?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Высшее математическое или техническое образование. Опыт разработки на Python. Знание ООП (solid, grasp, ...). Знание Git. Знание SQL на уровне построения...",
        "company": "Ozon fresh"
    },
    {
        "title": "Fullstack разработчик (React / python)",
        "url": "https://hh.ru/vacancy/69760535?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Работа преимущественно на стороне frontend, но обязательны также базовые знания python. Написание новых сервисов. Поддержка имеющихся. Работать преимущественно с готовой...\nБазовое понимание работы backend и минимальный опыт на python. Адаптивная, резиновая верстка макетов по БЭМ. Опыт работы с state-management...",
        "company": "ОООКлаудкомсофтваре"
    },
    {
        "title": "Python Developer (Middle+)",
        "url": "https://hh.ru/vacancy/69576307?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка высоконагруженного проекта на django. Написание юнит-тестов. Коммуникация с менеджерами, командой FrontEnd и QA. Интеграция партнёрских сервисов.\nОтличные знания Python, Django, ORM, DRF. Хорошее знание SQL (join, индексы, триггеры), мы используем Postgres. Опыт работы с celery, docker...",
        "company": "Karta."
    },
    {
        "title": "Преподаватель компьютерных курсов для взрослых С++ ,С#, Python, JavaScript, г.Липецк",
        "url": "https://hh.ru/vacancy/70344838?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Весь методический материал уже есть, придумывать ничего не нужно!). Преподавание (лекционные и практические занятия) в группах до 16 человек в...\nВладение по отдельности или одновременно языками программирования: С++ ,С#, Python, JavaScript, HTML/CSS. - Ответственность, пунктуальность, желание делиться знанием и опытом. - ",
        "company": "Компьютерная Академия Top"
    },
    {
        "title": "Специалист по автотестированию (Python)",
        "url": "https://hh.ru/vacancy/70901737?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать инфраструктуру автотестирования продукта в областях сетевых технологий и кибербезопасности. Писать автотесты с использованием фреймворка pytest и его производных. \nУмение читать код (хотя бы три языка из списка: Python / C / C++ / Rust / OCaml / TypeScript / Bash / Make). Опыт работы с...",
        "company": "BI.ZONE Направление Разработка"
    },
    {
        "title": "Junior C++ разработчик алгоритмов геометрического моделирования",
        "url": "https://hh.ru/vacancy/70557857?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Программист на языке C++ для разработки и реализации алгоритмов вычислительной геометрии моделирования 3D тел в машиностроении и архитектуре и...\nВ качестве кандидатов мы готовы рассмотреть в том числе студентов без опыта работы в промышленной разработке ПО, имеющих хорошую математическую...",
        "company": "Ледас"
    },
    {
        "title": "Back End Engineer (Python)",
        "url": "https://hh.ru/vacancy/69721145?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Todo: Code extract&load marketing data from 1000+ sources (facebook api, google api, pinterest api … ). Build and improve ELT...\nAt least 3 years of experience in a similar position. Experience with microservices architecture. Framework. PostgreSQL, ClickHouse, etc. ",
        "company": "Improvado"
    },
    {
        "title": "Ведущий разработчик Python",
        "url": "https://hh.ru/vacancy/70036428?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проектирование системы личного кабинета и непосредственное участие в разработке. Сопровождение существующих систем на языке Python. Работа в команде и взаимодействие...\nОпыт работы разработчиком от 3-х лет, опыт в роли ведущего разработчика. Python (в т.ч. знания ООП, декораторов, перегрузки...",
        "company": "билайн: ИТ, Data, Digital"
    },
    {
        "title": "Planner Software Инженер (C++/Python)",
        "url": "https://hh.ru/vacancy/66913838?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Имплементация алгоритмов/моделей Planer блока ADAS (в последующем беспилотного автомобиля). Оптимизация моделей. Изучение SOTA. Деплой в симулятор и оценка алгоритма. \nЗнание C++. Знание Python. Знание ML/DL. Хорошая математическая подготовка. Работа с git, bash, docker. Умение реализовывать статьи. ",
        "company": "АОКама"
    },
    {
        "title": "Junior разработчик/программист в Python",
        "url": "https://hh.ru/vacancy/70355566?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка плагинов для автоматизации работы проектировщиков в программе Autodesk Revit. - Среда разработки: visual studio.\nНаличие опыта не обязательно. Обязательно знание: Python, gitlab. - Платформа: NET Framework. - Не обязательно , но желательно знание Revit API,C# Revitpythonshell...",
        "company": "ТООЭкопроект"
    },
    {
        "title": "Middle Python developer",
        "url": "https://hh.ru/vacancy/70097265?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Написание чистого, понятного кода. Ведение (исправление багов, модернизация, улучшение) разработанного микросервиса.\nУверенное знание Python3: SQLAlchemy, pymysql, json, (io)pika. Опыт работы с ОС семейства Linux, умение запустить свой код. ",
        "company": "ОООСелфсек"
    },
    {
        "title": "Разработчик python (Middle/Senior)",
        "url": "https://hh.ru/vacancy/70698542?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Интересные проекты и современный стек (Celery, FastAPI, Tornado, PostgreSQL, RabbitMQ, Docker. Для разработки используем VS Code, Gitlab, Jira, Confluence). \nНестандартные решения и желание экспериментировать. Успешный опыт в разработке на Python 3.* (скоринговых карт, анти-фрод решений, интеграционной шины). ",
        "company": "Eqvanta"
    },
    {
        "title": "Учитель программирования",
        "url": "https://hh.ru/vacancy/70372619?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проведение индивидуальных онлайн уроков с учениками от 6 до 17 лет продолжительностью 55 минут. Подготовка мини отчета о проведенных уроках.\nВам будет необходимо пройти онлайн тестирование: пройти вводный курс по Python и Snap у нас на платформе. Быстрая обучаемость. ",
        "company": "ОООПРОГКИДС"
    },
    {
        "title": "Team Lead Python",
        "url": "https://hh.ru/vacancy/69431363?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать и внедрять нашу новую архитектуру платформы в сотрудничестве с архитекторами и другими руководителями. Применять передовой опыт проектирования во всех...\nБольшой опыт разработки программного обеспечения на стороне сервера с использованием Python и асинхронных фреймворков. Опыт проектирования и архитектуры микросервисов. ",
        "company": "Дартс рекрутинг сервисез"
    },
    {
        "title": "Python BackEnd Developer",
        "url": "https://hh.ru/vacancy/70534476?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Помогать в избавлении от legacy: окончательный уход от монолитной архитектуры в некоторых местах и переезд с Python2 на Python...\nОпыт построения высоконагруженных сервисов и обеспечения их доступности и надёжности. Разрабатывать на Python от 3-х лет. Понимать и применять...",
        "company": "ОООЗвук"
    },
    {
        "title": "Разработчик бэкэнд (Python)",
        "url": "https://hh.ru/vacancy/69708300?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Опыт в использовании Python от 3 лет. - Опыт работы с PostgreSQL и MongoDB от 3 лет, в том числе проектирования...",
        "company": "АНО Инфокультура"
    },
    {
        "title": "Data Scientist, Поиск и Каталог",
        "url": "https://hh.ru/vacancy/67411146?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Создание и улучшение алгоритмов ранжирования товаров на сайте (learning to rank). ML-задачи от идеи до реализации в production: изучение...\nАвтоматическое понимание и обогащение текстовых запросов пользователей. Хорошее знание Python. Опыт решения production DS-задач в интернет-бизнесе (желателен опыт...",
        "company": "Ozon Информационные технологии"
    },
    {
        "title": "R Developer",
        "url": "https://hh.ru/vacancy/68790008?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Цель продукта – прогнозирование кредитных рисков. Работаем удаленно на территории Польши, Грузии, Казахстана.\nАнглийский язык intermediate+ (общаемся с заказчиком).",
        "company": "HiQo Solutions"
    },
    {
        "title": "Разработчик Python (техлид)",
        "url": "https://hh.ru/vacancy/69657375?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Развитие и сопровождение продукта в части реализации задач, связанных с: Разработкой требуемого функционала. Доработкой частей существующего кода (рефакторинг, исправление дефектов). \nЗнания\\опыт: Python3. Git. PostgreSQL. Linux. REST. ООП. Знания/опыт: Asyncio. Bash. Docker. OpenStack. Nginx. Unit tests. Clickhouse. MongoDB. ",
        "company": "АОИнфоТеКС"
    },
    {
        "title": "Python разработчик (to Cyprus / Armenia)",
        "url": "https://hh.ru/vacancy/70427816?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Конструктивные особенности и решения с учетом будущего использования и всех других ограничений. Участвовать в дизайне и код-ревью. \nОпыт работы с Python от 3 лет. Умение писать понятный код. Базовое понимание сети (HTTP – обязательно). Готовность решать сложные и...",
        "company": "GlobalCareer"
    },
    {
        "title": "Python developer на игровой проект Sidus Heroes",
        "url": "https://hh.ru/vacancy/70469743?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка новых и доработка существующих игровых механик в соответствии с геймдизайн-документацией и планом разработки. Разработка API для взаимодействия с...\nХорошее знание Python и опыт коммерческой разработки на нём не менее 2х лет. Опыт работы с фреймворками для создания...",
        "company": "PlayDisplay (Плей Дисплей)"
    },
    {
        "title": "Full-stack разработчик (Python/JS)",
        "url": "https://hh.ru/vacancy/70586572?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать внутренние web-сервисы на Python. Взаимодействие в команде по внутренней методологии разработке ПО (Scrum). Разрабатывать удобные инструменты управления платформой...\nОбщий опыт работы в должности Back-end разработчика от 3 лет. Хорошие знания Python 3. Знание одного из веб-фреймворков...",
        "company": "Enjoypro"
    },
    {
        "title": "Python middle+ developer",
        "url": "https://hh.ru/vacancy/70089376?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка backend/server-side для сайта на Python Django. Разработка масштабируемых высоконагруженных решений. Создание новых компонентов, модулей системы. \nОпыт работы с python обязателен. Умение быстро разбираться в чужом коде. Обязателен опыт работы с django. Опыт работы с реляционными...",
        "company": "Stroyportal.ru - интернет-площадка"
    },
    {
        "title": "Senior Product Data Analyst в Поиск и рекомендации (работа в РФ)",
        "url": "https://hh.ru/vacancy/70821224?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Анализ различных источников данных с целью выявления новых возможностей для развития продукта. Умение анализировать и визуализировать данные с помощью Python. \nОпыт использования SQL. Умение обрабатывать и структурировать большие массивы информации. Умение решать аналитические задачи с использованием Python или других языков...",
        "company": "Леруа Мерлен. Центральный офис"
    },
    {
        "title": "Senior Python developer",
        "url": "https://hh.ru/vacancy/70911559?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Взаимодействие с командой из США (ежедневные созвоны).\n5+ лет опыта разработки. Опыт работы с Python от 3-х лет. Уверенное знание реляционных БД. Участие в крупном...",
        "company": "Nitka Technologies"
    },
    {
        "title": "Ведущий разработчик отдела интеграции (python)",
        "url": "https://hh.ru/vacancy/66071239?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Умение пользоваться стандартной документацией (нужной версии) python, Django и поиск возможных решений в поисковых системах. Использование и актуализация (при необходимости...\nУверенные знания и опыт работы с Python 3.5+, Git. Понимание многопоточного/многопроцессного программирования в Python. Умение работать с...",
        "company": "Группа компаний Астра"
    },
    {
        "title": "Преподаватель в школу программирования «Алгоритмика»",
        "url": "https://hh.ru/vacancy/70797522?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Провести их через увлекательный мир создания приложений, мультфильмов, сайтов, игр и других проектов по нашим подробным материалам. Домашние задания проверяются...\nОбучать ребят 6-17 лет от базовых навыков печати, до программирования на языке Python собственных проектов.",
        "company": "Алгоритмика::Санкт-Петербург Фрунзенский р-н (ИП Бутаков Анатолий Николаевич)"
    },
    {
        "title": "Senior Python разработчик",
        "url": "https://hh.ru/vacancy/68918046?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать API для мобильных, веб-приложений и внутренних сервисов на Python. Интегрироваться с партнерами и внутренними системами банка. \nОпыт разработки на Python 3.Х. Понимание механики языка Python и сопутствующих инструментов (pytest, mypy, poetry, flake8). ",
        "company": "Домклик"
    },
    {
        "title": "Senior developer (Python)",
        "url": "https://hh.ru/vacancy/70116659?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Фишинг и мошеннические схемы. - Сливы персональных данных. - Утечки токенов и паролей через открытые репозитории. - Вредоносные файлы. Нам необходим человек для...\nОпыт коммерческой разработки python более 3 лет. - Опыт разработки веб-приложений (REST API). - Опыт работы с реляционными базами данных - проектирование...",
        "company": "BI.ZONE Направление Разработка"
    },
    {
        "title": "Data Scientist",
        "url": "https://hh.ru/vacancy/70580362?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Прототипирование и доведение своих решений до продакшена на python. Полная поддержка своих моделей: от написания запроса для выгрузки обучающей выборки...\nЗнание принципов работы моделей для обработки текста. Уверенное владение Python (numpy, scipy, pytorch, sklearn, jupyter). Желателен опыт работы с различными...",
        "company": "ОООСимбирСофт"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/68429577?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка компонентов управления сетевой подсистемой, контейнерами, виртуализацией. Развитие программной архитектуры существующего продукта, принятие решений в выборе технологий, расчет производительности и...\nОпыт коммерческой разработки от 3 лет. Знание Python > 3.5, ООП и паттерны проектирования, понимает принципы многопоточности и знает, что...",
        "company": "Ай-Теко (I-Teco)"
    },
    {
        "title": "Программист Python",
        "url": "https://hh.ru/vacancy/69346363?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в масштабных проектах: Высоконагруженные информационные системы, системы управления инфраструктурой городов на основе машинного обучения, системы потокового распознавания аудио и...\nPython (будет плюсом знание Flask и SQLAlchemy). PostgreSQL. Git. OC Linux. Знание HTML, css, scss, javascript -знание одного из JS...",
        "company": "АОК-ТЕХНОЛОГИИ"
    },
    {
        "title": "Python Middle Backend Developer",
        "url": "https://hh.ru/vacancy/69826026?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в проектировании архитектуры системы. Разработка микросервисов и участие в создании высоконагруженных систем (10.000 пользователей в сутки). \nКоммерческая разработка на Python от 2-х лет. Опыт написания микросервисов, понимание микросервисной архитектуры. Опыт работы с MySQL/Postgres. ",
        "company": "ОООДэстэн Партнерс"
    },
    {
        "title": "Senior Data Scientist",
        "url": "https://hh.ru/vacancy/70296986?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проведение аналитических работ в своем направлении. Построение моделей ML, стат анализа. Выявлять проблемы и находить узкие места с которыми сталкивается...\nВысшее образование, желательно математическое / ИТ / физика / статистика. Знания SQL, Python (уровень не ниже middle) и библиотек для ML (Scikit-learn...",
        "company": "Группа Самолет"
    },
    {
        "title": "Middle Python Developer",
        "url": "https://hh.ru/vacancy/70456814?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участвовать в разработке продукта на всех этапах, проводить Code Review. Участвовать в выработке технических и архитектурных решениях.\nЕсть коммерческий опыт работы на Python (Django) от года. Уверенно используешь Django ORM. Имеешь знания и практический опыт с реляционными...",
        "company": "Fojin"
    },
    {
        "title": "Специалист по углубленной аналитике данных (Data scientist)",
        "url": "https://hh.ru/vacancy/70118981?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Исследование данных из различных корпоративных источников для извлечения ценной для бизнеса информации. Формирование требований к источникам данных, необходимых для реализации...\nстатистическими пакетами (SPSS, STATISTICA и т.п.), библиотеками R и Python для углубленной аналитики и машинного обучения. Практический опыт извлечения...",
        "company": "А1. Информационные технологии, телеком"
    },
    {
        "title": "Python Developer в омниканальные контактные центры",
        "url": "https://hh.ru/vacancy/70362524?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в проектировании, разработке, профилировании и оптимизации микросервисов. Участие в проведении Code Review. Проектирование, разработка и тестирование сервисов. \nЗнание паттернов программирования, алгоритмов и структур данных. Опыт коммерческой разработки на Python (Django/Flask). Опыт разработки микросервисной архитектуры. ",
        "company": "Сбер для экспертов"
    },
    {
        "title": "Аналитик Python",
        "url": "https://hh.ru/vacancy/70411295?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Подготовка оперативной отчетности. Системный анализ. Подготовка материала для создания презентации по проекту. Автоматизация обработки всевозможных отчетов.\nВысшее образование законченное. Опыт работы от года в качестве аналитика. Знание Python обязательно. Аналитический склад ума, абстрактное мышление, умение сопоставлять...",
        "company": "Ресурсный центр Департамента здравоохранения города Москвы"
    },
    {
        "title": "Senior Python developer",
        "url": "https://hh.ru/vacancy/70911561?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Взаимодействие с командой из США (ежедневные созвоны).\n5+ лет опыта разработки. Опыт работы с Python от 3-х лет. Уверенное знание реляционных БД. Участие в крупном...",
        "company": "Nitka Technologies"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/70413199?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Доработка сервиса на python. Написание тестов. Разработка новых изменений и исправление багов согласно производственному процессу. Работа со смежными командами: проработка...\nУверенное знание python, в частности aiohttp/fastapi. Написание тестов с pytest. Опыт работы с elasticsearch. Умение читать javascript. Владение git. ",
        "company": "Сбер для экспертов"
    },
    {
        "title": "SQL разработчик",
        "url": "https://hh.ru/vacancy/70052756?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка процедур обработки данных и автоматизации процессов взыскания. Участие в развитии в проектировании DWH CLickHouse. Автоматизация скоринговых и оценочных моделей. \n...функций желательно или чтобы было желание развиваться. Оптимизация сложных запросов. желательно. Языки программирования Python как преимущество желательно, но не обязательно.",
        "company": "IDF Eurasia"
    },
    {
        "title": "Руководитель Backend разработки (Python)",
        "url": "https://hh.ru/vacancy/70152181?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Управление командами от 50 человек. Лидирование и непосредственное участие в формировании архитектуры общих библиотек. Форматирование и актуализация структуры собеседования новых...\nОпыт разработки Python более 5 лет. Опыт управления командой/командами более 1 года. Управление командами от 50 человек. ",
        "company": "Группа Самолет"
    },
    {
        "title": "Middle Python Developer (Atlassian)",
        "url": "https://hh.ru/vacancy/70669923?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка и поддержка высоконагруженных микросервисов. Написание юнит-тестов и тестирование собственного кода на соответствие критериям, принятым на проекте. \nПонимание ООП, паттернов проектирования и алгоритмов. Отличное владение Python, умение работать с асинхронным кодом. Опыт работы с реляционными базами данных. ",
        "company": "Cloud"
    },
    {
        "title": "Data Engineer (Python), remote",
        "url": "https://hh.ru/vacancy/70195991?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Develop analytical tools across numerous DeFi projects. Study DeFi protocols to analyze investment opportunities. Build data pipelines from multiple blockchain...\nExperience in Python including libraries Pandas, Flask, Django, asyncio, plotly. Experience with web3 Python library. Advanced knowledge in PostgreSQL. ",
        "company": "Wise Wolves Group"
    },
    {
        "title": "Ведущий AI/ML инженер",
        "url": "https://hh.ru/vacancy/70441386?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Мы используем AI/ML решения, чтобы обеспечить качество контроля, физически недоступное человеку. Участвовать в анализе требований к решению. \nЛидерство в рамках ML/AI и автоматизации: Качества личные: Качества профессиональные: Опыт разработки (участии в) промышленных IT продуктов и понимание...",
        "company": "SteadyControl"
    },
    {
        "title": "Ведущий Python разработчик (проект INAC)",
        "url": "https://hh.ru/vacancy/69983869?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Развитие сервисов и платформ BSS систем широкополосного доступа интернет. Взаимодействие с коллегами по вопросам развития проекта. Проведение code review коллег...\nОпыт бэк разработки на Python от 4 лет. Опыт работы с веб фреймворками. Уверенное знание SQL. Опыт разработки REST – сервисов.",
        "company": "билайн: ИТ, Data, Digital"
    },
    {
        "title": "Senior Python Программист",
        "url": "https://hh.ru/vacancy/68678760?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка высоконагруженных распределенных систем и систем конфигурации и деплоймента этих систем. Интеграции систем между собой. Написание юнит-тестов для существующих...\nУстойчивое знание языка Python3.8 и его стандартной библиотеки. Опыт работы с Flask или Django, Docker. Желание разбираться в...",
        "company": "ОООНеро Электроникс"
    },
    {
        "title": "Преподаватель курса \"Python-разработчик\"",
        "url": "https://hh.ru/vacancy/69946358?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проведение занятий в соответствии с программой Учебного центра в группе и индивидуально. Поддержание актуальности читаемого курса. Разработка тематических планов и...\nОпыт преподавательской деятельности от 2-х лет. Уверенное владение Python. Наличие портфолио работ. Пунктуальность, ответственность, исполнительность. Грамотная речь. ",
        "company": "ЧУДПО Учебный центр «Дельфа»"
    },
    {
        "title": "Преподаватель по курсу Python",
        "url": "https://hh.ru/vacancy/70270438?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проверять работы студентов курсов по курсу Python. Давать обратную связь студентам по выполненным заданиям в письменном виде и оценивать их...\nКоммерческий опыт работы с python3.6 и выше от года. Базовые навыки работы с HTML, CSS, jOuery, JavaScript. ",
        "company": "Skillbox"
    },
    {
        "title": "Преподаватель на курс \"Основы IT для непрограммистов\"",
        "url": "https://hh.ru/vacancy/70028097?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в записи онлайн видеокурсов (теоретическая и практическая части). Практика, обратная связь со студентами и проверка домашних работ.\nВладение одним или несколькими языками программирования: Python; HTML, CSS, JS; Java; SQL. Опыт работы с основными инструментами программиста - Git, Docker...",
        "company": "Proglib"
    },
    {
        "title": "Разработчик базы данных",
        "url": "https://hh.ru/vacancy/68502671?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проектирование и разработка хранилища метрик в БД аналитической системы, Postgres/GreenPlum/Hadoop. Разработка ETL-потоков, Airflow, Python. Разработка алгоритмов расчёта...\nОпыт работы в аналогичном направлении от 3-х лет. Знание инструментов аналитики и автоматизации – отличное знание SQL, Excel. ",
        "company": "билайн: ИТ, Data, Digital"
    },
    {
        "title": "Middle Python Developer (блок навигации)",
        "url": "https://hh.ru/vacancy/69778861?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Задачи: Написание сервисов, выполняющих python - скрипты в Armbian на ARM - вычислителе. Скрипты направлены на создание удобного UI для навигационного блока...\nОбязательные навыки. Python: умение работать с потоками; использование логирования (настройка уровня логирования, ротация логов по превышению объема). Уверенное владение системами...",
        "company": "Cognitive Pilot"
    },
    {
        "title": "Преподаватель онлайн-школы программирования для подростков",
        "url": "https://hh.ru/vacancy/70018854?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "В том числе студент, выпускник или аспирант ведущего вуза. Имеешь опыт в области программирования (Python), опыт работы с Git. ",
        "company": "MAXIMUM EDUCATION"
    },
    {
        "title": "Python разработчик",
        "url": "https://hh.ru/vacancy/69988089?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддержка и развитие приложения бизнес-отчетности (Django + Superset) для внутренних потребителей. Поддержка и развитие ряда приложений по интеграции со...\nОпыт работы с Python – не менее 3 лет. SQL – продвинутый уровень владения. Английский не ниже Pre-Intermediate. Уверенное владение UML. ",
        "company": "ANCOR"
    },
    {
        "title": "Преподаватель программирования для детей",
        "url": "https://hh.ru/vacancy/70581381?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Взаимодействие с методистом школы по рабочим вопросам.\nЕсть опыт в преподавании scratch или roblox.",
        "company": "ИПКамалетдинов Дамир Рамилевич"
    },
    {
        "title": "Python developer (Middle/Senior)",
        "url": "https://hh.ru/vacancy/69982983?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Непосредственное участие в проектировании, анализе и разработке технических решений вместе со всей командой. Улучшение и оптимизация существующего кода. \nPython - требуемый опыт работы с реальными проектами от 3-х лет. Опыт написания модульных тестов. Необходим, хотя бы, минимальный опыт...",
        "company": "Digital Security"
    },
    {
        "title": "Python developer",
        "url": "https://hh.ru/vacancy/68597229?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать backend на python. - Писать unit-тесты. - Следить за качеством кода на проекте, предлагать улучшения.\nЗнания, опыт коммерческой и командной разработки на python oт 2-х лет. - Уверенные знания Python 3. - Опыт работы с Django...",
        "company": "EvoSoft"
    },
    {
        "title": "Python-разработчик в Яндекс Диск",
        "url": "https://hh.ru/vacancy/67810506?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать быстро растущую real-time распределённую файловую систему. Разрабатывать продуктовую и бизнес-логику. Создавать и внедрять технологии и механизмы обработки...\nЗанимались бэкенд-разработкой на любом объектно-ориентированном языке. Понимаете принципы построения распределённых отказоустойчивых систем. Умеете тестировать собственный код и работать...",
        "company": "Яндекс"
    },
    {
        "title": "QA Intern - Automation testing",
        "url": "https://hh.ru/vacancy/67363507?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Automation tests development. Running tests and analyzing results. Setting up and supporting environment for running automated tests. Communication with the...\nBasic knowledge of any OOP programming (Java, C# and Python are the ones we use the most). Basic skills with...",
        "company": "a1qa"
    },
    {
        "title": "DevOps engineer \\ Девопс инженер (удалённо)",
        "url": "https://hh.ru/vacancy/70230966?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Сопровождение инфраструктуры текущих проектов. Настройка и развитие CI\\CD процессов на базе GitLab. Автоматизация рутинных процессов. Консультирование разработчиков. \nОпыт автоматизации рутинных процессов на скриптовых языках bash/python/etc. Знание технологий виртуализации и контейнеризации, опыт работы с docker/docker...",
        "company": "FOXY WAY"
    },
    {
        "title": "Python-разработчик",
        "url": "https://hh.ru/vacancy/69312008?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать микросервисное решение на Python. Применять лучшие практики при реализации продукта. Плотное взаимодействие с другими участниками команды (аналитики, фронтенд разработчики.. ), \nОпыт коммерческой разработки на Python от 2х лет. Опыт работы с django, flask, fastApi, SQLAlchemy, Alembic, aiokafka, aiobotocore, asyncio. ",
        "company": "Сбер. IT"
    },
    {
        "title": "Senior backend разработчик Python",
        "url": "https://hh.ru/vacancy/70894238?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Компания 3D Smile занимается производством элайнеров и разработкой уникального программного обеспечения для моделирования движения зубов и корней. \nОпыт 4+ лет на Python в качестве основного языка для production-разработки. Работа с фреймворками Flask \\ Django или схожими. ",
        "company": "ООО3DSmile"
    },
    {
        "title": "Тестировщик на Python, ReactJS",
        "url": "https://hh.ru/vacancy/70671227?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "выбор необходимых тест-кейсов и инструментов. - разработка средств автоматизации тестирования. - проведение автоматического и ручного тестирования. - поддержание в актуальном состоянии тестовой...\nопыт по созданию сценария тестирования. - основы: программирования, протокола HTTP, HTML и CSS. - умение работать с инструментами автоматического тестирования (например: python...",
        "company": "А-Контракт"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/69203828?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Работа в роли разработчика в Agile-команде от 2-х лет. Создавать сервисы, участвовать в реализации архитектурных решений. \nУверенные знания языка и библиотек Python. Отличное знание ООП, различных алгоритмов и структур данных. Опыт работы с SQL (Oracle/Postgres). ",
        "company": "BIV"
    },
    {
        "title": "Аналитик",
        "url": "https://hh.ru/vacancy/70025184?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Развитие аналитических моделей на Excel/VBA/Python. Обработка и анализ данных по имеющимся портфелям. Формирование аналитических отчетов. Разработка предложений для...\nПродвинутый пользователь Excel, VBA. Владение Python: хорошее знание pandas, основы ООП. Способность разобраться в чужом коде VBA/Python. ",
        "company": "ОООРегионКонсалт"
    },
    {
        "title": "Python Developer - разработчик",
        "url": "https://hh.ru/vacancy/69725990?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Адекватное оценивание сроков разработки задач.\nИмеешь опыт реальной работы с высоконагруженными проектами. Есть опыт работы с большими базами данных, понимание о том, как их хранить...",
        "company": "TrafficShark"
    },
    {
        "title": "Python Developer",
        "url": "https://hh.ru/vacancy/70728541?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Creating clean, well-documented, maintainable, testable and scalable code. Ensuring high-quality solutions produced through automated testing and monitoring code...\nCommercial Python development experience for 4+ years. Experience with a single web framework (Django or Flask). Good knowledge of...",
        "company": "Andersen"
    },
    {
        "title": "Разработчик (JS, Python)",
        "url": "https://hh.ru/vacancy/70343886?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Сбор и формализация требований заказчика. Анализ и работа с данными, создание загрузчиков. Создание дашбордов на платформе Visiology. Участие в разработке...\nПродвинутые навыки Excel. Знание SQL (желательно). Навыки обработки данных в Python Pandas (или с помощью аналогичных инструментов) будут преимуществом. ",
        "company": "Национальный исследовательский университет Высшая школа экономики"
    },
    {
        "title": "Программист Perl",
        "url": "https://hh.ru/vacancy/67617122?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка инфраструктурных сервисов. Разработка вэб-приложений (в основном backend c RESTful API). Интеграция с внешними системами. Написание тестов. Документирование решений.\nЗнание и/или опыт работы с другими языками программирования - Python, C++, JS. Опыт работы с большими объемами данных. ",
        "company": "Internest"
    },
    {
        "title": "Senior/Lead Python-разработчик",
        "url": "https://hh.ru/vacancy/69941479?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Задачи с высоким уровнем ответственности: предстоит проектировать архитектуру, реализовывать бизнес-логику, самостоятельно принимать решения, запускать сервисы с необходимым уровнем качества. \nГибкость: продукты Контура постоянно адаптируются под рынок и пользователей, нужно уметь работать в меняющихся условиях.",
        "company": "Контур"
    },
    {
        "title": "QA automation (Python)",
        "url": "https://hh.ru/vacancy/70672728?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка автоматизированных UI и API тестов на python. Интеграция проектов автотестов в CI (teamCity). Интеграция автотестов с Test IT(проставление...\nОпыт тестирования веб-приложений (SPA & Web API). Опыт написания автотестов (Python + Selenium WD). Опыт работы с системами контроля версий...",
        "company": "ООООНЭЛИЯ"
    },
    {
        "title": "Python-разработчик (VK рекламные технологии)",
        "url": "https://hh.ru/vacancy/70531151?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка бэкендной части веб-интерфейса рекламной системы. Развитие API. Развитие системы обработки статистики. Оптимизация работы высоконагруженного проекта.\nОпыт разработки на Python ― от 2 лет. Отличное знание SQL. Знание основных сетевых web-протоколов, как минимум HTTP(S). ",
        "company": "VK, Рекламные технологии"
    },
    {
        "title": "QA automation engineer (Python)",
        "url": "https://hh.ru/vacancy/69678610?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "7 лет разработки. 80+ сотрудников. 100+ заказчиков. 1500+ инсталляций. 1020+ внедрений. Создание и поддержание сценариев автоматизированного...\nОпыт работы в стеке Pytest + Selenium. Уверенная работа с Git. Опыт работы с Allure. Базовые знания Linux. ",
        "company": "ОООСАЙБЕРЛИМФА"
    },
    {
        "title": "Middle Python Developer / Data Engineer (Python) в команду ML Space Data Catalog",
        "url": "https://hh.ru/vacancy/70696785?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка и поддержка существующих решений, связанных с ETL/ELT-процессами. Участие в проектировании, разработке и поддержке высоконагруженных сервисов/микросервисов. \nЗнакомство с Kubernetes, хорошие навыки работы с Docker. Отличное владение Python, умение работать с асинхронным кодом. Знание стека Big Data...",
        "company": "Cloud"
    },
    {
        "title": "Junior Python разработчик",
        "url": "https://hh.ru/vacancy/70212155?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка кода, направленного на полную или частичную автоматизацию различных бизнес-процессов Компании. Тестирование и установка разработанных в подразделении решений. \nИмеет высшее образование, желательно в области ИТ. Знание языка программирования Python. Знает linux на уровне пользователя. Знаком с СУБД SQL. ",
        "company": "ПАОМегаФон, IT"
    },
    {
        "title": "Инженер-программист",
        "url": "https://hh.ru/vacancy/70044563?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка и верификация математических моделей цифровых двойников. Разработка/доработка программного обеспечения для конвертации математических моделей в стандарт FMI/FMU. \nВысшее техническое образование. Знание математического анализа и статистики на уровне ВУЗа. Базовые знания о PLM - системах. Знание Windows и Linux...",
        "company": "АОНаучно-исследовательский институт железнодорожного транспорта (ВНИИЖТ)"
    },
    {
        "title": "Middle Python Developer в команду контакт-центра сервиса путешествий",
        "url": "https://hh.ru/vacancy/69565083?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Активно используем очереди сообщений Kafka. — Все приложения, которые работают на бою, упаковываются в Docker и выкладываются через существующий CI/CD. — \nОт вас нужно: — От двух лет разработки на Python. — Опыт работы с реляционными базами (мы используем Clickhouse/MySQL/MariaDB). — ",
        "company": "Туту.ру"
    },
    {
        "title": "Python разработчик (проект Лаборатория измерительных систем)",
        "url": "https://hh.ru/vacancy/70792194?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Измерительная система — это программно-аппаратный комплекс, состоящий из различных датчиков, программного обеспечения, нейронных сетей и моделей. Данные с компонентов системы...\nХорошие знания Python, умение писать на нем качественный, понятный и масштабируемый код. Знание паттернов проектирования и основ алгоритмов, понимание матричных...",
        "company": "Северсталь.  Металлургические предприятия"
    },
    {
        "title": "Python разработчик (проект Лаборатория измерительных систем)",
        "url": "https://hh.ru/vacancy/70792303?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Измерительная система — это программно-аппаратный комплекс, состоящий из различных датчиков, программного обеспечения, нейронных сетей и моделей. Данные с компонентов системы...\nХорошие знания Python, умение писать на нем качественный, понятный и масштабируемый код. Знание паттернов проектирования и основ алгоритмов, понимание матричных...",
        "company": "Северсталь.  Металлургические предприятия"
    },
    {
        "title": "Инженер по автоматизированному тестированию/QA Automation Engineer (Python)",
        "url": "https://hh.ru/vacancy/70476179?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка автоматических тестов (API, интеграционных, нагрузочных, производительности), развитие и улучшение имеющейся системы автотестирования. Интеграция автотестов тестов в CI/CD. \nОпыт QA Automation от 1 года. Опыт написания автотестов на Python, хорошее знание Python. Знание ОС Linux на уровне продвинутого...",
        "company": "ООООснова Лаб"
    },
    {
        "title": "DevOps инженер",
        "url": "https://hh.ru/vacancy/68452185?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддержки других приватных и публичных облаков (Big 3, Я.Облако, MCS). Интеграции с системами мониторинга, логирования, резервного копирования. Поддержки кластерных решений. \nПонимание принципов построения отказоустойчивых БД. Базовые знания PostgreSQL. Знание Python на базовом уровне или выше, знание Docker. Опыт работы с...",
        "company": "Postgres Professional"
    },
    {
        "title": "Middle/Senior DevOps engineer",
        "url": "https://hh.ru/vacancy/70690088?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "По хранению, размещению, обработке и проигрыванию видеоконтента: пользовательский, коммерческий, стриминговый контент. Стриминговые сервисы. Мобильные приложения, решения для SmartTV. Игровые проекты. \nОпыт работы с высоконагруженными сервисами. Владение bash/python/go. Выстраивание IaC c помощью ansible. Настройка CI/CD процессов в gitlab. ",
        "company": "КИБЕР-РОМ"
    },
    {
        "title": "Преподаватель курсов программирования Python для детей",
        "url": "https://hh.ru/vacancy/70278233?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Ценим организованную работу, но люди и их взаимодействие важнее.\nНаше качество, как любовь — безусловное. Любить преподавать. Это может и не скил, но важно. Уметь объяснять сложные вещи простыми словами.",
        "company": "Алгоритмика::Ногинск и Электросталь (ИП Ус Оксана Георгиевна)"
    },
    {
        "title": "Мейнтейнер (DevOps/ Инженер Linux)",
        "url": "https://hh.ru/vacancy/69859551?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Работать с пакетной базой, пересобирать программную платформу, обновлять пакеты и исправлять ошибки.\nВладение скриптовыми языками программирования (минимум Bash). Знание C, Python. Понимание устройства современных линукс-дистрибутивов. Опыт сборки RPM-пакетов. ",
        "company": "UserGate"
    },
    {
        "title": "Программист Python",
        "url": "https://hh.ru/vacancy/70161478?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка новых информационных сервисов и систем. Проектирование и разработка API. Программирование сценариев обзвона для робота. Поддержка и доработка существующих проектов. \nОпыт проектирования реляционных БД. Требования: Высшее образование. Опыт программирования на Python. Умение писать тесты. Опыт работы с Backend фреймворками Flask...",
        "company": "ГБУ МО МОМИАЦ"
    },
    {
        "title": "Разработчик",
        "url": "https://hh.ru/vacancy/66529705?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Работа со стеком технологий: Python 3.x, Pytest, PostgreSQL 12+, JS/React 17, Ansible 2.9+. \nОпыт промышленной back-end разработки (Full-stack или опыт front-end будет плюсом). Хорошее знание языка Python, опыт промышленной разработки...",
        "company": "Скала^р"
    },
    {
        "title": "Senior/Lead Python-разработчик",
        "url": "https://hh.ru/vacancy/69941488?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Задачи с высоким уровнем ответственности: предстоит проектировать архитектуру, реализовывать бизнес-логику, самостоятельно принимать решения, запускать сервисы с необходимым уровнем качества. \nГибкость: продукты Контура постоянно адаптируются под рынок и пользователей, нужно уметь работать в меняющихся условиях.",
        "company": "Контур"
    },
    {
        "title": "Автор курсов по Python",
        "url": "https://hh.ru/vacancy/68920563?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Какие курсы нужно актуализировать: Разработка на фреймворке Django ru.hexlet.io/courses/python-django-basics. Обучение в процессе работы над контентом: структурировать...\nВеб-разработка (Flask) ru.hexlet.io/courses/python-flask. Хорошее общее понимание Computer Science. Опыт в сфере более 3 лет. ",
        "company": "Hexlet"
    },
    {
        "title": "Python разработчик (Middle / Senior)",
        "url": "https://hh.ru/vacancy/70506680?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Х5 Технологии — это отдельная бизнес-единица Х5 Group, которая отвечает за создание комплексных цифровых решений для бизнес-единиц...\nОпыт создания приложений и разработки API на Python, используя веб-фреймворки и библиотеки (Django / Flask или Asyncio / Aiohttp / FastAPI и...",
        "company": "X5 GROUP, Девелопмент"
    },
    {
        "title": "Senior / Middle+ QA Automation Backend (python)",
        "url": "https://hh.ru/vacancy/69086325?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "По хранению, размещению, обработке и проигрыванию видеоконтента: пользовательский, коммерческий, стриминговый контент. Стриминговые сервисы. Мобильные приложения, решения для SmartTV. Игровые проекты. \nУмение работы с системами контроля версий. Хорошее знание языка Python. Умение использовать библиотеки requests, cerberus (либо аналогов). Знание Docker и...",
        "company": "КИБЕР-РОМ"
    },
    {
        "title": "Разработчик Python/Team Lead",
        "url": "https://hh.ru/vacancy/68900069?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Руководство группой разработчиков по проектированию CRM системы с нуля. Создание микросервисов для взаимодействия с другими системами. Документирование решения. \nОпыт в должности Team Lead, обязательный опыт разработки CRM. Владение Python на уровне senior-разработчика. Опыт работы c Django. ",
        "company": "GSL Law & Consulting"
    },
    {
        "title": "Middle Python developer",
        "url": "https://hh.ru/vacancy/70328587?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Писать код по PEP 8. — Тестировать, осуществлять поиск и исправление ошибок в Python-приложениях. — Тестировать, документировать и сопровождать свой код. — \nЗнал Celery, Django/Flask/FastAPI, Pandas, NumPy, io, Selenium, Redis, Postgres. — Обладал опытом работы с HighLoad. — Был способен читать и...",
        "company": "ОООАгентство судебного взыскания"
    },
    {
        "title": "Senior Python (Django) разработчик",
        "url": "https://hh.ru/vacancy/69035681?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проектировать и разрабатывать веб-приложения компании на Python / Django. Самостоятельно декомпозировать задачи бэклога. Оценивать трудоемкость задач вместе с командой. \nОпыт разработки на Python (Go как плюс), опыт с Django Framework от 2-3-х лет обязательно. Умение писать эффективный...",
        "company": "Группа Самолет"
    },
    {
        "title": "Senior Software Engineer (Python)",
        "url": "https://hh.ru/vacancy/70708584?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Software development. Highload and high available web stack services to support various customer journeys (Identity Management, Billing Management). \n4+ years of commercial software development using Python and excellent knowledge of its stack. Experience with projects using asyncio...",
        "company": "EXNESS Global Limited"
    },
    {
        "title": "Python QA Automation (Middle)",
        "url": "https://hh.ru/vacancy/70666241?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка новых автотестов. Сопровождение существующих автотестов. Улучшение процессов автоматизации тестирования. Мониторинг прохождения автотестов. Обучение и наставничество новых сотрудников.\nВысшее техническое оконченное образование. Опыт автотестирования на Python + pytest от 2 лет. Опыт разработки новых решений, повышающих процент покрытия...",
        "company": "ОООПрософт-Системы"
    },
    {
        "title": "Инженер внедрения стека DevSecOps",
        "url": "https://hh.ru/vacancy/69430968?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Платформа построена на базе NodeJS/Java11/Python с использованием фреймворков Angular 9, Spring Framework 5. Ваши задачи: - Проведение первоначальной...\nУверенное владение командной строкой в ОС семейства Linux. Опыт написания скриптов на bash/python. Опыт работы и настройки JVM. ",
        "company": "Swordfish Security"
    },
    {
        "title": "Программист Python",
        "url": "https://hh.ru/vacancy/69328736?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка и поддержка клиентских и не только интерфейсов. Программирование Python. Ждем в команду программиста backend или full-stack, который знаком...\nЯзык - python 2.7 , 3.6. Субд - postgresql 9.2 + mssql. Django rest framework. Уверенное владение Linux (ubuntu).",
        "company": "Дельта системы безопасности"
    },
    {
        "title": "Python разработчик Middle/Senior",
        "url": "https://hh.ru/vacancy/68701573?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Управления командой разработчиков. Постановки задач, декомпозиции. Ревью кода. Сборки / подготовки релизов. WebSocket, Elastic, consul, Docker, Linux. Строительства распределенных систем и...\nУверенные знания и достаточный для решения задач опыт разработки на Python 3+. Умение работать с git. Знание и опыт...",
        "company": "Аквариус, Группа компаний"
    },
    {
        "title": "Преподаватель онлайн-школы программирования для подростков",
        "url": "https://hh.ru/vacancy/70103171?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "В том числе студент, выпускник или аспирант ведущего вуза. Имеешь опыт в области программирования (Python), опыт работы с Git. ",
        "company": "MAXIMUM EDUCATION"
    },
    {
        "title": "Data-инженер",
        "url": "https://hh.ru/vacancy/69331720?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в разработке ядра продуктов Data Platform. Разработка и оптимизация процессов выгрузки данных.\nЗнание одного из языков программирования: Python, Java, Go. Знание основ ООП, теории алгоритмов, структур данных. Знание SQL. Опыт написания процессов...",
        "company": "Тинькофф"
    },
    {
        "title": "ML-разработчик (Телеком)",
        "url": "https://hh.ru/vacancy/70459155?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Опыт написания \"с нуля\" нейросетевых инструментов (спектр достаточно широкий - библиотеки под supervised learning, unsupervised learning, reinforcement learning; различные функции активации...\nГлубокое понимание принципов работы различных архитектур нейросетей. Опыт работы с Reinforcement Learning: агенты «классические» типа Deep Q-Network (DQN), Policy...",
        "company": "TQB Russia"
    },
    {
        "title": "Python + Go Developer (удаленно)",
        "url": "https://hh.ru/vacancy/70514354?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать бекенд для нового проекта. - Следовать микросервисной архитектуре. - Проведение код-ревью и написание unit-тестов. - Писать хорошие мануалы, документацию по...\nОпыт разработки на Go под Linux. - Опыт на Python от 2-х лет и Django/DRF. - Опыт тестирования своего кода. - ",
        "company": "IT and Digital"
    },
    {
        "title": "Python-разработчик",
        "url": "https://hh.ru/vacancy/70362884?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка внутренних web-сервисов на Python. Разработка удобных инструментов управления платформой (админки, системы генерации отчетов и т.д.). \nОбщий опыт работы в должности Back-end разработчика от 2 лет. Хорошие знания Python 3. Знание одного из веб-фреймворков...",
        "company": "Softline"
    },
    {
        "title": "Middle Python Developer / Data Engineer (Python) в команду ML Space Data Catalog",
        "url": "https://hh.ru/vacancy/70696786?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка и поддержка существующих решений, связанных с ETL/ELT-процессами. Участие в проектировании, разработке и поддержке высоконагруженных сервисов/микросервисов. \nЗнакомство с Kubernetes, хорошие навыки работы с Docker. Отличное владение Python, умение работать с асинхронным кодом. Знание стека Big Data...",
        "company": "Cloud"
    },
    {
        "title": "Junior Full Stack Web-разработчик (Python)",
        "url": "https://hh.ru/vacancy/67881931?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддержка, доработка и разработка. Внутренних сайтов и сервисов компании. Внешних Web-проектов компании. Поддержка и разработка демо-площадок для презентаций...\nЗнания и опыт работы с JavaScript, HTML5, CSS3. Опыт работы с Python (Django/Flask). Понимание принципов работы с...",
        "company": "Актив"
    },
    {
        "title": "Разработчик Python / Python Backend Developer",
        "url": "https://hh.ru/vacancy/70366984?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Отличные знания и опыт разработки на Python (фреймворк Flask или Django) от 2-х лет. Хорошие знания и опыт работы...",
        "company": "Новео"
    },
    {
        "title": "Дата инженер (Data engineer) Управление модельных рисков и валидации",
        "url": "https://hh.ru/vacancy/70506992?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "...помощью Python. Построение витрин данных (SQL, Python). Преобразование данных из различных форматов (xml, json) к табличному виду с помощью Python. \nОпыт работы в ИТ компаниях, подразделениях ИТ или рисков банка от 1 года. Уверенные знания SQL, Python. Знание PySpark как...",
        "company": "Банк ВТБ (ПАО)"
    },
    {
        "title": "DevOps инженер (Ansible/Python)",
        "url": "https://hh.ru/vacancy/70370946?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Активно участвовать в разработке, развитии и поддержке системы управления развертыванием Big Data сервисов (Hadoop, Clickhouse, Greenplum). Работать c системой отслеживания...\nОбладаете знанием английского языка на уровне понимания технической документации. Знание Python. Опыт работы с системами виртуализации (KVM ,VMware, OpenStack). ",
        "company": "ОООАренадата Софтвер"
    },
    {
        "title": "Автор / Преподаватель курса \"Data Engineer\" (Онлайн)",
        "url": "https://hh.ru/vacancy/69988516?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Составление программы курса. Подготовка к занятиям. Проведение вебинаров (по 2,5 часа, 2 раза в неделю). Проверка и разборы домашних...\nОпыт в на позиции Data Engineer от 2-х лет. Владение Python. Умение разрабатывать и оптимизировать ETL-процессы (пакетные и...",
        "company": "Level UP"
    },
    {
        "title": "Senior/Lead Python-разработчик",
        "url": "https://hh.ru/vacancy/69941482?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Задачи с высоким уровнем ответственности: предстоит проектировать архитектуру, реализовывать бизнес-логику, самостоятельно принимать решения, запускать сервисы с необходимым уровнем качества. \nГибкость: продукты Контура постоянно адаптируются под рынок и пользователей, нужно уметь работать в меняющихся условиях.",
        "company": "Контур"
    },
    {
        "title": "Senior/Lead Python-разработчик",
        "url": "https://hh.ru/vacancy/69941310?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Задачи с высоким уровнем ответственности: предстоит проектировать архитектуру, реализовывать бизнес-логику, самостоятельно принимать решения, запускать сервисы с необходимым уровнем качества. \nГибкость: продукты Контура постоянно адаптируются под рынок и пользователей, нужно уметь работать в меняющихся условиях.",
        "company": "Контур"
    },
    {
        "title": "Преподаватель Python",
        "url": "https://hh.ru/vacancy/69772801?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проводить лекции и семинары, по программированию на языке Python. Проверять итоговые работы участников курса. Вести учет успеваемости и...\nЗнание Python — уровень «как свой родной». Опыт создания лекционных материалов. Опыт работы в качестве репетитора / учителя / преподавателя / наставника/ тьютора. ",
        "company": "К Телеком,ООО"
    },
    {
        "title": "Data Scientist",
        "url": "https://hh.ru/vacancy/70360322?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Построение поведенческих моделей по различным продуктам Банка с применением статистических и математических подходов. Подготовка данных для исследований и для задач...\nЗнание Python, в том числе уверенное знание библиотек Pandas, Numpy, Sklearn, Xgboost/LightGBM/CatBoost. Владение инструментами для визуализации Matplotlib, Seaborn...",
        "company": "ПАОБанк Санкт-Петербург"
    },
    {
        "title": "Python Middle Backend Developer (FastAPI) (Ижевск)",
        "url": "https://hh.ru/vacancy/69844555?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка по ТЗ. Участие в постановке задач. Участие в аналитической проработке. Серверная разработка на интересном долгоиграющем проекте Fintech (под клиенты...\nИнтеллектуальный подход и здравый смысл. Коммерческий опыт FastAPI. Общий опыт Python от года.",
        "company": "DEV-STACK"
    },
    {
        "title": "Senior/Lead Python-разработчик",
        "url": "https://hh.ru/vacancy/69941486?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Задачи с высоким уровнем ответственности: предстоит проектировать архитектуру, реализовывать бизнес-логику, самостоятельно принимать решения, запускать сервисы с необходимым уровнем качества. \nГибкость: продукты Контура постоянно адаптируются под рынок и пользователей, нужно уметь работать в меняющихся условиях.",
        "company": "Контур"
    },
    {
        "title": "Преподаватель онлайн-школы программирования для подростков",
        "url": "https://hh.ru/vacancy/70018903?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "В том числе студент, выпускник или аспирант ведущего вуза. Имеешь опыт в области программирования (Python), опыт работы с Git. ",
        "company": "MAXIMUM EDUCATION"
    },
    {
        "title": "Backend разработчик python",
        "url": "https://hh.ru/vacancy/69286252?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в проектировании и реализации архитектурных решений. Реализация модулей взаимодействия между сервисами, приложениями и серверами. Код- ревью разработки внешней команды.\nОпыт работы в виде разработчика микросервисных решений на базеbackend технологий языка Python (Flask, FastAPI). Знание AMQP брокеров сообщений RabbitMQ, Redis...",
        "company": "ПАО «Газпром нефть»"
    },
    {
        "title": "Программист Python",
        "url": "https://hh.ru/vacancy/66974182?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Знание Python или иных скриптовых языков с последующей миграцией на Python. Хорошее знание SQL. Умение и желание писать качественный, поддерживаемый...",
        "company": "Тензор"
    },
    {
        "title": "Разработчик курса / методист / преподаватель курсов по Machine Learning",
        "url": "https://hh.ru/vacancy/69544844?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Ключевое - способность самостоятельно разработать курс, возможно, и читать его. Знание Python, опыт работы с фреймворками: Tensor Flow, Keras, Theano, Scikit...",
        "company": "РДТЕХ"
    },
    {
        "title": "Data Scientist, Middle",
        "url": "https://hh.ru/vacancy/70685809?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать витрины данных. Разрабатывать математические модели прогнозирования поведения клиентов, LTV, NBO. Проводить А/В тесты, создавать метрики для анализа их...\nОбладаете навыками проведения анализа данных на языке Python / R (исследовательский и статистический анализ данных, проверка статистических гипотез, A/B анализ). ",
        "company": "ПАОБАНК УРАЛСИБ"
    },
    {
        "title": "Разработчик RTL",
        "url": "https://hh.ru/vacancy/70094302?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка RTL описания узлов заказной СБИС. Тестирование. Возможно участие в перекрестной верификации.\nОпыт разработки устройств, работающих на ПЛИС высокой степени интеграции например, таких компаний, как Xilinx, Altera (Intel). Знание цифровой электроники. ",
        "company": "Мотив Нейроморфные Технологии"
    },
    {
        "title": "Программист Python",
        "url": "https://hh.ru/vacancy/69163506?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка кастомизаций с использованием скриптов на Groovy. Разработка кода на Python (на уровне написания веб-сервисов), sql, unix, bash, docker. \nОпыт разработка кода на Python. Опыт написание скриптов на Groovy. Опыт проведения тестирования внедренных решений. Усидчивость, умение работать в команде.",
        "company": "Газпромбанк"
    },
    {
        "title": "Middle/Senior Python Developer",
        "url": "https://hh.ru/vacancy/70476482?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Алгоритмизация поведения (баны, фильтры, триггеры получения бонусов). Написание интернет-магазинов.\nСпособностью телепортации между Python Web фреймворками (Django/Flask). Сверхчеловеческой ловкостью и гибкостью при интеграциях (REST API). Повышенной скоростью и силой...",
        "company": "ОООЛидми сейлс девсолюшн"
    },
    {
        "title": "Программист Python",
        "url": "https://hh.ru/vacancy/69974989?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка программного обеспечения под Debian Linux и PostgreSQL на основе Python. Отладка и оптимизация приложений. Разработка, актуализация технической документации (инструкции...\nЗнание Linux на уровне продвинутого пользователя. Опыт разработки на Python. Знание SQL, опыт работы с базами данных. Опыт работы с...",
        "company": "ЗАОИТ в судостроении"
    },
    {
        "title": "Python developer (Django)",
        "url": "https://hh.ru/vacancy/70365578?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Дополнительные бонусы: аккредитованная IT-компания, программа лояльности, скидки от партнеров, программа материальной помощи, сервис по отслеживанию физического и ментального здоровья...\nОпыт разработки на Python/Django от 3-х лет. Опыт работы с PostgreSQL/Redis. Опыт коммерческой разработки REST API. ",
        "company": "Kokoc Group"
    },
    {
        "title": "Middle/Senior Python Developer",
        "url": "https://hh.ru/vacancy/69054293?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Опыт работы Python Dev от 3х лет. Unix-пользователь. Понимание паттернов проектирования. Ответственность и самостоятельность.",
        "company": "ОООМВП"
    },
    {
        "title": "ETL Developer AirFlow + Python",
        "url": "https://hh.ru/vacancy/69036350?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка\\Доработка ETL-процессов на Python. Отладка существующих ETL-процессов, поиск и исправление ошибок. Проверка данных. Работа с аналитиками над...\nЗнание SQL на уровне эксперта. Уверенное знание Python, опыт минимум 1 год. Опыт работы с Airflow не менее 1 года. ",
        "company": "DBI"
    },
    {
        "title": "Data Engineer",
        "url": "https://hh.ru/vacancy/69471555?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в разработке ядра продуктов Data Platform. Разработка и оптимизация процессов выгрузки данных.\nЗнание одного из языков программирования: Python, Java, Go. Знание основ ООП, теории алгоритмов, структур данных. Знание SQL. Опыт написания процессов...",
        "company": "Тинькофф"
    },
    {
        "title": "QA Automation/SDET (Python) в Tarantool",
        "url": "https://hh.ru/vacancy/70371375?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддержка физических серверов для тестирования и разработки. Доработка существующей тест-обвязки (написана на Python). Настройка бенчмарков и сравнительных тестов. \nПонимание CI/CD-процессов (Github). Опыт программирования на Python или C — от 2 лет. Опыт работы со средствами мониторинга и...",
        "company": "VK"
    },
    {
        "title": "Разработчик Python (backend)",
        "url": "https://hh.ru/vacancy/68873184?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать веб- приложения в команде на языке Python 3. Писать автоматические тесты для своего кода. Работа с системами контроля версий...\nНаличие высшего технического образования. Хорошее знание Python (мы используем Python 3). Опыт работы с AIOHTTP(FLASK, Django). Опыт работы с...",
        "company": "АОТочных Приборов, НИИ"
    },
    {
        "title": "Аналитик по монетизации (Реклама)",
        "url": "https://hh.ru/vacancy/69497411?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Базы: Clickhouse, mySql, hadoop. Инструменты: Python, Airflow, gitlab. Визуализация: Redash, superset, matPlotLib. Задачи: Погрузиться в специфику работы рекламной платформы. \nБудет плюсом: Опыт написания ETL c помощью различных инструментов. Владение python (jupyter, pandas, matPlotLib, редко pySpark). Хорошее понимание, как работает...",
        "company": "VK, ВКонтакте"
    },
    {
        "title": "Pipeline developer / Пайплайн разработчик (Python)",
        "url": "https://hh.ru/vacancy/70043629?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Нужно будет разрабатывать новый функционал в соответствии с обновляемым бэклогом, отлавливать и устранять баги в уже существующем коде, иногда рефакторить...\nТы подойдешь, если. Имеешь крепкие Problem Solving Skills. Способен четко и внятно выражать свои мысли на русском языке. ",
        "company": "Сила Света"
    },
    {
        "title": "Инженер-программист (Middle Automation QA)",
        "url": "https://hh.ru/vacancy/70911622?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Тестирование биллинговых систем компании. Автоматизация функционального и нефункционального тестирования на Python. Проведение бизнес-анализа поступающих задач на тестирование или автоматизацию. \nЗнание принципов автоматизации тестирования. Знание принципов ООП. Знание языка программирования Python не ниже уровня Middle. Умение работать с dev tools...",
        "company": "А1. Информационные технологии, телеком"
    },
    {
        "title": "QA Automation Engineer Python/Автотестировщик",
        "url": "https://hh.ru/vacancy/68820590?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Написание сценариев тестирования микросервисного приложения. Работа с тест кейсами. Разделение сценариев на регрессионное тестирование и НФТ. Подготовка тестовых данных. \nОпыт работы в области информационных технологий не менее года. Знание и понимание Python, PySpark, Hive, Ozzie. Знание http, rest. ",
        "company": "Лига Цифровой Экономики"
    },
    {
        "title": "Математик - программист",
        "url": "https://hh.ru/vacancy/69184943?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Формулировать оптимизационные задачи (линейное программирование, программирование в ограничениях) на базе как коммерческих солверов CPLEX, Gurobi (Python API), так и на...\nЗдорово, если у тебя уже есть опыт работы, но мы готовы рассмотреть и без. Знание Python - обязательно. Знание IBM ILOG...",
        "company": "АОРамакс Интернейшнл"
    },
    {
        "title": "Backend разработчик со знанием Python",
        "url": "https://hh.ru/vacancy/69995062?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проектировать и реализовывать новый, а также дорабатывать существующий функционал. Реализовывать API на Python с использованием Alembic. Интегрировать API со сторонними...\nDocker. Управление и работа с AWS. Django. Создание тестов. Python (от 3+ лет). MySQL/PostgreSQL (от 2+ лет). ",
        "company": "Vyyer Technologies"
    },
    {
        "title": "Senior Python developer",
        "url": "https://hh.ru/vacancy/66522082?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка и сопровождение существующего основного продукта компании FindFace Multi (Python 3.6+). Code review и участие в обсуждении задач...\nЗнание Python 3.6+ и его стандартной библиотеки, особенно модуля asyncio. Владение Linux на уровне “продвинутого пользователя”, bash. ",
        "company": "ОООНТехЛаб"
    },
    {
        "title": "Data-инженер",
        "url": "https://hh.ru/vacancy/66672507?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в разработке ядра продуктов Data Platform. Разработка и оптимизация процессов выгрузки данных.\nЗнание одного из языков программирования: Python, Java, Go. Знание основ ООП, теории алгоритмов, структур данных. Знание SQL. Опыт написания процессов...",
        "company": "Тинькофф"
    },
    {
        "title": "Разработчик Python (ALD)",
        "url": "https://hh.ru/vacancy/70052938?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Реализация back-end для продукта. Оценка входящих задач и соблюдение сроков выполнения. Реализация нового функционала / доработка существующего функционала в компонентах...\nОтличные знания языка Python версий 2.x и 3.x. Знакомство с фреймворками Flask / Django / Sanic. Опыт работы с ОС...",
        "company": "Группа компаний Астра"
    },
    {
        "title": "Преподаватель курсов «Программирование на языке Python»",
        "url": "https://hh.ru/vacancy/70149073?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Владение Python, в т.ч.: Структурное, процедурное, объектно-ориентированное программирование. Структуры данных. Среда разработки, библиотеки Python. Модули и пакеты и...\nУмение работать с Docker. Базовые знания HTML, CSS, JS. MySQL. Знание Ubuntu/Linux. Jira, Confluence, Bitbucket, TestRail. Технический английский. ",
        "company": "Центр компьютерного обучения СПЕЦИАЛИСТ при МГТУ им. Н.Э.Баумана"
    },
    {
        "title": "Senior Python разработчик",
        "url": "https://hh.ru/vacancy/70142011?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Работаем по Scrum (гибрид), кросс-функциональная команда, возможность решать сложные и интересные задачи Data подразделения. Развитие английского с помощью субсидированных...\nОпыт работы разработки web-сервисов (backend) на языке Python – не менее 2-х лет. Продвинутый уровень владения SQL. ",
        "company": "Magenta Technology"
    },
    {
        "title": "Middle Python-разработчик",
        "url": "https://hh.ru/vacancy/69967690?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Реализация микросервисов (написание с нуля, либо вынесение из имеющегося кода). Расширение существующего REST API. Реализация взаимодействия с внешними сервисами. \nУверенное знание Python 3. Знание алгоритмов и структур данных. Уверенное знание Django (Flask будет плюсом), SQL, Docker. Понимание микросервисной архитектуры. ",
        "company": "ОООНУР Телеком"
    },
    {
        "title": "Web-разработчик (Python)",
        "url": "https://hh.ru/vacancy/69981184?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка, поддержка и сопровождение сайтов и веб-сервисов компании.\nЗнание Python (опыт работы от 2-3 лет). Знание Django (другого аналогичного фреймворка). Знание SQL, плюсом будет опыт работы с...",
        "company": "Доктор Веб"
    },
    {
        "title": "Middle/Senior Python разработчик",
        "url": "https://hh.ru/vacancy/70477729?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Используемый стек: Python 3.9, FastAPI, SQLAlchemy, Kubernetes, Docker, реляционные БД.  Основные задачи: разработка высоконагруженных сервисов/микросервисов; написание юнит-тестов...\nВажно: опыт с Python (умение работать с асинхронным кодом); FastAPI framework; Kubernetes, Docker; Kafka/RabbitMQ; знание SQL и умение работать...",
        "company": "Marksman"
    },
    {
        "title": "QA Automation Engineer (Python)",
        "url": "https://hh.ru/vacancy/69352155?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Общение с разработчиками и аналитиками. Разработка тест-кейсов и тест-планов. Автоматизация тестирования веб-интерфейсов, API и взаимодействия между сервисами. \nОпыт разработки тестов на Python 3.x. Владение тестовым фреймворком Pytest. Умение работать с Selenium и браузерами в headless режимах. ",
        "company": "Группа компаний Астра"
    },
    {
        "title": "Разработчик - геофизик (python)",
        "url": "https://hh.ru/vacancy/69809365?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в разработке программного обеспечения. Исполнение вверенных проектов по профильному направлению. Участие в подготовке проектной документации, программ и методик испытаний. \nОпыт программирования от 1 года. Знание языков программирования Python 3 (библиотеки анализа данных и машинного обучения), C++. Знание основ и...",
        "company": "ПАО «Газпром нефть»"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/69297147?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Базы данных: Postgres, Clickhouse. Взаимодействия: REST API, JSON, Rabbit MQ. Разработка: Python, React, Ruby. Умеете разделять приложение на сервисы, предлагать...\nБольшой опыт работы с Python (мы используем Python 3.6+) и смежными технологиями. Django, DRF, Celery, - вы пробовали что...",
        "company": "Сбер. IT"
    },
    {
        "title": "Разработчик Python (Middle, Senior)",
        "url": "https://hh.ru/vacancy/55088580?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Высоконагруженные распределенные системы дистрибуции и кэширования данных. Кластерные системы обработки массивов данных. Web-сервисы. Системы защиты веб-ресурсов от угроз...\nНаши ожидания относительно знаний, навыков, опыта: Опыт коммерческой разработки на Python под Unix - не менее 3-х лет, опыт работы...",
        "company": "NGENIX"
    },
    {
        "title": "Fullstack Python+JS Developer",
        "url": "https://hh.ru/vacancy/70352702?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Количество современных угроз возрастает c каждым днем, и теперь необходимы новые продукты для оперативного обнаружения и предотвращения этих угроз. \nВысшее образование. Опыт разработки на python. Опыт разработки в frontend, знание js или ts и фреймворка: react. Умение разбираться в...",
        "company": "Лаборатория Касперского"
    },
    {
        "title": "Middle / Senior Python developer",
        "url": "https://hh.ru/vacancy/69625290?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Ищем опытного Python developer в команду по разработке сервиса генерации синтетических данных с помощью ML алгоритмов. Задачи: Создание DAG, сервисов...\nЖелателен опыт работы с технологиями: Flask, Django, Python, AirFlow, SQL и основные РСУБД. Будет плюсом, но не обязателен опыт работы...",
        "company": "Techno Diasoft"
    },
    {
        "title": "Инженер-программист (Python)",
        "url": "https://hh.ru/vacancy/69865289?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка программ, компонентов программ и программных модулей на языке Python. Разработка алгоритмов управления и взаимодействия в программах. Разработка графических пользовательских...\nТехническое образование. Профессиональное знание Python, опыт программирования на языках высокого уровня. Знание современных средств разработки ПО и технологий. ",
        "company": "ОООДЕЛС"
    },
    {
        "title": "Python-разработчик (Совкомбанк Технологии)",
        "url": "https://hh.ru/vacancy/69063317?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Развитием собственных систем (разработка продукта, интеграция с внешними и внутренними сервисами, доработка текущего функционала). Реализация и сопровождение системы в боевом...\nОпыт работы с языком программирования Python от 2-х лет. Хорошее знание базовых библиотек Python. Опыт работы с Django для...",
        "company": "ОООСовкомбанк Технологии"
    },
    {
        "title": "Разработчик Python (ML)",
        "url": "https://hh.ru/vacancy/69978644?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Стрим Применение моделей - технологический стрим Департамента анализа данных и моделирования, который отвечает за внедрение математических моделей в промышленную эксплуатацию и...\nКакие знания и навыки для нас важны: Опыт работы с BigData. Знание принципов ООП. Знание Python (разработки веб-приложений/сервисов...",
        "company": "Иннотех, Группа компаний"
    },
    {
        "title": "Python-разработчик в Цифровые поверхности Салют (направление B2B2C)",
        "url": "https://hh.ru/vacancy/69958088?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка API. Разработка сценариев для голосовых навыков. Интеграция сторонних сервисов. Участие в полном цикле разработки – проектирование, программирование, тестирование, поддержка. \nОпыт промышленной разработки на Python от 2-х лет. Отличное знание SQL (на уровне составления достаточно сложных запросов и их...",
        "company": "Сбер. IT"
    },
    {
        "title": "Python developer (ETL, ЦЕХ)",
        "url": "https://hh.ru/vacancy/70522882?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в разработке архитектуры и создании библиотек ETL Framework для загрузки в DWH Greenplum. Разработка API асинхронных служебных сервисов.\nОпыт работы от 3 лет в роли разработчика Python. Опыт работы с DWH на базе Greenplum, Exadata, Teradata. ",
        "company": "Иннотех, Группа компаний"
    },
    {
        "title": "Senior SDET (Python)",
        "url": "https://hh.ru/vacancy/66592598?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в развитии и интеграции экосистемы автоматизации (тестовый фреймворк, CI, TMS, Issue Tracker, VCS, etc...). Разработка автотестов на Python для...\nОпыт разработки на Python от 5 лет. Уверенное владение ООП (кроме наследования и инкапсуляции) будьте готовы к вопросам по шаблонам...",
        "company": "МойОфис"
    },
    {
        "title": "Middle python разработчик (DBааS)",
        "url": "https://hh.ru/vacancy/70410107?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка сценариев автоматизации применительно к БД Postgres, в перспективе MongoDВ, Redis. Интеграция сценариев автоматизации в портал управления СУБД.\nОпыт разработки на Python с использованием RabbitMQ, Dramatiq, Ansible (как преимущество). Опыт администрирования Linux (RHEL / Ubuntu), Postgres. Опыт работы с...",
        "company": "ПАО«МТС», IT"
    },
    {
        "title": "QA Auto (Python)",
        "url": "https://hh.ru/vacancy/68682861?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Тестировать. Мы используем автоматизированное тестирование, но не боимся тестировать вручную если необходимо. Анализировать требования и прорабатывать тест-кейсы. \nЗнанием теории и методик тестирования. Опытом в автоматизации тестирования на Python. Знанием основ Linux/Unix. Имеет опыт работы с PostgreSQL. ",
        "company": "SberTech"
    },
    {
        "title": "Python developer",
        "url": "https://hh.ru/vacancy/68896503?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка и развитие существующих веб-приложений и новых проектов. Участие в проектировании и реализации архитектуры систем. Интеграция сторонних сервисов. \nОпыт Backend разработки с использованием Python 3. Опыт работы с Django, Celery. Опыт работы с SQL, noSQL базами данных. ",
        "company": "НеоБИТ"
    },
    {
        "title": "Разработчик python",
        "url": "https://hh.ru/vacancy/69592503?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка, поддержка и развитие собственной “системы компьютерной симуляции и тестирования стратегий”. (Python, SQL, Git ). Разработка новых модулей системы для бэктестинга...\nОпыт коммерческой разработки на Python от 2 лет. Опыт работа с библиотеками по анализу данных. Знание алгоритмов и структур данных. ",
        "company": "585, Холдинг"
    },
    {
        "title": "Backend разработчик со знанием Python",
        "url": "https://hh.ru/vacancy/69995066?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проектировать и реализовывать новый, а также дорабатывать существующий функционал. Реализовывать API на Python с использованием Alembic. Интегрировать API со сторонними...\nDocker. Управление и работа с AWS. Django. Создание тестов. Python (от 3+ лет). MySQL/PostgreSQL (от 2+ лет). ",
        "company": "Vyyer Technologies"
    },
    {
        "title": "Data Engineer (c практическим уклоном в Python)",
        "url": "https://hh.ru/vacancy/69713278?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка, внедрение и поддержка конвейеров сбора данных для наших ML-моделей. Совместная работа с командой разработчиков программного обеспечения для обеспечения...\nОпыт работы в проектах по работе с большими данными от 3 лет. Опыт разработки программного обеспечения на Python, Spark, Hadoop...",
        "company": "ЧАСТНАЯ КОМПАНИЯ MD KZ LTD."
    },
    {
        "title": "Исследователь данных (удаленно)",
        "url": "https://hh.ru/vacancy/69706876?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Выявлять скрытые тенденции и закономерности, описывать их в том числе в виде аналитических материалов. — Дизайн и подведение итогов A/B...\nУмение писать чистый, читаемый код на Python. — Уверенные знание SQL (составление сложных запросов и их оптимизация). — Отличные навыки презентации результата. — ",
        "company": "ВкусВилл. Офис"
    },
    {
        "title": "Разработчик Backend (Python, Django)",
        "url": "https://hh.ru/vacancy/69989490?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка, мониторинг и постоянное улучшение производительности всех компонентов приложения. Прототипирование и разработка backend логики и архитектуры для web-проектов. \nОпыт разработки на Python (Django). Опыт работы с RESTful API. Опыт разработки сервисов с использованием PostgreSQL в качестве базы данных. ",
        "company": "ОООИнсайт Люди"
    },
    {
        "title": "Middle\\Senior Python-разработчик",
        "url": "https://hh.ru/vacancy/70530961?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участвовать в разработке проектов в сфере технологий виртуализации. Разрабатывать backend (REST API + hardware) для новых и уже существующих сервисов. \nОтличное знание Python, Linux, Django, PostgreSQL, Redis, RabbitMQ. Опыт использования gitlab (CI/CD), Jenkins, Nexus. Опыт написания unit-тестов. ",
        "company": "КРОК"
    },
    {
        "title": "Программист Python (Голосовой робот)",
        "url": "https://hh.ru/vacancy/69764222?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка сценарной логики голосового робота. Разработка backend для аналитики голосового робота. Обеспечение масштабируемости ПО.\nОпыт промышленной разработки от 1 года на Python. Умение писать тесты, знакомство с подходом TDD. Самостоятельность, умение анализировать и структурировать...",
        "company": "Сбер. IT"
    },
    {
        "title": "Data/Product Analyst",
        "url": "https://hh.ru/vacancy/68975878?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Анализ данных, поиск инсайтов. Дизайн и проведение AB тестов, анализ результатов. Построение дашбордов в BI системе. Проведение продуктовых исследований. \nЗнание статистики (описательная статистика, корреляционный и регрессионный анализ, стат. тесты и пр.). Уверенное знание Python. Автономность, умение находить лучшее решение...",
        "company": "ОООВиэйинтеллидженс"
    },
    {
        "title": "Главный инженер-программист (Программист-разработчик нейронных сетей)",
        "url": "https://hh.ru/vacancy/68699847?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатка AI программных обеспечений СамГМУ в Python. Реализация алгоритмов машинного обучения. Визуализация данных. Исследование архитектуры нейросетей университета.\nОбладаете знаниями ML и DL. Имеете опыт разработки на Python (знание numpy, pandas, PIL или OpenCV). Обладаете знаниями современных архитектур...",
        "company": "ФГБОУ ВО Самарский государственный медицинский университет МЗ РФ"
    },
    {
        "title": "Преподаватель по курсу Python",
        "url": "https://hh.ru/vacancy/70471877?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проводить лекции по Python. Уроки проходят в онлайн среде. Проверять работы школьников по курсу Python. Давать обратную связь детям по...\nКоммерческий опыт работы с python и выше от года. Базовые навыки работы с HTML, CSS, jOuery, JavaScript. Будет большим плюсом...",
        "company": "ОООMaxima"
    },
    {
        "title": "Middle Python-разработчик",
        "url": "https://hh.ru/vacancy/69860321?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка и поддержка backend-игр (Android, iOS, web). Разработка и поддержка аналитического сервиса. Разработка и поддержка админки backend-сервисов для...\nОпыт работы с Python — от 2 лет. Релевантный опыт работы с web-проектами. Уверенный пользователь Linux. Игровой опыт (необходим для...",
        "company": "MY.GAMES"
    },
    {
        "title": "Computer-Vision Инженер (Python)",
        "url": "https://hh.ru/vacancy/66913380?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Имплементация и обучение моделей Perception блока ADAS (в последующем беспилотного автомобиля), таких как детекция, сегментация, треккинг и т.д. \nЗнание Python. Знание CV классического (Opencv). Знание ML/DL (Pytorch). Хорошая математическая подготовка. Работа с git, bash, docker. ",
        "company": "АОКама"
    },
    {
        "title": "Middle Backend Developer (Python)",
        "url": "https://hh.ru/vacancy/70139178?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка высоконагруженных сервисов для внутреннего портала по работе с полевыми сотрудниками. Участие в проектировании сервисов совместно с архитекторами и техическим...\nОпыт коммерческой разработки на Python от 3 лет. Опыт работы с fastApi или другими async-фреймворками. Понимание и опыт работы...",
        "company": "ОООNapoleon IT"
    },
    {
        "title": "Ведущий Python-developer",
        "url": "https://hh.ru/vacancy/69841814?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Прорабатывать архитектуру и планировать способы реализации нового функционала. Анализировать способы оптимизации производительности методов бизнес-логики и SQL запросов. \nУверенные знания Python, ООП. Опыт работы с PostgreSQL: построение оптимальных sql-запросов (без использования ORM), умение профилировать запросы. ",
        "company": "Тензор"
    },
    {
        "title": "Data Scientist (Риски)",
        "url": "https://hh.ru/vacancy/69958216?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Ты будешь разрабатывать рисковые модели для риск-движка в процессе кредитования на основании анализа больших баз данных. Взаимодействовать с владельцами...\nОпыт в разработке риск моделей (PD/ LGD/ EAD) на Python является преимуществом. Отличное знание SQL, Python. Понимание основ статистики и...",
        "company": "АОНародный банк Казахстана"
    },
    {
        "title": "Python Developer (Asgard)",
        "url": "https://hh.ru/vacancy/67006098?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Asgard состоит из множества распределенных сервисов, которые взаимодействуют друг с другом. Пользователи описывают сборочные задачи в виде дерева и передают...\nХорошие знания Python. Знание алгоритмов и структур данных. Умение самостоятельно доводить до конца поставленные задачи. Интерес к исследовательской деятельности. ",
        "company": "Лаборатория Касперского"
    },
    {
        "title": "Python-разработчик в команду разработки биллинговой платформы",
        "url": "https://hh.ru/vacancy/69351836?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разрабатывать модули биллинговой системы (например: модуль скидок, обработка входящих платежей). Проектировать и развивать функционал биллинговой и аккаутинговой систем. \nОтличное знание Python >3.5. Опыт разработки с учетом постоянно обновляющихся требований. Опыт работы с базами данных (в частности, с...",
        "company": "Selectel"
    },
    {
        "title": "Разработчик Python",
        "url": "https://hh.ru/vacancy/69732332?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддерживать существующие и разрабатывать новые функциональные возможности проекта. Участвовать в проектах внедрения: настройка системы, доработка функционала под требования заказчиков. \nОпыт разработки на Python (Django). Опыт работы с Docker и Linux. Знание протоколов SOAP, SNMP. Опыт работы с сетевыми устройствами...",
        "company": "Printum"
    },
    {
        "title": "Программист-исследователь (проект Поиск)",
        "url": "https://hh.ru/vacancy/70348054?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Улучшение качества поисковой системы. Обучение и внедрение моделей ранжирования. Разработка факторов ранжирования. Обучение и внедрение моделей под задачи NLP, от...\nОтличное знание Python. Владение C++ на рабочем уровне. Хорошее знание классических алгоритмов и структур данных. Понимание базовых алгоритмов машинного обучения. ",
        "company": "VK"
    },
    {
        "title": "Junior DevOPS Engineer (OnPrem Team)",
        "url": "https://hh.ru/vacancy/68165906?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Устранение ошибок в системах (самостоятельно или с привлечением специалистов). Заниматься автоматизацией рутинных задач разработки и эксплуатации (Jenkins, ansible, python).\nОпыт практического взаимодействия (можно учебного опыта) с ansible, terraform, docker. Знакомство с Python, Bash. Знание основ функционирования любого сервера web...",
        "company": "Just AI"
    },
    {
        "title": "Python Developer (Partners)",
        "url": "https://hh.ru/vacancy/69872911?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Поддержка и развитие внешнего API для партнеров. Технические задачи, связанные с мониторингом, рефакторингом, оптимизацией проектов. Интеграция с другими внутренними микросервисами...\nОпыт работы с Python от двух лет. Опыт работы с Django от года. Базовые знания SQL. Понимание принципов построения сервисов. ",
        "company": "Emerging Travel Group (Ostrovok.ru, B2B.Ostrovok, RateHawk, ZenHotels)"
    },
    {
        "title": "Преподаватель по программированию (Python, С++, Java)",
        "url": "https://hh.ru/vacancy/70510984?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "методические пособия с подробной инструкцией на каждый урок. - Участие в промо-мероприятиях и конференциях.\nполезный опыт от международной компании (с опытом работы в Силиконовой долине). - Транслирование программ КиберШколы по методическим пособиям и передача практического...",
        "company": "ИПZMG.KZ"
    },
    {
        "title": "Data Engineer (Python)",
        "url": "https://hh.ru/vacancy/68062993?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Experience in ETL/ELT processes design, development, and maintenance. Experience with RDBMS administration tasks (installation, configuration, monitoring, backup, etc.).\n1+ years of Date Engineer or Python experience. Strong knowledge of Python. Strong knowledge and experience in SQL. ",
        "company": "Itransition"
    },
    {
        "title": "Разработчик С++ / Python (HSM)",
        "url": "https://hh.ru/vacancy/69604821?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в разработке новых возможностей продукта. Сопровождение предыдущих версий продукта: доработки и исправление ошибок. Проведение review кода других программистов в...\nХорошее знание С++ (STL, boost). Хорошее знание Python (опыт работы с Flask, Django или аналогами). Опыт разработки на Linux. ",
        "company": "АОИнфоТеКС"
    },
    {
        "title": "Преподаватель программирования",
        "url": "https://hh.ru/vacancy/69842672?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "обучение базовым языкам программирования, написание веб-сайтов. -проводить контрольные, экзамены.\nопыт работы в IT (разработчиком, написание сайтов/приложений/преподавание) не менее 3 лет. -знание языков Python, Java, C++. -",
        "company": "Алматинский колледж менеджмента и сервиса, УО"
    },
    {
        "title": "Разработчик С++ / Python (HSM)",
        "url": "https://hh.ru/vacancy/69604696?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участие в разработке новых возможностей продукта. Сопровождение предыдущих версий продукта: доработки и исправление ошибок. Проведение review кода других программистов в...\nХорошее знание С++ (STL, boost). Хорошее знание Python (опыт работы с Flask, Django или аналогами). Опыт разработки на Linux. ",
        "company": "АОИнфоТеКС"
    },
    {
        "title": "Middle\\Senior Python developer",
        "url": "https://hh.ru/vacancy/68279544?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка бэкэнд сервиса. Разработка бизнес-логики. Разработка интеграционных сервисов с маркетплейсами. Разработка партнерской API.\n...Python 3. Опыт работы с одним из Python веб-фреймворков: Django, Flask, Tornado, FastAPI или аналогичных. Понимание асинхронности в Python. ",
        "company": "Eugene Global Consulting"
    },
    {
        "title": "Python Developer",
        "url": "https://hh.ru/vacancy/70050674?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Current stack is: Docker. Backend team’s responsibilities are: Development and support of the current GraphQL API. Participation in development...\nPython 3.7+. FastAPI , GraphQL. Postgresql 11.6. SqlAlchemy + alembic. Elasticsearch. Have Python excellent skills. Know how to...",
        "company": "Девхаб"
    },
    {
        "title": "Data Engineer",
        "url": "https://hh.ru/vacancy/69994740?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Создание и поддержка работы Хранилища Данных - это сбор, хранение и поддержка инфраструктуры. Создание инструментов сбора и хранения данные в реальном...\nВажно уметь работать с SQL, Python, Docker, Git. Остальным инструментам из нашего стэка готовы учить. Стремление к непрерывному развитию и...",
        "company": "Chocofamily"
    },
    {
        "title": "Data scientist / Python программист по машинному обучению",
        "url": "https://hh.ru/vacancy/68619109?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Осуществлять разработку сервисов в следующих направлениях:\nОпыт разработки на Python. Опыт решения задач (NLP, Computer Vision, Speech recognition) / Data Science задач с использованием Python. ",
        "company": "ГРЧЦ, ФГУП"
    },
    {
        "title": "Middle Backend разработчик (Python)",
        "url": "https://hh.ru/vacancy/69785789?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Писать чистый и производительный код. Анализировать и понимать бизнес-логику продукта. Придерживаться архитектурного стиля REST. Создавать pull requests и проходить...\nОпыт разработки на Python/Django (DRF) более 3-х лет. Знание и понимание работы Django ORM. Опыт работы с Celery. ",
        "company": "ТООSOMNIUM"
    },
    {
        "title": "Разработчик Back-end",
        "url": "https://hh.ru/vacancy/54927527?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка новых облачных сервисов и API интерфейсов для охранно-пожарного оборудования. Разработка сервисов идет на базе Python 3.7+...\nХорошее знание Python, Django, DRF. Опыт работы с SQL, REST API. Опыт работы с Flask. Опыт работы с Docker. ",
        "company": "ЗАОБолид, НВП"
    },
    {
        "title": "Преподаватель Python/Django",
        "url": "https://hh.ru/vacancy/69849572?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Обучение слушателей Python/Django. Регулярная проверка домашнего задания. Разработанная и отточенная методика преподавания.\nРазвитие не только теоретических знаний, но и практических умений и навыков Python/Django у слушателей. Отличное знание Python/Django. ",
        "company": "ОООКомпьютерная Академия IT STEP"
    },
    {
        "title": "Ведущий разработчик Python",
        "url": "https://hh.ru/vacancy/70465487?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка и реализация алгоритмов в виде масштабируемых сервисов. Разработка клиентских и web-приложений. Участие в разработке программно-аппаратных решений для...\nЗнание основных алгоритмов и шаблонов проектирования, современных тенденций в мире программирования. Уверенные знания Python 3.9+. Опыт работы с...",
        "company": "АОГознак"
    },
    {
        "title": "Продуктовый аналитик (Облако)",
        "url": "https://hh.ru/vacancy/68430397?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Облако — один из самых важных проектов в VK, который продолжает активно развиваться и обрастать новыми фичами и выходит на новые...\nПонимание продуктовых метрик.​​​.",
        "company": "VK, ВКонтакте"
    },
    {
        "title": "Ведущий Python-разработчик / Senior Python Developer",
        "url": "https://hh.ru/vacancy/69220588?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Проектировать и разрабатывать сервисы с использованием стека технологий, описанного ниже. Разворачивать разработанные сервисы в Kubernetes-кластер, настраивать их мониторинг, улучшать...\nОтличное знание языка Python, опыт работы с web-фреймворками Flask или FastAPI. Продвинутое знание SQL, понимание нюансов работы СУБД PostgreSQL...",
        "company": "Блондинка.Ру"
    },
    {
        "title": "Программист Python Middle",
        "url": "https://hh.ru/vacancy/69728344?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Участвовать в полном цикле разработки программного обеспечения. Писать высококачественный код на Python.\nОпыт разработки на Python. Опыт работы с Django (Django Rest Framework, Django ORM). Опыт работы с Git, Gitlab. ",
        "company": "Брайт Солюшенз"
    },
    {
        "title": "Backend-Developer Python (middle)",
        "url": "https://hh.ru/vacancy/68616211?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Создавать инструменты, которые усовершенствуют процесс обучения для учеников и репетиторов. Участвовать в принятии архитектурных решений и развитии системы с точки...\nНаличие опыта в веб-разработке от 3-х лет. Уверенное владение Python3 и любым веб-фреймворком (Flask, Django, aiohttp...",
        "company": "Онлайн-школа Тетрика"
    },
    {
        "title": "Разработчик ботов",
        "url": "https://hh.ru/vacancy/70218766?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Создание чат-ботов. Поддержĸа ĸода в случае необходимости. Кратĸое доĸументирование того, ĸаĸ работает ĸод. Пример работ: создание чат бота, в...\nУверенное знание Telegram API и его требования. Знание Python на уровне выше среднего. Умение построить струĸтуру бота в таĸом виде...",
        "company": "ТООALTOR"
    },
    {
        "title": "Разработчик витрин данных",
        "url": "https://hh.ru/vacancy/70470301?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Разработка витрин данных и аналитической отчетности на базе Хранилища данных. Сопровождение витрин данных: оптимизация, пересчет, предоставление прав доступа. \nЗнание особенностей разработки для Greenplum, языка программирования Python приветствуется. Преимуществом является работа связанная с разработкой хранилищ данных и в финансовой...",
        "company": "ПАОБанк Синара"
    },
    {
        "title": "Python разработчик в CM.Expert (Яндекс Вертикали)",
        "url": "https://hh.ru/vacancy/68613186?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Вместе с нами решать сложные архитектурные вопросы. Выполнять обилие разных задач: продуктовые, которые приносят пользу пользователям, совместные задачи с ML...\nБольше трех лет работали с Python 3 с использованием асинхронного программирования. Имели дело с клиент-серверными приложениями и знаете, что...",
        "company": "Яндекс"
    },
    {
        "title": "Python Developer (middle/Senior)",
        "url": "https://hh.ru/vacancy/70355102?from=vacancy_search_list&hhtmFrom=vacancy_search_list&query=python",
        "description": "Управление жизненным циклом приложений, разворачиваемых в изолированных технологических сегментах предприятий: Механизмы для доставки, запуска, эксплуатации сервисов. Централизованные решения для конфигурирования...\nОпыт разработки на Python не менее 3 лет (TDD, юнит и интеграционные тесты). Опыт разработки сложных высоконагруженных систем. ",
        "company": "Группа НЛМК"
    }
]